{
  "course": {
    "id": 3616,
    "subject": "CENG",
    "code": "3300",
    "name": "Data Science for Molecular Engineering",
    "description": "This course is an introductory course on the application of machine learning methods in molecular engineering problems. It covers fundamental data processing and machine learning methods to analyze data in chemistry and biology such as molecular similarity calculation and property prediction.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310,
      2210,
      2130
    ],
    "prerequisites": "<a class=\"course-link\" data-subject=\"COMP\" data-code=\"1021\" href=\"/review/COMP1021\" target=\"_blank\">COMP 1021</a>",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 3,
    "rating_grading": 4,
    "rating_workload": 5,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1522,
        "name": "GAO, Hanyu",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "xR447JON1s7MODfj2FAmOHDsjPK45xQn",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1522,
          "name": "GAO, Hanyu",
          "rating": 1
        }
      ],
      "author": "化工之鬼",
      "date": "Feb 14, 2024",
      "title": "As easy as a primary school class",
      "comment_content": "Part 0. Introduction and Review<br />Week 1 (Sept 4) Real-world applications of data science in physical, chemical and life sciences; basic concepts in linear algebra, calculus and numerical optimization; practice session<br />Week 2 (Sept 11) Review of statistics and probability; practice session<br /><br />Part 2. Data Processing<br />Week 3 (Sept 18) Introduction to Python and Pandas for Processing Tabulated Data; practice session<br />Week 4 (Sept 25) Cheminformatics toolboxes – the example of RDKit; practice session<br />Week 5 (Oct 2) Results visualization – molecules, chemical reactions, trees, graphs<br />Week 6 (Oct 9) Results visualization – practice session; Introduction to common supervised learning problems in molecular engineering<br /><br />Part 3. Supervised Learning<br />Week 7 (Oct 16) Introduction to common supervised learning problems in molecular engineering – practice session; Linear regression - molecular property predictions and feature importance<br />Week 8 (Oct 23) Linear regression - molecular property predictions and feature importance – practice session<br />Week 9 (Oct 30) Molecular feature engineering and nonlinear regression; practice session<br />Week 10 (Nov 6) Guest lecture on real world applications of data science;<br />Week 11 (Nov 13) Introduction to deep learning and neural networks; practice session<br /><br />Part 4. Miscellaneous Topics<br />Week 12 (Nov 20) Introduction to unsupervised learning with practice session; course project presentation I<br />Week 13 (Nov 27) Course project presentation II<br />(Copy and pasted from canvas)<br />The content doesn’t matter if you just want a good grade. Go to the practice sessions and learn how to use the python libraries are sufficient",
      "comment_teaching": "HE TEACHES SO BORINGLY<br />EXTREMELY BORINGLY<br />I FELL ASLEEP MULTIPLE TIMES. IDK IF HE INTENTIONALLY MADE THIS COURSE SO EASY. I BASICALLY LEARNED NOTHING FROM THIS CLASS. HE TRIED TO MAKE THE CLASS INTERACTIVE BUT BECUZ EVERYTHING IS SO EASY AND SIMPLE NO ONE IS ANSWERING HIS QUESTION AND THE CLASS IS BASICALLY AWKWARD.<br />IF HE DONT IMPROVE HIS CONTENT AND HOW HE DELIEVER IT, DONT. WASTE YOUR TIME TO GO TO CLASS",
      "comment_grading": "HW1 (10%) 9/10 mean 6.95 (cuz someone basically didn’t hand in; the median is 8)<br />HW2 (10%) 10/10 mean 8.65 (median 10 lol)<br />Course project (10%) 9/10 (mean didn’t release but from what I know around 7)<br />Literature critique (15%) 15/15 (mean also didn’t release)<br />Final (40%) 39/40 (crazy stats: mean&nbsp;&nbsp;31.24; low 4.5, lower quartile 27.5, median 35, upper quartile 37.5, high 40)<br />Final grade: A+ ranking 3rd in class.<br />Meh.<br />As ChatGPT is allowed, everyone scored high. The coding part in this class doesn’t really matters. Work good in the literature review, and brush up your face for the project as Hanyu is giving marks too, not only the PGTA.<br />This course really taught me that how much you learnt isn’t important, but rather be good friends with those who are more academically superior.<br />Academia.",
      "comment_workload": "Zero.<br />Homework: just use ChatGPT. Ask TAs when ChatGPT don’t work (ChatGPT don’t work well with rdkit (by December 2023))<br />Final: ChatGPT<br />Course project: use previous dataset and plug on practice sessions codes<br />Literature review: ChatGPT<br />ChatGPT could get an A+ if he can take the course.",
      "rating_content": 5,
      "rating_teaching": 3,
      "rating_grading": 4,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}