{
  "course": {
    "id": 4167,
    "subject": "HUMA",
    "code": "1674",
    "name": "China in Historical Maps",
    "description": "Using historical maps of China drawn by both Chinese and Western mapmakers from 1200 to 1800, the course will show students how maps can serve as windows into the past and introduce us to the worldviews of the mapmakers and their society. Through looking at the history, art and science of map making, the course will guide students to reflect on and find answers to these questions: how to look at ancient maps? How to identify and interpret place names, objects, peoples and animals depicted in the maps, and how to distinguish the real from the imaginary? Who made these maps, for whom, and for what purposes? How were the images of China produced by Chinese different from those by European cartographers?",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2330,
      2310
    ],
    "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1401\" href=\"/review/LANG1401\" target=\"_blank\">LANG 1401</a> OR <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1402\" href=\"/review/LANG1402\" target=\"_blank\">LANG 1402</a> OR LANG 1403 OR <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1404\" href=\"/review/LANG1404\" target=\"_blank\">LANG 1404</a> OR LANG 1002 (prior to 2022-23)",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 4,
    "rating_teaching": 5,
    "rating_grading": 4.5,
    "rating_workload": 5,
    "review_count": 2,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 339,
        "name": "CABOARA, Marco",
        "count": 2
      }
    ]
  },
  "reviews": [
    {
      "hash": "jbfiDbC7APjMQKGMUxsLsimlB9qjMdIE",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 339,
          "name": "CABOARA, Marco",
          "rating": 1
        }
      ],
      "author": "typicalType",
      "date": "Jan 25, 2024",
      "title": "Amazing Professor I would say",
      "comment_content": "Mentioned below.",
      "comment_teaching": "Fun, chill, interesting professor. <br /><br />To those who are not interested in maps may find it boring, I believe he is trying his best to deliver in an interesting way already. He is willing to answer all the questions and discuss with you as long as you raise your hand, find him after class or send an e-mail. On canvas there are also tons of materials, feel free to take a look if you don&#039;t understand during class.<br /><br />There is also a field trip to the library to know more about maps through visiting his exhibition. I guess this is the only lecture in ust that go outside of the classroom lol. Pretty new I would say.",
      "comment_grading": "Grading is quite good actually!<br /><br />30% Participation (30/30)<br />35% Midterm Essay (26/35)<br />35% Final Presentation (32/35)<br /><br />You may be flabbergasted by the 30% participation at first but relax!!! Just attend all his lessons and do 5 online discussions on canvas then 30% is secured, very friendly to those who are shy / introverted. Thooooooo participating in his lectures actively by answering his questions will be a bonus for you on impression which may help you when you would like to appeal your grade.<br /><br />Final Grade: A-<br /><br />*Here is an interesting story, my mid-term grade was actually lower than expected at the beginning but after discussing with him and explaining some of my ideas, he agreed to adjust it by a little bit more.<br /><br />Also, my letter grade was B+ originally and after discussing, he also agreed to put me in A range after considering my effort and actively participating in class. That&#039;s why I said impression is important, but no pressure on not doing so as he is really very nice.",
      "comment_workload": "Nearly no pressure to be honest like come on....just 1 essay (1500 - 2000 words) and a presentation about ANY map. No assignments, no quiz, no exam at all!<br /><br />*DISCLAIMER: I don&#039;t know if the topics or components would change in the future as this is the professor&#039;s first time opening and teaching this course. Otherwise I consider this course by far the best in ust.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "mf6Vcjg36qy2rSTnMwkzqmZ6HQzL8pN7",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 339,
          "name": "CABOARA, Marco",
          "rating": 1
        }
      ],
      "author": "Ray-_-",
      "date": "Jan 22, 2024",
      "title": "Interesting Course",
      "comment_content": "The main content is about map reading and feature analysis.<br /><br />Week 1: Introduction<br /><br />Outline the main features of historic maps.<br /><br />Reading assignments:<br /><br />Surekha Davies, “Maps” in Information: A Historical Companion, ed. Ann Blair, Paul Duguid, Anja-Silvia Goeing and Anthony Grafton (Princeton, 2021), 594-600.<br /><br />Website: Symbologies, The Art and Design of Expression in Historic Maps Links to an external site.<br /><br />(https://exhibits.stanford.edu/cartosym/browseLinks to an external site.)<br /><br /> <br /><br />Week 2: Travel, discovery and maps<br /><br />Examine the relationship between travel, exploration and historic maps.<br /><br />Reading assignment:<br /><br />Nebenzahl, Kenneth, Mapping the Silk Road and Beyond: 2,000 Years of Exploring the East. (London: Phaidon, 2004), part 2.<br /><br /> <br /><br />Week 3: Chinese maps of China<br /><br />Introduce the main features of the Chinese mapping tradition until 1600.<br /><br />Reading assignment:<br /><br />Nie, Hongping Annie, and John Selden, The Selden Map of China : a New Understanding of the Ming Dynasty.<br /><br />(Oxford: The Bodleian Library, 2019).<br /><br /> <br /><br />Week 4: Western maps of China<br /><br />Introduce the main types of Western maps of China in the 17th and 18th century and examine the main results of Western and Chinese cartographic collaboration.<br /><br />Reading assignments:<br /><br />Caboara, M., &quot;1. Making and Structure of this Cartobibliography&quot; in Regnum Chinae (Leiden, The Netherlands: Brill, 2022), pp. 15-37.<br /><br />Cams, M., &quot;8. Taking China’s Measure: Eighteenth-Century Empire and the Mapping of Eurasia&quot; in Regnum Chinae.&nbsp;&nbsp;(Leiden, The Netherlands: Brill, 2022), pp. 137–147.<br /><br /> <br /><br />Week 5: Text and image in maps- Iconclass analysis of map elements<br /><br />Introduce the main textual and visual features of historic maps and one online tool to study map images<br /><br />Reading assignment:<br /><br />Reinhartz, Dennis. The Art of the Map: an Illustrated History of Map Elements and Embellishments.<br /><br />(New York: Sterling, 2012), introduction and chapter 1<br /><br />Exercise using Iconclass<br /><br /> <br /><br />Week 6: How text and images are used in historical maps<br /><br />Students will make presentations and have group discussions.<br /><br /> <br /><br />Week 7: Real and imaginary contexts in maps<br /><br />Examine peculiar and fictional elements in historical maps and compare them with maps fictional and imaginary places.<br /><br />Reading assignments:<br /><br />Van Duzer, Chet A. Sea Monsters on Medieval and Renaissance Maps. (London: The British Library, 2013), selected maps.<br /><br />Manguel, Alberto., and Gianni. Guadalupi, The Dictionary of Imaginary Places. Newly updated and expanded (New York: Harcourt Brace, 2000) selected entries.<br /><br /> <br /><br />Week 8: Interactions in exhibition<br /><br />Field Trip to the map exhibition in the Library, students are encouraged to apply what they learned and question the interpretations provided by the captions, Augmented Reality devices and gallery tour.<br /><br /> <br /><br />Week 9: Cartography and perspective<br /><br />Examine the Greek classical roots of linear perspective and map projections as seen in 16th and 17th century maps.<br /><br />Reading assignment:<br /><br />Samuel Y. Edgerton, Jr., Florentine Interest in Ptolemaic Cartography as Background for Renaissance Painting, Architecture, and the Discovery of America (Journal of the Society of Architectural Historians, Vol. 33, No. 4, December 1974) pp. 275-292.<br /><br /> <br /><br />Week 10: Survey maps<br /><br />Examine the beginnings of modern scientific surveying and mapping.<br /><br />Reading assignments:<br /><br />Edney, Matthew H., “Geodetic Surveying in the Enlightenment.” In Cartography in the European Enlightenment, vol. 4 of History and Cartography, ed. Matthew H. Edney, and Mary S. Pedley (Chicago: University of Chicago Press, 2019), pp 439–50.<br /><br />Eric H. Ash, “Navigation techniques and practice in the Renaissance”, in History of Cartography, vol. 3, Cartography in the European, ed. David Woodward (Chicago: University of Chicago Press, 2007) pp. 509-527.<br /><br /> <br /><br />Week 11: Contemporary maps/Google maps/covid maps<br /><br />Examine the main features of contemporary maps as data visualization tools and their relationship with historic maps.<br /><br />Reading assignments:<br /><br />Brotton, Jerry, A History of the World in Twelve Maps (New York: Viking, 2013), ch.12.<br /><br />Alexander J. Kent, Mapping and Counter-Mapping COVID-19: From Crisis to Cartocracy (The Cartographic Journal, 2020) 57:3, 187-195",
      "comment_teaching": "The teacher knows the history of different maps. He is from Italy and has a lot of knowledge of the history of Asia and Europe. He could elaborate extensively in the course and I can understand him easily.",
      "comment_grading": "30% Attendance (30/30)<br />35% Midterm Writing (32/35)<br />35% Final Presentation (32/35)<br /><br />Final Grade: A<br /><br />The grading is quite fair. For A+, you might need 95% or above.",
      "comment_workload": "Easy.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}