{
  "course": {
    "id": 4166,
    "subject": "HUMA",
    "code": "1107",
    "name": "Music and Film",
    "description": "This course explores the relationship between music and film, delving into the historical development of production and the dramatic function of film scores from mainstream to independent cinema. Focusing on the work of a variety of composers and film directors, the course will examine the collaborative process between these artists to achieve these goals. Prior knowledge of music and film, albeit helpful, is not required.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 3.5,
    "rating_teaching": 3.25,
    "rating_grading": 2.25,
    "rating_workload": 4.5,
    "review_count": 4,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1650,
        "name": "DUJUNCO, Mercedes Maria",
        "count": 4
      }
    ]
  },
  "reviews": [
    {
      "hash": "vHayO4dTu0GL57NaLNUdrkQWGHXknLLF",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1650,
          "name": "DUJUNCO, Mercedes Maria",
          "rating": 1
        }
      ],
      "author": "PassKaChu",
      "date": "Jan 26, 2024",
      "title": "Doomed by Absolute Grading",
      "comment_content": "Same as others, copy from canvas:<br />WEEKS 1-3: INTRODUCTION -- BASIC TERMS &amp; CONCEPTS<br />1. The Sound Track &amp; Film Narrative<br />2. The Musicality of the Soundtrack<br />3. Music, Sound, Space and Time<br />WEEKS 4-6: MUSIC &amp; THE SOUNDTRACK FROM THE BEGINNING TO THE EARLY ‘30S<br />4. The Early Years (1895-1929)<br />5 &amp; 6: The Transition to Sound Film (1926-1932)<br />WEEKS 7-11: MUSIC &amp; THE SOUNDTRACK FROM THE CLASSICAL TO THE POST-CLASSICAL ERA<br />7 &amp; 8: Music and the Soundtrack in the Classical Studio Era (1932-1950)<br />9 -11: The Stereo Soundtrack &amp; Film Form in the Post-Classical Era (1950-1975)<br />WEEK 12-13: MUSIC &amp; THE SOUNDTRACK: 1975 TO THE PRESENT<br />12: The New Hollywood, Dolby Stereo &amp; the Emergence of Sound Design<br />13: Music and Film Sound &amp; Form Since 2000<br /><br />For me, the content is fun at the first half but not so interesting in the second half when it start to talk about history.",
      "comment_teaching": "She is a passionate teacher which explain fairly well with the ppt which have a lot of video to illustrate the ideas (or to keep us focus in the class). <br />(This is my impression for the class before midterm, after midterm I almost just go there for attendance and do my own stuff)",
      "comment_grading": "Class attendance &amp; active participation&nbsp;&nbsp;&nbsp;&nbsp;10%<br />2 written assignments&nbsp;&nbsp;&nbsp;10%<br />Midterm exam&nbsp;&nbsp;&nbsp;&nbsp;25%<br />Film Music Critique&nbsp;&nbsp;&nbsp;25%<br />Final exam&nbsp;&nbsp;&nbsp;30%<br /><br />My score:<br />Class attendance &amp; active participation:10/10<br />2 written assignment:&nbsp;&nbsp;29/30 , 100/105<br />Midterm exam: 88/100 (mean:79)<br />Final exam: 72/100 (mean:63.8)<br />Film Music Critique: 78/100 (mean:77.5)<br /><br />Originally, I thought that I can get A range in this course as I got upper quart at midterm and final and a mean at the critiques. So I was shocked when I got a B in the final letter grade. Turns out that this course grade are absolute grading, which means that 90% is required to get an A. So I guess it&#039;s fair as I calculated my score deserves a B. Still kinda disappointing.<br /><br />(And for final exam you need to recite a ton of film names, or else you may lose some marks)",
      "comment_workload": "Very light.<br /><br />Only 2 written assignment:<br />1 being a review about a sence with different music<br />2 being a screening note of a scene in &quot;Broadway Melody&quot;<br /><br />A online discussing in canvas which can be done in 5 mins.<br /><br />The Film Music Critique(600 words max) need to choose between a scene from 2 films that is selected by the professor.<br />I think it&#039;s the only hard thing for this course.<br />And it&#039;s nice chance to watch older film.<br /><br />And for the exams I just study a day before exam.<br />I think it&#039;s still enough for the exam as they are quite easy",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "12bUPlTPunSkYrH0Vlv68o7Schbaj85m",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1650,
          "name": "DUJUNCO, Mercedes Maria",
          "rating": 1
        }
      ],
      "author": "xxyyzz",
      "date": "Jan 04, 2024",
      "title": "f*ck this old bit*h, don&#039;t reg",
      "comment_content": "1. The Sound Track &amp; Film Narrative<br />2. The Musicality of the Soundtrack<br />3. Music, Sound, Space and Time<br />4. The Early Years (1895-1929)<br />5 &amp; 6: The Transition to Sound Film (1926-1932)<br />7 &amp; 8: Music and the Soundtrack in the Classical Studio Era (1932-1950)<br />9 -11: The Stereo Soundtrack &amp; Film Form in the Post-Classical Era (1950-1975)",
      "comment_teaching": "Her ppt is so wordy that you are reading a passage that you don&#039;t understand. Especially for people like me who skipped half of the semester and did my own stuff or daydreamed in the remaining half. It was HELL reading the ppt.<br /><br />The only fun thing is that she will play movie clips during the lesson (the only good thing for this course).<br /><br />Her tone is flat, teaching sounds uninteresting at all.<br /><br />She is always like scolding people. One time I asked her how to do the essay after class, she kept telling me I was &quot;copying the sample&quot;, &quot;don&#039;t understand the assignment&quot; (I really don&#039;t), &quot;low scored work&quot; blah blah blah...<br /><br />Tldr: Dklm she is an old bit*h",
      "comment_grading": "Easily to be above mean if you recite the concepts and movie names before the exam. The TA is lenient in marking. I literally never listened to her in every single lesson but still managed to score above mean in midterm and final. (probably no one knows what she is teaching)<br /><br />I got above mean in EVERY SINGLE ASSESSMENT COMPONENT but ended up with a damn B-. It&#039;s probably the worst grading CC I have ever taken.<br /><br />Some of my friends are in the C range when they score slightly below the mean.",
      "comment_workload": "Attendance every lesson: iprs when the class ends (you can ask your friend to help)<br />2 assignments<br />1 discussion<br />1 scene analysis paper<br />midterm<br />final",
      "rating_content": 1,
      "rating_teaching": 3,
      "rating_grading": 1,
      "rating_workload": 3,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 1,
      "attachments": []
    },
    {
      "hash": "XVpSqYrSXXFFHClhqpN0GE5RZdOYH8zO",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1650,
          "name": "DUJUNCO, Mercedes Maria",
          "rating": 1
        }
      ],
      "author": "qwertyuiop",
      "date": "Jan 03, 2024",
      "title": "Horrible Grading",
      "comment_content": "The content is decent. First highlighted the co-use of visual-audio elements in movies, then moved on with the history of cinema. <br /><br />Personally liked the course a lot as I lowkey enjoy watching movies and it’s just awesome having the chance to watch quality movies in lesson time without having to choose what to watch. <br /><br />There is a little too much of content from my POV, especially when the exams are close-book and it’s just challenging for me to memorize everything (tho I have to admit I started only the day before the exam). My knowledge from the 15 years of classical music did help but not very much, same to the majority of my peers.<br /><br />Maria says she would like to include more content the coming semester, be aware if you aren’t good at memorizing things. It’s still cool if you just wanna watch movies tho. I would still take it again if there is a better grading scheme.",
      "comment_teaching": "Maria is a nice lady with vibrant personality and strong-mindedness. It was fun listening to her, but often she is not satisfied with how the class behave with the fact that she prefers active and attentive students.",
      "comment_grading": "Grading Breakdown:<br />Class attendance &amp; active participation 10%<br />Occasional written assignments 10%<br />Midterm exam 25%<br />Film Music Critique 25%<br />Final exam 30%<br /><br />The grading is disastrous. I scored full for class attendance and written assignment, was only 1 mark from highest for the critique, and was above mean for both exams. What I got was a B. It is just unreasonable for my score.",
      "comment_workload": "Very decent workload. For the take home part, I spent half a day for each of the exams, a total of 4 hours for the written assignment, and 5 hours for the critique.",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 1,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "Ik3xfrh7jTKyyWT3BvTWlLVvpE8H9LuI",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1650,
          "name": "DUJUNCO, Mercedes Maria",
          "rating": 1
        }
      ],
      "author": "sjsjsj",
      "date": "Dec 20, 2023",
      "title": "",
      "comment_content": "content is interesting (if u like to watch movie and want to learn about film music and its history)",
      "comment_teaching": "to be honest, she is not a nice professor, and you can check what other people wrote about her in her other lectures&#039; reviews<br />she is rude to students fr. she expects us to fully concentrate during lectures, but she is using the worst ppt ever. ppt is full of sentences which is directly copied from the text book<br /><br />but TA (amira) is nice and willing to help us all the time<br /><br />I mean the course material is nice and interesting.. but if you get enrolled to this course, attend lectures during the add and drop period, and check whether prof&#039;s &#039;teaching style&#039; suits you or not :)",
      "comment_grading": "didn&#039;t get the letter grade yet<br /><br />Grading Breakdown according to the syllabus:<br />* Class attendance &amp; active participation: 10%<br /><br />* Occasional written assignments: 10%<br /><br />* Midterm exam: 25%<br />Mean: 79.01, Median: 81, High: 99.5, Upper Quartile: 87.75, Low: 50, Lower Quartile: 72<br /><br />* Film Music Critique: 25% (assignment 3 i guess)<br /><br />* Final exam: 30%<br /><br />- 10:30 am class and takes attendance most of time, but its usually iprs or menti so if you have friends then attendance wouldn&#039;t be a problem<br />- tests are easy if you review the course material and memorize key concepts. prof usually emphasizes important concepts before exam so be sure to attend class at least before exams<br />- you are expected to read materials but all the sentences in ppt are from the readings so don&#039;t need to read it",
      "comment_workload": "only 3.5 assignments over whole semester<br />assignment 0.5: write few sentences in CANVAS discussion<br /><br />assignment 1: commutation test <br />- watch short film with original sound, and with suggested music<br />- only took around 30 mins<br /><br />assignment 2: screening notes <br />- analyze part of movie about 3 music components<br />- only took around 30 mins<br /><br />assignment 3: scene analysis paper<br />- watch a whole film and analyze the scene and the music: you only need to analyze part of film, which is around 6 min<br />- professor gave two choices of film<br />- took around 1.5 hours except watching movie(cuz i already watched that movie before)<br /><br />overall, there are only 3.5 assignments, and its not hard",
      "rating_content": 4,
      "rating_teaching": 2,
      "rating_grading": 4,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}