{
  "course": {
    "id": 2591,
    "subject": "ACCT",
    "code": "4710",
    "name": "Accounting Analytics for Professional Accountants",
    "description": "Data analytics is reshaping the work of accountants. Applications of data analytics in accounting including: Auditing/Assurance - data analytics techniques used by accounting professionals and auditors nowadays to detect fraud and conduct forensic accounting. Enhancing Financial Reporting: more sophisticated data analytics tools can allow companies to link diverse financial and non-financial datasets and provide more comprehensive and rigorous financial reports to stakeholders. Managing risks: data analytics techniques such as continuous auditing and continuous monitoring can help accounting professionals assess and manage relevant risk levels within their organization. This course aims to provide students with knowledge of the nature and role of data analytics and enable students to apply and understand data analytics technologies to perform audit, enhance financial reporting, and minimize risks as accounting professionals.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310,
      2230,
      2210,
      2110,
      2010,
      1910,
      1810
    ],
    "prerequisites": "<a class=\"course-link\" data-subject=\"ACCT\" data-code=\"2010\" href=\"/review/ACCT2010\" target=\"_blank\">ACCT 2010</a> AND <a class=\"course-link\" data-subject=\"ISOM\" data-code=\"2010\" href=\"/review/ISOM2010\" target=\"_blank\">ISOM 2010</a>",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 4.44,
    "rating_teaching": 4.33,
    "rating_grading": 4.56,
    "rating_workload": 3.78,
    "review_count": 9,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 3,
        "name": "SHIEH, Tony",
        "count": 5
      },
      {
        "id": 1833,
        "name": "CHO, Tony",
        "count": 4
      }
    ]
  },
  "reviews": [
    {
      "hash": "nBWtvseO6xWJn2wUmAgWY19fWDg8qgIn",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1833,
          "name": "CHO, Tony",
          "rating": 1
        }
      ],
      "author": "Bowling0314",
      "date": "Jan 26, 2024",
      "title": "Easy Content but confusing instructions",
      "comment_content": "1.Getting Started with Analytics and Excel <br />2.Relational Databases and SQL<br />3.Visual Analytics and Tableau <br />4.Statistical Programming, AI, and R<br />5.Statistical Programming II<br />6.Text Analytics, Big Data, and XBRL <br />7.Applications of Data Analytics in Accounting<br />同accounting 完全冇關係，學咗幾種programming Language, 最基本同埋最表面嘅嘢，對於少programming background (me only isom2020+2600)嘅同學完全冇問題",
      "comment_teaching": "prof係一個喺倫敦讀書嘅韓國人，accent 超級標準又清楚，教書速度正常好chill，都係教下書再俾時間我哋做 in class exercises，上堂瞌眼瞓 瞓醒都可以知道佢做緊啲乜，非常願意答我哋問題。但係可能佢都唔係好了解啲Programming，如果問佢超出過教學內容嘅coding 佢可能會即時答唔出，但係後面都會答翻，所以都幾負責任嘅，不過，佢出assignment 好迷（下面補充）…",
      "comment_grading": "Class Participation 10% （上堂答問題）<br />Chapter Assignments 30% <br />Midterm Exam 30% <br />Final Project 30% <br /><br />我覺得正常grade，mean 偏高<br />参考：<br />成個sem答咗六條問題<br />assignments: <br />Asm1: 100/100 (mean: 92.3) <br />Asm2: 92/100 (mean: 89.6)<br />Asm3: 100/100 (mean: 86.5)<br />Asm4: 20/20 (mean: 19.1) <br />Midterm: 36/40 (mean: 31.4/40) <br />Final project score not released <br />Grade: A",
      "comment_workload": "一句概括：本來正常workload，但係俾個Professor 嘅careless 搞到加重 workload!<br /><br />Class pati 係上堂做in class exercises 之後要鬥快舉手答問題，競爭好大，我試過連續舉幾堂都搶唔到問題嚟答，建議上堂之前做完個in class exercise然後鬥快舉手！<br /><br />Assignments 啲內容都唔算好難，幾個鐘都可以做完，但係個Professor會出錯題或者比錯個File格式，令到啲題目唔可以用佢上堂教嘅Coding去做，到最後我哋要同佢講，然後佢就會不斷modify嗰啲問題，搞到我哋啲File改嚟改去…e.g.第一份excel assignment 因為佢比嘅raw data 時間日期嘅格式係黐埋一齊，然後又有二十四小時就又有十二小時制（am/pm），完全用唔到佢上堂教嘅function去排列，份嘢都搞咗我好耐！<br />Btw 每份assignment 都可以自行組隊（3人）去做，如果冇識人一齊讀咁就要自己做，somehow覺得少少unfair ，我就4份asm都係自己一個做嘅，除咗話佢成日出錯之外，其實都還可以接受。<br /><br />Midterm 38條MC + 2分填output題，唔算太難，幾種Programming Language撈埋一齊出，所以某啲題目都好迷，要特別留意邊啲coding係唔同programming Language裏面有同樣嘅用法，佢好鍾意出呢啲題。<br /><br />Final Project 令人十分之迷惑，冇做過咁奇怪嘅project！<br />分成三part：<br />Part 1: Assessment of data quality on a sample data set (20%) <br />Part 2: Original analysis of the sample data set (50%) <br />Part 3: Development of a novel proposal for follow-on engagement (30%) <br /><br />Part 1係佢會比一啲問題，照答就得。<br />Part 2會比一堆方向，要自己作啲問題出嚟，然後自問自答（答問題嘅內容只可以限於佢比嘅raw data 入面）<br />Part 3要自己作data (fake data) 根據自己fake嘅data作出分析，然後比出對呢間公司嘅建議，超級奇怪，要點作data出嚟？？建議可以作一個data set然後run regression 再出到自己想要嘅outcome（如果啲data唔合理，其實會好怪） <br />有15mins presentation (整ppt)<br />三個人一組，random 分組，如果分到啲冇idea嘅人就死得（我果組都算好，groupmate 雖然唔係精通program但係肯一齊諗方向）<br /><br />Overall: 想靚grade但唔介意比prof伏嘅人可reg",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 3,
      "has_midterm": true,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "BDGUpFBmjerCFzo1XZiKvpCusaQ1S2bI",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1833,
          "name": "CHO, Tony",
          "rating": 1
        }
      ],
      "author": "Hayoha",
      "date": "Jan 19, 2024",
      "title": "Tony CHO is a nice guy but the design of this course is just rubbish",
      "comment_content": "R, SQL, Tableau, Excel<br />I think you can learn some useful skills in these tools but they are not very related to accounting (except Excel but I think everyone know how to use it), making this course looks like an ISOM course. But I still appreciate that Tony may have already tried his best to redesign the course to make it more updated to the current business world (maybe?).",
      "comment_teaching": "Professor Cho is good at teaching with clear PowerPoint and sufficient in-class exercise. But you may better do revisions so to catch up every lecture if you do not have related background with R/SQL. As the pace of the lecture is quite in a hurry.<br /><br />After the first 2 weeks, I basically gave up most of the in-class exercises as I would not be able to finish them within the given time.",
      "comment_grading": "The grading is fair and normal.<br />10 % participation is important, although you only need to answer 5 questions to get the full score. The competition is horrible. I would suggest to finish the in-class exercise before the lecture so to be ready for answering questions.",
      "comment_workload": "I think it is very weird and maybe unfair for the assignments can be finished in either individual or in group up to 3. Then the people who do not have friend in the class may end up doing the assignments by their own, leading to unequal workload within students. Tho my friend has different opinion that &#039;DaLao&#039; (students with more than enough skills and knowledge) would prefer working on their own and no need to communicate with others/ face freerider situation. So maybe different people different situation. Maybe students have reached to Tony for grouping too, just I did not know.<br /><br />While I think Tony gave too little time for doing the group project, and it was so sad that he did not allow students to form their own group.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": true,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "46Oif9YFBH0b5470yaJjUojJF2ZCkEAa",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1833,
          "name": "CHO, Tony",
          "rating": 0
        }
      ],
      "author": "randomdude123",
      "date": "Jan 18, 2024",
      "title": "Syllabus changed",
      "comment_content": "1. Excel (Rather easy)<br />2. SQL (Handleable)<br />3. Tableau (Only taught 1 lesson, then you have to learn them by yourself)<br />4. R (Getting harder)<br />5. Text Analysis, XBRL (Getting lost)",
      "comment_teaching": "Every new programming language will start slowly, but then the speed accelerates. He prepared some short exercises for each new command learned, but he do not always explain them well, especially for those topic after midterm which will not be texted (but you still have to master them to apply them in the group project).<br /><br />The biggest problem is he do not explain what should we do in the group project, that we have to ask him for more information. From what I&#039;ve heard from other groups, he sometimes give inconsistent guidelines to us, making the group project being more difficult.<br /><br />Another problem is I could not really relate is course with accounting, prof did not mention much about the relationship between learning programming and accounting. I heard that previously it did relate to auditing, but he definitely miss that part in this new syllabus.",
      "comment_grading": "10% Class Participation<br />30% Chapter Assignments<br />30% Midterm (Excel, SQL, R)<br />30% Final Project w/ presentation (use Excel, SQL or R, Tableau, Text analysis, XBRL etc.)<br /><br />Class participation is earned by answering the short exercises, many people will raise their hand, so you have to be quick.<br /><br />Assignments are usually have mean around 90% ish, so everyone is doing fine.<br /><br />Midterm having mean 31/40/, they are all multiple choice questions, so you can still have a guess.<br /><br />Group project&#039;s mark is not released, honestly I have no idea how he graded us, it feels like all groups do not understand what he wants and simply present and talk about everything we have analyzed.<br /><br />I got a B+ at the end, it feels like you have worked so hard and spend so much time in the group project, but finally the effort do not match the result.",
      "comment_workload": "There are 4 assignments with 1 group project. One assignment who overlap the pace of group project so it is quite packed. There are 3 parts in the group project, trust me you&#039;ll have to spend a lot of time for all 3 parts, with less than 1 month given. <br /><br />You can form your own group in assignments but not in the group project, so good luck :)",
      "rating_content": 3,
      "rating_teaching": 2,
      "rating_grading": 3,
      "rating_workload": 1,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "ftb2c26bD3WzCAa7jxcR5iBbPQ5QlXYz",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1833,
          "name": "CHO, Tony",
          "rating": 1
        }
      ],
      "author": "#_#",
      "date": "Dec 31, 2023",
      "title": "This year the curriculum changed, it has nothing to do with accounting (?",
      "comment_content": "Real prerequisites: programing mindset (ISOM 2020, ISOM 3400 etc.)<br />It has nothing to do with ACCT 2010 and ISOM 2010<br /><br />Topics:<br /><br />1. Introductory concepts<br />2. Getting Started with Analytics and Excel<br />3. Relational Databases and SQL<br />4. Visual Analytics and Tableau<br />5. Statistical Programming, AI, and R<br />6. Statistical Programming II<br />7. Text Analytics, Big Data, and XBRL<br />8. Applications of Data Analytics in Accounting<br /><br />You may wonder, how can so many topics be taught in a semester? Yes, you&#039;re right, basically you learn nothing. The professor is trying to introduce common tools and techniques in business analytics, however, every topic is taught in a very superficial level. This means that what you can do after this course is &quot;blow water&quot;.<br /><br />In my opinion, the most useful part of this cousre is the SQL part, some basic queries is taught to rearrange and call data you need in a SQLite database. If you are majoring in IS, you should&#039;ve learnt this part in ISOM 3260 already.<br /><br />From topic 5 onwards, professor teach us to use R, a statistical packages. I mean, why not python or VBA, why R? I have learnt some R before in OM course so it is ok to follow, but I just don&#039;t understand why the professor want to teach this part with R. The only statistical part is just some regression analysis, if you still remember ISOM 2500, 2600 content, nothing is new or very hard I guess. He didn&#039;t even teach anything statistically intensive, meaningless to use R here.<br /><br />Overall, not a very useful course, but you have no choice if you want the &quot;Accounting Analytics&quot; Option printed on you transcript anyway.",
      "comment_teaching": "Prof. CHO is quite passionate, and this is the first semester he teaches in UST. He is willing to answer students&#039; question patiently and willing to make changes according to feedback.<br /><br />Still, it turns out to be a disaster (more on workload section) <br /><br />You should ponder whether to take this course if it is still taught by him next year, welcome to be the next batch of experimental mice if you decided to take it.",
      "comment_grading": "Normal ACCT course grading, nothing special.<br /><br />Class Participation 10%<br />Chapter Assignments 30%<br />Midterm Exam 30%<br />Final Project 30%<br /><br />Get above mean in Midterm, and I answer questions frequently in class. All full in assignments. I think I am above average in the group project because I have leant R before this course. Class parti and project score not disclosed, end up getting B+. It is just normal grading, curriculum changed, professor changed, it is also no longer a good grade couse.",
      "comment_workload": "The workload is normal if as planed and exacuted properly.<br /><br />Sadly this is not the case.<br /><br />It&#039;s a mess, the guidelines are unclear, by unclear I mean everything is unclear. There are so much ambiguity in the assignments, that the professor have to claerify it in all four assignments. The problem being that, every time he clarify a problem, I would have to make some changes to my file. The workload is designed to be appropiate, end up being a disaster.<br /><br />Not only the assignment, the project is also a mess, and is ever more ridiculous. The project is divided into three parts, data cleaning and verification, data analytics, and recommendation. In the last part, the professor told us to fake data to create analysis. I know it sounds like I am lying and bullshiting but I promise you this is real. The professor said that we can assume that we have some data that is not given, and make some recommendations on it. But we don&#039;t have the real data right? That means I can draw whatever conclusion I like. VERY RIDICULOUS. This part is even partially graded on creativity. WTF? Most RIDICULOUS group project ever.<br /><br />Also note that you cannot form your own group, it is randomly assigned. If you got free riders, RIP.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": true,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "an0MnAt0f6ItFYMz8Wj2quLx0GmHo8bO",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 3,
          "name": "SHIEH, Tony",
          "rating": 1
        }
      ],
      "author": "lliij",
      "date": "Feb 16, 2023",
      "title": "",
      "comment_content": "Introduction to Information Systems, Accounting <br />Information Systems and Data Analytics <br />Data Sources, Data Modelling, and Data Warehouse&nbsp;&nbsp;<br />Relational Database and ER Diagrams <br />Financial Reporting &amp; Analysis: ETL, Slicing &amp; dicing, <br />queries and reports + ACL Basics <br />Data Analytics Reporting + ACL Importing Data&nbsp;&nbsp;<br />Knowledge Discovery, Prediction, Decision Making + ACL <br />Preparing Data <br />Big Data Analytics + ACL Analyzing Data <br />Data Visualization + Visualization Software Demonstration",
      "comment_teaching": "teaching normal, i didn&#039;t pay attention to the cass",
      "comment_grading": "ER diagram:100/100<br />ACL assignments:100/100<br />ACL final project:84/100<br />not realease final marks, overall got B+",
      "comment_workload": "workload is light, but 9am calss is too difficult.<br />only thing for final is write as much as u can on cheat sheet. he will test some concepts.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "bOXuL4WLKkuNeO9Bmy7sLtZpRnlidN5Z",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 3,
          "name": "SHIEH, Tony",
          "rating": 1
        }
      ],
      "author": "KaruizawaKei",
      "date": "Dec 23, 2022",
      "title": "",
      "comment_content": "1.Introduction to Information Systems, Accounting Information Systems and Data Analytics <br />2.Data Sources, Data Modelling, and Data Warehouse<br />3.Relational Database and ER Diagrams <br />4.Financial Reporting &amp; Analysis: ETL, Slicing &amp; dicing, queries and reports + ACL Basics <br />5.Data Analytics Reporting + ACL Importing Data&nbsp;&nbsp;<br />6.Knowledge Discovery, Prediction, Decision Making + ACL Preparing Data <br />7.Big Data Analytics + ACL Analyzing Data <br />8.Data Visualization + Visualization Software Demonstration<br /><br />I would say this course is similar to ISOM 2010 but not some coding lectures like ISOM 3230, 3400...",
      "comment_teaching": "Nice teaching, energetic. Promtply reply to emails.<br />However, his pace is quite fast and it is quite difficult to follow all his steps when it comes to the application of ACL.",
      "comment_grading": "Good Grading.<br />45% assignments<br />5% participation<br />50% Final exam<br /><br />I guess most of us performed almost the same in the assignments part. (almost full)<br />Someone will reply (not answer) to his questions.<br /><br />The final did not disclose. But I should perform quite good.",
      "comment_workload": "The biggest workload is to attend a 9am lecture...<br />Only 3 assignments<br />1:ER Diagram<br />2:Import ACL data<br />3:ACL project<br /><br />Very easy. TBH I fell asleep in every lectures. And I simply refer to the lecture recordings to complete the above assignments.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "HPRjO64uJDFZjdOMbbnRk6LeR2KRDsdm",
      "semester": "2021-22 Fall",
      "instructors": [
        {
          "id": 3,
          "name": "SHIEH, Tony",
          "rating": 1
        }
      ],
      "author": "POPPKIN",
      "date": "Apr 23, 2022",
      "title": "",
      "comment_content": "Understand and apply basic knowledge and applications in information systems and accounting information systems.<br />Apply and demonstrate knowledge of the nature and role of data analytics and how important it is to accountant.<br />Apply and understand big data issues and utilize data mining, data modeling, data analysis and data visualization techniques to solve accounting and business related issues. <br />Synthesize theory and applications to prepare students for the dynamics of professional accounting practice.<br />Demonstrate and provide hands-on experience to develop skills with selected business analysis and data analytics technologies.",
      "comment_teaching": "quite interesting",
      "comment_grading": "Participation5%<br />Cases/Assignments&nbsp;&nbsp;45%&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />Final Exam&nbsp;&nbsp;&nbsp;50%<br /><br />I have got B+ finally with normal participation in class and usually score above mean.",
      "comment_workload": "only several assignment and individual project based on ACL",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "fh5Wjh9A7R7FqJyGA2467H07nr7IMTAn",
      "semester": "2021-22 Fall",
      "instructors": [
        {
          "id": 3,
          "name": "SHIEH, Tony",
          "rating": 1
        }
      ],
      "author": "Purple316",
      "date": "Dec 10, 2021",
      "title": "Good Course Good Professor",
      "comment_content": "Introduction to Information Systems, Accounting Information Systems and Data Analytics<br />Data Sources, Data Modelling, and Data Warehouse<br />Relational Database and ER Diagrams<br />Financial Reporting &amp; Analysis: ETL, Slicing &amp; dicing, queries and reports + ACL Basics<br />Data Analytics Reporting + ACL Importing Data<br />Knowledge Discovery, Prediction, Decision Making + ACL Preparing Data<br />Big Data Analytics + ACL Analyzing Data<br />Data Visualization + Visualization Software Demonstration <br /><br />Learn ACL application through cases, Tony will teach you how to do it in classes, and give a final project that summarize your learning in ACL at last(easy if you don&#039;t skip lesson).<br />Do not acquire much accounting knowledge.",
      "comment_teaching": "Tony is a GOOD teacher!!&nbsp;&nbsp;Teaches well and is quite relaxing to have his lesson (I&#039;m the person that will easily get distracted, but the way he teaches can always &#039;keep me awake&#039;) It&#039;s theory + ACL in a lesson, and you need to follow his steps in the lesson, which he did it quite fast and require more attention in this part.<br />If you answer his questions in the class, he will try to remember you! The questions are easy (he just need a feedback) (P.S. I usually don&#039;t answer teachers&#039; question, but I will reply to his &#039;questions&#039;)",
      "comment_grading": "Coursework:<br />Participation 5%<br />Cases/Assignments 45%<br />Final Exam 50%<br /><br />Not yet release grade, just finished the final exam<br /><br />For tips in final exam, just memorize all the stuff is ok haha (one-sided cheat sheet given, I think he didn&#039;t decide to give us to use cheat sheet originally, but student asked, so..xd)<br />Format: Short questions &lt;3, 2.5 hours",
      "comment_workload": "2 Assignments + 1 Final project on ACL<br />The assignments are easy, teaches in the class already, just give you another similar question.<br />I used 20 mins to finish the first assignments and 5-10 mins to finish another one, really really easy and teaches in the class (not smart student with low gpa)<br />For the final project, it&#039;s just a revision on what he teaches on ACL.&nbsp;&nbsp;(take it as revision on exam too)<br />My friend and I used half day to finish(?, exclude the revision time.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "WQBNsD3dQekSWhPH8y2M6LVPnF9tmLmR",
      "semester": "2018-19 Fall",
      "instructors": [
        {
          "id": 3,
          "name": "SHIEH, Tony",
          "rating": 1
        }
      ],
      "author": "Suan",
      "date": "Aug 02, 2019",
      "title": "Good course",
      "comment_content": "教data analytics 既野.主要用ACL 去學點樣做accounting 既data analytics. 比如用ACL搵missing data, 做classification etc.<br /><br />都會教supervised learning, unsupervised learning 既method, big data related knowledge, data structure. 如果係IS major 就會覺得d野差唔多",
      "comment_teaching": "Detail and impressive.",
      "comment_grading": "Good grading. <br />5% parti<br />45% cases<br />50% Final exam",
      "comment_workload": "No midterm.<br />A individual case, applying all you have learnt during the class. 跟住黎做都真係幾簡單",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    }
  ]
}