{
  "course": {
    "id": 4383,
    "subject": "SBMT",
    "code": "6011R",
    "name": "Economic Development in Asia: A Practitioner’s Perspective",
    "description": "This two-credit course, taught by an economist who previously served nearly 15 years in the Singapore government and is currently a professor of practice in public policy at HKUST as well as an economics consultant, looks at how economic development has occurred in east Asia. It emphasizes the importance of land and agricultural reforms, export-led industrialization, financial repression, technology upgrading, and increasing economic complexity. In so doing, the course challenges conventional models that focus on freeing up markets, financial liberalization, and a neutral, non-interventionist state. The course will also help students deepen their understanding of growth opportunities for businesses in Asia, either from a corporate strategy and operations perspective or from an investor perspective. The course comprises two parts. In the first part of course, students are introduced to key concepts in macroeconomics and development economics, focusing on how successful development in economies such as Japan, South Korea, Taiwan, Singapore, Hong Kong, and more recently mainland China, relied much more on activist, developmental states than standard economic models prescribe. In the second part of the course, we look at the challenges of economic development after the global financial crisis of 2007-2012, and which the pandemic of 2020-2022 has made more salient. We examine a selection of major economic trends after the global financial crisis: the middle-income trap in many Asian developing countries; slower, more fragmented globalization; pressures for decoupling or de-risking; automation and the risk of premature deindustrialization; ESG objectives and how that might affect growth prospects of developing countries; and the headwinds confronting the Chinese.",
    "categories": [],
    "website": null,
    "credits": 2,
    "semesters": [
      2330
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 0,
    "rating_teaching": 0,
    "rating_grading": 0,
    "rating_workload": 0,
    "review_count": 0,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": []
  },
  "reviews": []
}