{
  "course": {
    "id": 1325,
    "subject": "SBMT",
    "code": "2100F",
    "name": "Community Services Project: Developing Leadership Through Service Learning",
    "description": "This course is offered in a form of a community project at a designated non-governmental organization (NGO) under the supervision of the School. Students are required to attend all the training sessions, design and implement the service project or participate in the service learning tasks as instructed by the host NGO and/or the course instructors. By the end of the course, students have to submit a reflective statement in the format of a paper, a group project report or a presentation to demonstrate the attainment of all intended learning outcomes, in addition to other requirements of the relevant NGO as appropriate. Approval from the course coordinator is needed prior to enrolling in the course. Graded PP, P or F. Students may repeat the course for credits if different topics are taken.",
    "categories": [],
    "website": null,
    "credits": 2,
    "semesters": [
      2310,
      2210,
      2110,
      2010,
      1910,
      1810,
      1710,
      1610,
      1510,
      1410
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 4,
    "rating_teaching": 4,
    "rating_grading": 5,
    "rating_workload": 4.33,
    "review_count": 3,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": []
  },
  "reviews": [
    {
      "hash": "22QzOKUiF0LiBNRv2OqaEEiMk4RISZdR",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "Lxnxdhl",
      "date": "Jan 20, 2024",
      "title": "a nice course if your only need is getting 2 credits without any useful knowledge.",
      "comment_content": "tutors from different areas giving lectures based on their past experience <br />but useless",
      "comment_teaching": "u need to try you best not falling asleep when listening to those lectures",
      "comment_grading": "there is no grades for real, everyone comes to this course only for earning credits and get a pass.<br />i guess no one really failed this course lol",
      "comment_workload": "remember the attendance is quite important.<br /><br />it is quite light though it much depends on the role you have assigned to in the groupwork. However, hopefully everyone have got their own part well down and no freerider appear in my group.",
      "rating_content": 3,
      "rating_teaching": 3,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "GSAvwOLsCmskmu3uvFFot6eUvjFRrWly",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "Alora",
      "date": "Jan 03, 2024",
      "title": "Nice lectures &amp; meaningful projects",
      "comment_content": "Lectures + One group project<br />This course exceeded my expectations because it taught me something beyond the classroom and made me reflect on my life. Different mentors give lectures on different topics. Some of them are really inspiring.<br />The project is meaningful and it&#039;s a great opportunity for non-local student to learn about the Hong Kong society. <br /><br />Lectures: <br />1 Course Introduction<br />2 The Way to Success<br />3 Trust &amp; Integrity<br />4 Project Design &amp; Management<br />5 Team Building &amp; Personality Difference<br />6 Global Mindset<br />7 Relationships &amp; Conflict Management<br />8 Servant Leadership<br />9 Career Development/Mock Interviews<br />10 Working Session - Project Discussion<br />11 Failing Forward<br />12 Communication with Impact<br />13 Life Management<br />14 Project Presentation<br /><br />Projects: <br />HC Weekend Boarders/Jubilee Single Elderlies/WV Disability Awareness Game/WV Left Behind Children Campaign",
      "comment_teaching": "Lectures: <br />The quality of a lecture depends on the mentor. The lectures are interactive and most of them are interesting. Each group has a mentor. They are very patient, approachable, and helpful. You can made some new friends in your group. Happy to spend a semester with these people. <br /><br />Projects: <br />Actually our group is not very efficient but the teammates are nice. We managed to finish the project well. Good experience.",
      "comment_grading": "Pass or fail so just finish them on time. <br /><br />Class Participation 20%<br />Book report (min. 800 words) 15% <br />Final Reflection Paper (min 800 words) 25% <br />Group Service Project - proposal 10%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- final report 20%<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- presentation 10%",
      "comment_workload": "Lectures: <br />You just need to listen to the sharing and have some simple discussions in the group.<br /><br />The project: <br />You will need to plan, implement, and report, which will take some extra time, but it is acceptable because I had a great sense of accomplishment when I finished the project.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": [
        {
          "key": "4GBs4TmiahkbQaKyEqWcmy86SP0iM46d",
          "name": "HKUST TWTS Fall 23 Syllabus",
          "format": "pdf"
        },
        {
          "key": "5FaF16w8lVwWP7gIh0hLQRRmiwIk3R09",
          "name": "P.B HKUST HC Weekend Boarder",
          "format": "pdf"
        },
        {
          "key": "lsqvQx5EofJ6y1GKgx3nr5FYQRWVAhfO",
          "name": "P.C HKUST Jubilee Single Elderlies",
          "format": "pdf"
        },
        {
          "key": "Myrm1v5PGAnJDWoXNW7vlizf4NjLktph",
          "name": "P.D HKUST WV Disability Awareness Game",
          "format": "pdf"
        },
        {
          "key": "qUS32S0p1x0ZK30yWWr1WqQUAWHeiP3t",
          "name": "P.E HKUST WV Left Behind Children Campaign",
          "format": "pdf"
        }
      ]
    },
    {
      "hash": "q8mHaz7hbCmZhzb4C6F1kQxV1gtVMVVk",
      "semester": "2022-23 Fall",
      "instructors": [],
      "author": "Lebron",
      "date": "Oct 17, 2022",
      "title": "Great Course",
      "comment_content": "This course is offered by CEO Global Education Foundation (i.e. CEO Global) in<br />collaboration with HKUST. CEO Global was established in Hong Kong in 2005 as an<br />educational non-profit organization and it focuses on effective servant leadership and <br />transformational character development with an emphasis on the foundations of<br />servanthood, leadership, character and integrity.<br />Whether you are career focused or simply seeking your path in life, this course seeks to <br />provide you with the key ingredients that will help you achieve success in life. Mentors will<br />walk with you through the course and beyond plus the experience of a service project to <br />help you apply some of the concepts delivered in class. The focus of the course is threefold:<br /> Servanthood: adding value to others by serving with an attitude ofunselfish<br />concern.<br /> Integrity: having a consistency of character that is demonstrated by analignment<br />of words and actions.<br /> Leadership: developing authentic servant leaders who add value to theirspheres of <br />influence.<br />The course structure includes experiential learning, mentorship, and service projects.<br />A particular focus is the high degree of teacher-mentor-student interactions. The<br />mentorship component brings together students and seasoned business executives from<br />varied backgrounds. It involves group discussion and<br />2<br />open sharing of meaningful insights such as individuals’ values and life experiences<br />including challenges, failures and successful achievements. The deep, authentic<br />relationships among our educators, mentors and students contribute toeffective and lasting <br />change. Mentors will accompany the student in each step throughout the program duration. <br />Mentors are also available to discuss career related issues and provide insights into the job<br />seeking process.",
      "comment_teaching": "It is a rather interactive course where it invites different people to talk on topics.<br />Mentors are helpful",
      "comment_grading": "P or F only<br />Finish all the assignments and you will be fine.",
      "comment_workload": "Normal. Not a lot but requires some effort to be devoted.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}