{
  "course": {
    "id": 4161,
    "subject": "ENGG",
    "code": "6020A",
    "name": "Advanced Engineering Research Competencies",
    "description": "This course equips students with the competencies essential to engineering research study, including but not limited to data analysis and interpretation, academic writing, and research ethics and integrity. It also equips students with the knowledge of the nature of research education and how to cope with common challenges for research students. It prepares junior students for the research journey and strengthens senior students' research skills as well as professional skills such as teamwork and communication.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 5,
    "rating_grading": 4,
    "rating_workload": 4,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1272,
        "name": "ZHOU, Catherine",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "00av31L42Kw0KJNnU5TpqJVFCRlpgfMz",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1272,
          "name": "ZHOU, Catherine",
          "rating": 1
        }
      ],
      "author": "jeremychang",
      "date": "Feb 01, 2024",
      "title": "Adv Engg Research Competencies",
      "comment_content": "Overall, this is a very good academic code and ethics course for new RPG students, covering almost all the academic ethics issues you will encounter in your academic career. The content combined with the explanation of the case is simple, suitable for an introductory course. The most important thing is that after this course, you can exempt all PDC courses, which is cost-effective.<br /><br />总体来说对于刚刚入学的研究生，这是一门非常好的学术规范和伦理课程，几乎涵盖了所有你会在学术生涯中遇到的学术道德问题。内容结合案例的讲解深入浅出，适合作为一门入门课程。最重要的是上完这门课可以豁免所有的PDC 课程，性价比较高。",
      "comment_teaching": "Catherine is a nice lady with great attitude teaching and helping students. No complaint could be raised for this course.<br /><br />凯瑟琳是一位很好的女士，在教学和帮助学生方面态度很好。这门课没有什么可抱怨的。",
      "comment_grading": "You need to be active at the course, for lecturer really caring about the feedback. Although I compeleted all assignments and disscussion board, my grade is still not an A. The final project is somehow depending on a mutaul grading system, which is confusing.<br /><br />你需要在课堂上积极主动，因为老师真的很关心反馈。虽然我完成了所有的作业和讨论内容，但我的成绩仍然不是A。期末的项目分数在某种程度上取决于相互评分系统，这很令人困惑。",
      "comment_workload": "Kind of heavy. Depends on your expertise. Final project do not need lots of effort,maybe couple of hours only. Daily assignments might takes more time than final project.<br /><br />有点重。这取决于你的专业知识。期末项目不需要太多的努力，也许只有几个小时。日常作业可能比期末作业花费更多的时间。",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}