{
  "course": {
    "id": 4237,
    "subject": "TEMG",
    "code": "4000G",
    "name": "Deep Tech Start-up Business Plan",
    "description": "This course explores the process of commercializing innovative IP developed by deep tech start-ups. Students will engage in project-based learning, developing comprehensive business plans that address customer needs, target markets, competition, marketing strategies, and financial projections - to successfully create a start-up business plan for the deep tech start-up venture collaborating with the Office of Knowledge Transfer (OKT). Instructor consent is required.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2330,
      2310
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 5,
    "rating_grading": 5,
    "rating_workload": 5,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1889,
        "name": "CHUN, Daniel",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "1jkedplLTuEU0xOsF6yIGA1Er5nUxp83",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1889,
          "name": "CHUN, Daniel",
          "rating": 1
        }
      ],
      "author": "Saikey",
      "date": "Mar 20, 2024",
      "title": "A course for individuals who really want to improve yourself with talented peers and be outstanding",
      "comment_content": "This course is the first course to ever collaborate with OTK (Office of Knowledge Transfer). Students are required to work as a real consultant trainee under the supervision of the instructor to exercise both business-type entreprenuership and practitioner-type entreprenuership by:<br />1. Get in touch with real deep tech start-ups from OTK to understand the related industries and markets<br />2. Get in touch with real experts from related industries to better understand and analyse the strategic positioning and executable business plan for the deep tech start-ups<br />3. To absorb the theoretical frameworks for standard execution of business planning for a start-up and partically exercise it by delivering a sets of solid outcomes, including<br />a) Executive Summary<br />b) Deep Tech Business Canvas<br />c) Deep Tech Start-up Pitching Deck and Presentation<br />d) Deep Tech Start-up Financial Model<br /><br />Two start-ups from OTK is joining our section and the nine of us was divided into two groups. As one of the first nine students to ever attend the course, I was lucky enough to participate in both groups. Although I evetually ended up being more focused to one of them because Daniel told me it is hard to grade my performance (LMAO), I really enjoyed the course a lot and built a strong connection with everyone during these days. From my personal experience, this is truly one of the best course in UST if you are really trying to improve yourself with other talented peers.",
      "comment_teaching": "Daniel is one of the best mentor I have ever met. No joke. Show him your passion and talents, and he will always find external opportunities to help you further florish your aspiration, polish your skills, expand your connection and enhance your performace. If you are eager to discover a better version of yourself, knowing someone like Daniel is the best way you could only dreamt of.<br /><br />P.S. I am his TA (non-official and not paid because of institutional reason of UST) now.",
      "comment_grading": "Good.<br /><br />Just remember to do all the proposed works, including forum Q&amp;A on Canvas.<br /><br />Also, remember to attend all lectures and tutorials. Not attending will severely affect your grade.",
      "comment_workload": "The workload is dependent to two things:<br />1. Whether you have capability in the required field —— I think it is generally classified into two, including profession-oriented capability and business-oriented capability.<br />The required profession-oriented capability is dependent to the deep tech start-ups that you work with, for example, it will be better if you are equipped with AI knowledge or even work experience when the deep tech start-ups that you work with is an AI-related start-up. On the other hand, business-oriented capability is more constant, which means you will definitely suffer if you are not good with strategic positioning and finance.<br />2. Whether you have someone who can compensate your lack of capability —— I think this is a simple statement so remember to work as a group.<br /><br />Luckily, the workload in my case is manageable.<br />1. I am lucky enough as an AI engineerer because both start-ups that we work with are AI-related start-up. Also, I have tech business background so I am also fimiliar with deep tech strategic positioning. The matching capability made my life easier.<br />2. I am not fimiliar with financial stuffs, so I grabbed one of my best buddies who is a finance guy and get him enrolled into the course with me. Big brain move and shout out to my boy. The nine of us are all talented in different field while coming from different academic and cultural backgrounds. By combining all of our offering we are lucky enough to create a great synergy.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    }
  ]
}