{
  "course": {
    "id": 1633,
    "subject": "COMP",
    "code": "5331",
    "name": "Knowledge Discovery in Databases",
    "description": "An introduction to knowledge discovery in databases.  Different discovery and learning techniques are presented and compared.  Automatic generation of query language expressions is discussed in depth.  Potential applications are shown.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310,
      2210,
      2110,
      2010,
      1910,
      1810,
      1710,
      1610
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "CSIT 5210, MSBD 5002",
    "rating_content": 4.7,
    "rating_teaching": 4.8,
    "rating_grading": 4.37,
    "rating_workload": 4.03,
    "review_count": 30,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 134,
        "name": "WONG, Raymond Chi Wing",
        "count": 24
      }
    ]
  },
  "reviews": [
    {
      "hash": "REejHS0sL7sIAnTwH8tJXvNRduSsSaXu",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "chpoonag",
      "date": "Mar 18, 2024",
      "title": "",
      "comment_content": "",
      "comment_teaching": "",
      "comment_grading": "Seems that most of the classmates got 9X/100 in all assignments.<br /><br />Despite having prepared a marking scheme, exam grading is actually a bit vague / flexible in some cases. Make sure you go to paper checking session. (The paper checking session was just a few days after exam.)<br /><br />Also, the exam contains proof-required question(s), which is/are very similar to the assignments. <br /><br />My assignments scored around mean. <br />The group project, which was chosen to be research type, was not the top among the others.<br />Final exam is below mean for slightly more than 1 SD.<br />Got a B in this course.",
      "comment_workload": "It&#039;s acceptable.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "73iTaUrfgqmJK1lHQGSa1nahFn3Y8O4Y",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "i9schen",
      "date": "Feb 08, 2024",
      "title": "",
      "comment_content": "Basic knowledge about data mining, including association, classification, clustering, neural network, etc. Content is tight, but interesting and useful.",
      "comment_teaching": "Raymond&#039;s teaching is always interesting, with &quot;coupon&quot; given to award the students who answer quetions in class to waive a question in homework. Recordings will be available on canvas.",
      "comment_grading": "Not bad, but students are really Juan... Above average score often guarantees a B+ score.<br />A cheating sheet (a piece of two-slide A4) is allowed to bring to the exam.",
      "comment_workload": "Moderate, 3 homework assignments and 1 group project. Each homework often takes me a few days to finish, with a month given to finish.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "ufqQIlCiwVtEAHQ6aw4kwIg9aXNAnkWE",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "CyrusL",
      "date": "Jan 06, 2024",
      "title": "Not really a DB course, but interesting nevertheless",
      "comment_content": "[Topics]<br />1. Association<br />&nbsp;&nbsp;- Apriori algorithm<br />&nbsp;&nbsp;- FP-tree<br />2. Clustering<br />&nbsp;&nbsp;- Classical techniques: k-means and hierarchical clustering<br />&nbsp;&nbsp;- Other techniques: EM algorithm, BIRCH and DBSCAN (basic knowledge)<br />&nbsp;&nbsp;- Subspace clustering: density-based, entropy-based, KL transform<br />3. Classification<br />&nbsp;&nbsp;- Decision tree<br />&nbsp;&nbsp;- Naïve Bayes and Bayesian Belief Network<br />&nbsp;&nbsp;- Support Vector Machine (basic knowledge)<br />&nbsp;&nbsp;- Neural networks (basic knowledge)<br />&nbsp;&nbsp;- Recurrent neural networks: LSTM, GRU (basic knowledge)<br />4. Data Warehouse<br />&nbsp;&nbsp;- Selective Materialization Problem<br />5. Data Mining over Data Streams<br />&nbsp;&nbsp;- Frequent pattern mining: sticky sampling, lossy counting, and space-saving algorithm<br />&nbsp;&nbsp;- Classification: Hoeffding tree algorithm<br />6. Web Databases<br />&nbsp;&nbsp;- HITS and PageRank (basic knowledge)<br />Extra 1. Multi-criteria decision making<br />&nbsp;&nbsp;- Skyline query (basic knowledge)<br />Extra 2. Graph Neural Network<br />&nbsp;&nbsp;- MPNN, GCN, GAN, GraphSAGE, RecGNN (basic knowledge)<br /><br />There is relatively little overlap in content with other data science courses. I have taken COMP 4211/4321/4332 and still find this course interesting. Despite the name of this course, most of the contents are not specific to databases: even if you have not seen SQL before, you can understand this course just fine. Honestly, the title/description of this course should be updated to be less misleading.<br /><br />The difficulty is a bit lower than what you would expect for a PG course. Although there are some theoretical parts, you are mostly expected to learn how to apply the algorithms and perform some calculations. I would say that COMP 4221 (as taught by DY) is more intensive than this. Note: I am now a PG student.",
      "comment_teaching": "Raymond does a good job of explaining the concepts. There are also in-class exercises (not graded) to check your understanding during class.<br /><br />No attendance is required for this course, and the lecture videos are regularly uploaded to Canvas. That being said, there is an incentive to come to class: each person who answers his questions in class will be awarded a coupon. Each coupon can be used to automatically get full marks for one question in an assignment (maximum of one coupon per assignment).<br /><br />Props to the TAs for grading all of our final exam papers over the weekend so that we could check our papers earlier!",
      "comment_grading": "[Grading Scheme]<br />Assignments 30%<br />Group Project 30%<br />Final Exam 40%<br /><br />There are three assignments over the semester. Each assignment contains some questions that require writing proofs and are rather difficult. Make sure you reserve enough time to complete them.<br /><br />The group project (1-6 members per group) can be related to any topic that is covered in class, with some additional areas like NLP to choose from. You can select an existing paper on a topic and, based on that, choose to conduct a survey (80%), an implementation (90%) or research (100%), but the maximum score is capped (in brackets) based on the difficulty of the project. Regardless of this, the project consists of a proposal, final report and presentation.<br /><br />Raymond let us decide on the format of the final exam by polling in class, so it may not be the same in subsequent years. In this year&#039;s exam, some of the questions were virtually the same as the in-class exercises. However, we were given hardly enough time to complete all of the questions.<br /><br />On another note, no detailed marking scheme was provided to us in the solutions of the assignments and final exam, so the number of marks deducted for a given mistake might be arbitrary.<br /><br />[My Grades]<br />Homework: 273/300 (most probably below mean, since most people got 100 marks for any given assignment)<br />Project: Unknown (my group conducted an implementation-based project)<br />Final Exam: 158/200 (Mean: 133.4, SD: 29.7)<br />Grade: A-<br /><br />Without additional statistics, it&#039;s hard to say whether the grading is fair, but A- is just about what I expected.",
      "comment_workload": "The workload is average for a PG course.<br /><br />Each assignment will take you around 1-3 full days to complete (depending on how good you are at writing proofs). The assignments are released early (before their contents are covered in class) so time management should not be a problem.<br /><br />On the other hand, the group project makes up most of the workload of this course. You form your groups shortly after the add/drop period and have to submit your proposal by the end of the month. Afterwards, you should start working on the main content of the project, as you have to hand in a final report (similar to a real paper) shortly after the final class of the semester. The presentations are scheduled after the final class and are conducted topic-by-topic. Note that your presentation may be scheduled for Sundays if your topic is too popular (such as NLP) and those who also selected that topic are not free on other days.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "JkiHiLMJ9tEoVSriWSFboeybsSk68KUd",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Kid",
      "date": "Dec 20, 2023",
      "title": "COMP 5331",
      "comment_content": "Really classical algorithms.<br />Since 2020 Fall, Graph Topic has been included and some classic GNN, GCN, GAN models are required to master their structure and calculations.",
      "comment_teaching": "Quite clear with multiple in-class exercise. Each important algorithm has corresponding examples to help students understand the process.",
      "comment_grading": "10% * 3 = 30% Assignment;<br />30% Project; (survey / implementation / research)<br />40% Final.<br />Though the final questions are not that difficult, one need to give the exact answer then can get full marks of the problem and there is no process points for most questions in final.",
      "comment_workload": "Mostly depends on the project. <br />The final is not that simple and straighforward.<br />If u has go through all slides and in-class exercises, getting an average score in final is not an tough task.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "EesY909prVLznfFzGpxz1GWS5ktDOKup",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Point",
      "date": "Dec 18, 2023",
      "title": "",
      "comment_content": "A very good COMP course in UST. Content is not hard but covers lots of different topics. You will get a high level view about this field and also learn the basic knowledge about it.",
      "comment_teaching": "No problem, Raymond is one of the best professor I&#039;ve ever met. He can teach everything in a clear and easy understand way.",
      "comment_grading": "Exam is much easier than assignments. Difficulty of exam is closer to the In-class exercise. Basic proof and basic computation is important, review them well before exam, grade will not be too low.",
      "comment_workload": "Only 3 Assignments, but each assignment is extremly hard, you might spend a lot of time to finish them. Also you need to complete a course project, if you are not familiar with ANY topic in this course, maybe you will need more help from your group member :)",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "9CYtvJPHELdwLw3Ggz2pIi85JIAnPker",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "zyliu",
      "date": "Dec 14, 2023",
      "title": "",
      "comment_content": "This course covers a lot of material including frequent itemset mining, classification, clustering,&nbsp;&nbsp;RNN, NN, graph, GNN, bayesian network, Data stream, decision trees, PageRanking, etc. All of these content will be tested in final exam. BTW, there is no attendance requirement in this course.",
      "comment_teaching": "Teaching style is good but the instructor may be a little wordy.",
      "comment_grading": "The grading is not so friendly to students. I heard some students failed in final exam and retake this course.",
      "comment_workload": "There are three of homeworks totally. The homeworks are very challenging and time consuming. Some question are desginged to be difficult on purpuse. This course also need to finish a project, which is kind of annoying.",
      "rating_content": 3,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "SlCMqXhMempxMjlRX38NvKkDHEjteLyJ",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "hanzhe",
      "date": "Dec 03, 2023",
      "title": "",
      "comment_content": "The content is very useful, it will talk about classification, machine learning and so on",
      "comment_teaching": "The teacher is perfect, very patient and will answer every question!<br />And the teacher will cover a lot of questions and explain each inclass exercise",
      "comment_grading": "The score is composed of three parts, homework, project and exam. The score is OK, and the score of homework is very high",
      "comment_workload": "The workload of this course is very heavy, the homework is difficult and the project takes a lot of time, and the exams also need to be reviewed",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "BXaHpUSugSCIFV1NTMfbHsUwBlRrZZY9",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "waterlens",
      "date": "Nov 12, 2023",
      "title": "",
      "comment_content": "The course is mainly on AI and DB. The topics include Association, Clustering, Classification, Data Warehouse, Data Mining over Data Streams and Web Databases. I think it almost covers all typical content in these fields.",
      "comment_teaching": "The professor seems professional in the class. By the way, Raymond sent many emails to those who enrolled in the courses. Maybe It&#039;s upsetting for those who want to keep their mailboxes clean.",
      "comment_grading": "The grading scheme is very simple. It contains an exam, 3 homework, and a group project. It&#039;s nice to not have attendance as a part of grading. The grading of homework is nice. The project has multiple kinds like implementation, research, and survey. There are many topics from the related top conferences. You can also select your own topic.",
      "comment_workload": "The workload is quite heavy. Every homework requires a quite long time to finish. There&#039;s 3 homework. And the project, depending on the first proposal and your group members, may really hurt you if you are unlucky. Since I&#039;m not a PG in this field (even not AI or DB-related), it&#039;s quite hard for me to follow the course and practice my coding ability to replicate the algorithms learned. From my experience, it&#039;s absolutely painful to implement the code as my group randomly selected one paper from the given list of topics. As you may know, many AI papers don&#039;t provide code for replication. So, please consider them carefully if you need to select a topic for your project.",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "WuqwkfCYbvIztuFq0JqyGWOECyk1PIrZ",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Sean199912",
      "date": "Nov 06, 2023",
      "title": "Short review summary",
      "comment_content": "The course teaches many useful knowledge about knowlegde discovery, etc. For example, the clustering algoirthms, and other database-related knowledge are included in it. It basically covers common algorithms for database and knowledge discovery.",
      "comment_teaching": "Raymond is very good at teaching&nbsp;&nbsp;and have passion for it. He has a lot of interation with students during class and students can even get &quot;coupon&quot; to exempt questions in our homeworks. He has a way to teach and involve students actively.",
      "comment_grading": "The grading is fair. It consists ofassignment, final exam, and project. (It has in-class exercise but not counted in the final scores).",
      "comment_workload": "The workload is a bit larger than others I think. It has three homework to hand in during the whole class and every homework taks about 3 or 4 hours for me to compelete (but if you learn well you can complete earlier I think).",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": true,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "on9DyHf6ZsjASR8om4HFNhi12ETHfEOf",
      "semester": "2022-23 Fall",
      "instructors": [],
      "author": "Johnlitesting",
      "date": "Oct 18, 2023",
      "title": "",
      "comment_content": "It is a fun course. For those who have slight background in KDD or don&#039;t know what KDD researchers are doing, this course may provide useful references.",
      "comment_teaching": "The instructor is great and responsible. The instructor may ask questions in the lectures, so better pay attention in the class.",
      "comment_grading": "Good grading can be competitive. To get a B+, better get an examination score above mean.",
      "comment_workload": "Workload is reasonable. However the assignments may take some time to finish. The assignments are good practice for examination though, because the difficulty of the assignments is likely the upper bound of the difficulty of the examination.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "5ftdlMrfdg2XXglzttVjhBuuY5Ykbjlu",
      "semester": "2022-23 Spring",
      "instructors": [],
      "author": "1024GG",
      "date": "Jun 04, 2023",
      "title": "",
      "comment_content": "Teaching FP-tree, machine learning algorithm and other data mining technology etc.<br />No attendance requirement however will need a pre during the course.<br /><br />You can use this course as either AI or DB major, so it is not too bad for most of students.",
      "comment_teaching": "The teacher is experienced and has many years experience on teaching this class, so it is no doubt that the teacher is good. However, as the teaching style didn&#039;t change through the last 5-10 years, compare to other course , the knowledge learnt from this course is not that up to date. However, from my point of view, the teaching style is not so good as it pay too much attention on in-class exercises&nbsp;&nbsp;.",
      "comment_grading": "As a PG student , you need B+ above to fulfill the CSE requirements, By contrast , the Grading is bad , too strict and hard to get B+, the final exam is too important ,you must no less than the mean grade.",
      "comment_workload": "The workload is not light but I won&#039;t say heavy , it includes 3 homework and 1 group project , you need to pick a good group mate otherwise you will need to do a lot work by yourself.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": true,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "lYWG0nmD7MtRM98knpGET9xXa4ag1i4Z",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "TryTryTry",
      "date": "Jan 29, 2023",
      "title": "",
      "comment_content": "This class including many related topics (e.g., association, clustering, neural networks and graph) in KDD, but all topics are not studied in depth. The homework and the project are interesting.",
      "comment_teaching": "The overall teaching is great. Raymond has a unique accent, which makes me not sleepy even the class is at 8 o&#039;clock. In addition, every important part in the exam is covered.",
      "comment_grading": "Every has a similar score for 3 assignments. I don&#039;t know the grade of the project. Most of the grade comes from the final exam. For me, the grade is satisfactory.",
      "comment_workload": "The workload is appropriate. 3 assignments + project + final exam.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "s4mQZTtDR0n6KVmkpej6ooLI7BNsCAfC",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "JLeo",
      "date": "Jan 03, 2023",
      "title": "",
      "comment_content": "The content contains mainly the following 6 topics about data mining:<br />1. Association<br />2. Clustering<br />3. Classification<br />4. Data Warehouse<br />5. Data Mining over Data Streams<br />6. Web Databases<br />You can learn diverse algorithms under each topic.",
      "comment_teaching": "Raymond&#039;s teaching is very detailed and clear. For the difficult algorithms, he always prepares some exercises to lead you step by step.",
      "comment_grading": "Homework 30%<br />Project 30%<br />Final exam 40%<br /><br />I think grading is not bad. Since most people can get almost full grades for 3 homework. The final grade is mainly based on the final exam. So you should be careful about the final exam and be prepared.",
      "comment_workload": "Homework: It is a little challenging. Some questions come from some papers. But if you can take some time to deal with it, you can get a good grade.<br />Project: I think it is very similar to the other CS courses&#039; project requirements. But Raymond provides 3 options - Research (100%), Implementation (90%) and Survey (80%). The workload depends on your choice.<br />Final exam: If you want to get a good score in the final, you should be familiar with all the contents in this course. The questions in the final are not very difficult, but you should be careful and skilled with each algorithm.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "01LMJHM1XjtygI8GMDyoTIY0QJpKZ4W3",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "gyhdog",
      "date": "Dec 07, 2022",
      "title": "",
      "comment_content": "Associations mining, (subspace) clustering, classification, neural network, datastream, skyline, data-warehouse, web-dataset.<br /><br />One should not expect to learn machine learning in this course as it mainly focuses on mining algorithms.",
      "comment_teaching": "Raymond is patient and gives detailed description of the algorithm with examples.<br />It is worthwhile to attend the class.",
      "comment_grading": "30% HW<br />30% Project<br />40% Final<br />The format of the final exam can be chosen among &quot;straightforward but more questions&quot;, &quot;median difficulty but less questions&quot;, &quot;hard questions with bonus ones (even less questions)&quot;.",
      "comment_workload": "HW is hard, some questions require sophisticated reasoning to get the answer.<br /><br />You can choose survey/implementation/research as your projects (with increasing base grading)",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "dqLDt4qRTWoAJrtn2z2i0jlm7bOhk2tp",
      "semester": "2022-23 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "fsoul",
      "date": "Sep 14, 2022",
      "title": "",
      "comment_content": "The course is about data mining techniques, including Association， Clustering，Classification，Data Warehouse，Data Mining over Data Streams，Web Databases. The project is about the major frontier field of data mining.",
      "comment_teaching": "The class is a little boring and slow. If you answer a question in class, the Prof. would give you a Coupon to waive a question in each assignment. There are no recording in the class.",
      "comment_grading": "The grading is based on the 30% of assignment, 30% of project and 40% of final exam.",
      "comment_workload": "Median workload. The Prof. would require you to start the project early. The paper of the project is frontier and if you want to get 100 score, you need to do a research project. You would learn a lot from the project but also take much time.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "mIUx6l2MUBSzQm10tOeDbajxjPDgVEwn",
      "semester": "2020-21 Spring",
      "instructors": [],
      "author": "Wentx",
      "date": "Aug 03, 2022",
      "title": "",
      "comment_content": "The course is about data mining techniques, including traditional and modern learning-based methods.",
      "comment_teaching": "Prof. Wong is good at teaching. He is patient and passionate. The student&#039;s participation is great accordingly.",
      "comment_grading": "The grading is good. The final grade is based on in-class participation, assignment, project and final exam.",
      "comment_workload": "Median workload. There are about five assignments, one project assignment, and a final exam. You can select the intense level of the project, either an implementation one (implement a research paper), an extension one (extend a research paper), or a research-oriented one.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "54KPYTv6wKlAsxp19DK9gms3Se7mg3rE",
      "semester": "2021-22 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Ennka",
      "date": "Jan 24, 2022",
      "title": "",
      "comment_content": "Association &amp; FP-tree<br />Clustering (including outliers and subspace clustering)<br />Classification (Bayes network, decision tree, SVM, NN, RNN &amp; lstm &amp; GRU)<br />Data warehouse<br />Data mining over data stream<br />Web dataspace.",
      "comment_teaching": "The course is not hard. It is easy to understand the content of the course.<br /><br />But Raymond spend to much time on something very simple. which is a waste of time.",
      "comment_grading": "A very normal grading. I&#039;m not very sure about the proportion of people over grade B+.",
      "comment_workload": "1 project &amp; 3 homework &amp; 1 final exam.<br />Workload is not huge, and it mostly depends on the way you treat your project.",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "81iVE8KLwPEEGVPoythZMkCr6EWFL2jE",
      "semester": "2021-22 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "xyw",
      "date": "Dec 18, 2021",
      "title": "",
      "comment_content": "covered a lot of data mining topics : association, clustering, classification, data warehouse, data stream, web db... The contents are broad in my opinion.",
      "comment_teaching": "Raymond&#039;s teaching method is very straightforward. He shows students every step in solving different problems.",
      "comment_grading": "Haven&#039;t received my grades. PG class grades should be good.",
      "comment_workload": "Project workload is kind of heavy, but you can choose to do 1)survey, 2)implementation, 3)research project. <br />There are 3 homework, questions in the homework are talked about in class in which Raymond showed us the steps in using the methods . Everyone can get good grade in HW.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "eUM94ebD3tZIww8bkig4gFnK6r94TEZD",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "lwww",
      "date": "Aug 07, 2021",
      "title": "",
      "comment_content": "The content covers most classic algorithms in the area of data mining. Some recent algorithms are also included. Students are also required to explore SOTA methods in the project.",
      "comment_teaching": "Raymond is very nice and patient. He will give the detailed explanation of the algorithms to let you master the brilliant ideas.<br />The slides are also very helpful. There are step-by-step examples. Overall, the teaching presents clearly.",
      "comment_grading": "The grading is very fair. I think most students can get high grades.",
      "comment_workload": "The assignments and project are both find. The project helps me make some new friends.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 2,
      "vote_count": 4,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "JsqOC7Fp2p3iaxam1aNJBSWXIAYlDsKO",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Pccc",
      "date": "Jan 13, 2021",
      "title": "",
      "comment_content": "The some contents are outdated, but generally interesting and worth to learn. The slides provided by Raymond is well-prepared. You can quickly comprehend the content even you don&#039;t attend the class.",
      "comment_teaching": "I like Raymond&#039;s style. He is very patient and nice, though he sometimes take too much time explaining simple concept.",
      "comment_grading": "All guys I know who enrolled in the course got B+. The grading is fair.",
      "comment_workload": "The workload is high. You need to complete extensive homework, project and a very heavy-weight final exam. Although most questions in the homework are straight-forward, you still need to take considerable time on them.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": true,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "WXYkm0VoRKnVNs1DsZ7jTEAvkhlLWVYl",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Yazid",
      "date": "Dec 23, 2020",
      "title": "",
      "comment_content": "The content is related to AI and database, which is helpful for conducting research. The course covers many algorithms in data mining, including association rules, clustering, classification, and so on.",
      "comment_teaching": "The professor is very kind, he will reply to your email within 1 - 2 hours. The teaching is conducted via detailed examples. The professor will show each detailed step for each example during the lecture. Students are highly encouraged to answer questions during the lecture.",
      "comment_grading": "The grading for homework and project is good. But the final exam (online) is very difficult, so the grading is not that good. <br />30% assignment + 30% project + 40% exam.",
      "comment_workload": "The workload is high. You may need to use one whole day to finish one question in the assignment. The final exam has a lot of questions (you definitely have no time to finish it). The professor says even he cannot finish the final exam within the given time.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "qFQxQyuj19AqxsoqgSoH3zmLiBTNhYDC",
      "semester": "2020-21 Fall",
      "instructors": [],
      "author": "Richard-Xu",
      "date": "Oct 26, 2020",
      "title": "",
      "comment_content": "The course covers many algorithms in data mining, including association rules, clustering, classification and so on. It is helpful if you are interested in DM.",
      "comment_teaching": "The teacher is very responsible. The teaching is conducted via detailed examples. The teacher encourages interaction during the course. However, it seems that the teacher likes to send out many emails.",
      "comment_grading": "The grading is good. The average score of assignment is about 95.<br />30% assignment + 30% project + 40% exam.",
      "comment_workload": "The assignment is very time-consuming. You need to search a lot to finish the assignment. For the project part, the workload depends on what topic you choose.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "p3D2YewoyNrHuXD7ypzWUfQMD5o1q9DH",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "OwenHuang",
      "date": "Oct 21, 2020",
      "title": "Great course",
      "comment_content": "Course outline: <br />Association<br />Clustering<br />Classification<br />Data Warehouse<br />Data Mining over Data Streams<br />Web Databases<br /><br />The course is about basic data mining techniques, the most important and useful part is clustering and classification.",
      "comment_teaching": "Prof is nice. He explains each concept clearly. The teaching style encourages more interaction in class. You can get a coupon if you answer questions in class. The coupon can be used to waive questions in HW. <br />However, it is a little bit annoying because he sent too many emails/ notification via canvas and sometimes.",
      "comment_grading": "Grading scheme:<br />Grading Scheme:<br />Assignment 30%<br />Project 30%<br />Final Exam 40%<br />The grading for the assignment is super great. Most students in this class got 95+ out of 100 in the assignment. I am not clear about the grading of the final project now. Because we can get the coupon to waive some of the questions in the assignment, we can get a really great grade.",
      "comment_workload": "The homework is a little bit consuming. You need about 10 hours for each assignment and will need to read some papers and discuss them with classmates. <br />There are three types of the final project: <br />1.Survey\u000b<br />2.Implementation-oriented Project\u000b<br />3.Research-oriented Project<br />The research-oriented takes a lot of time.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "gbvbSL8hAxqrD1aW9YnovwFwsHpwsLJH",
      "semester": "2019-20 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "ahaghighi",
      "date": "Jun 28, 2020",
      "title": "",
      "comment_content": "The topics are really interesting! way better than any other online courses about data mining. The topics are interesting. the slides are clear and complete. but still you need to go and study online some other materials as they will be mentioned in the homeworks.",
      "comment_teaching": "The professor spends a lot of time for students and answers their questions. Also his class and teaching style is amazing. He solves a lot of examples in the class that makes everyone to understand the topic. Also he gives some bonus tickets which can be used for the homeworks. In order to get them you need to participate in the class and participate in answering or solving some problems in the class. it can be really useful!",
      "comment_grading": "the grading of the homework are fine. and you get a really good grade. For project as the grading policy is not exactly clear then it can be a bit problematic",
      "comment_workload": "regarding to the workload the homeworks takes a lot of time. (around 2 3 days).&nbsp;&nbsp;<br />The project also is a bit time consuming especially if you do want to do a research it can be a it vague.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 3,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "BsD8EQbrw013Kd6k43ouTszWNqHRmSXf",
      "semester": "2019-20 Fall",
      "instructors": [],
      "author": "Noah Kim",
      "date": "Mar 03, 2020",
      "title": "",
      "comment_content": "The content includes renowned machine learning algorithms as well as algorithms for handling data stream",
      "comment_teaching": "The lecturer elaborate concepts taught in detail.<br />Very easy to follow. Please try to get coupons in the class, which will significantly reduce your workload for the assignment.",
      "comment_grading": "Grading is fair enough. However please be careful when doing 3 assignments. since everyone gets high grades a range between 90 - 100. Therefore, one point difference could highly affect your final grade",
      "comment_workload": "There are 3 types of course project: survey, implementation, research; you can choose either one <br /><br />For the research project, the workload is a bit heavy.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "08ItBrKhOYTWMMZrKxlcEPRuySrwHbuL",
      "semester": "2019-20 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "shizhe",
      "date": "Feb 23, 2020",
      "title": "",
      "comment_content": "Really easy to understand because Raymond makes everything clear.",
      "comment_teaching": "Teaching is great and easy to understand.<br />Really interactive.<br />Each knowledge point is clear enough.",
      "comment_grading": "Fair enough, no need to appeal.<br />I am really satisfied with the grading.<br />There are 3 assignments and for each, I got 97, 100, 100.<br />The TAs are really nice.<br />The final project&#039;s grade is also great.",
      "comment_workload": "Medium workload.<br />3 assignments.<br />no midterm and a final exam.<br />The final exam is medium but there are a lot of questions with 200 marks.<br />You need to write down your answers very quickly.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "Kb4LFRtRllx0CZJPl0RyOvy6bqcVevrx",
      "semester": "2019-20 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "yc-zheng",
      "date": "Feb 20, 2020",
      "title": "",
      "comment_content": "This course covers basic topics in data mining, including Association, Clustering, Classification, Data Warehouse, Data Streams, Web Databases. The instructor provides detailed slides, so you do not need a reference book. Course materials are maintained here: http://www.cse.ust.hk/~raywong/comp5331/",
      "comment_teaching": "Raymond was really passionate in teaching. He paid attention to interactions with students and provided in-class exercises on sheets in each topic. Assignments and proposals were graded carefully.",
      "comment_grading": "The breakdown:<br />Assignment 30%<br />Project 30%<br />Final Exam 40%<br /><br />The grades were OK, not difficult to get a B+, as long as you were dedicated to the assignments and exams.",
      "comment_workload": "We had 3 assignments, each with 5 questions. The questions will take time to solve, not very easy. Homeworks were submitted in paper works, normally. The project required up to 4 students to do a survey on a topic, or reimplement ideas in a recently published paper, or do a small research project. A proposal, report and a presentation were needed.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "XyIfHZZgnixC8TBPVrvhCd8Ku266bBCS",
      "semester": "2018-19 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "當科",
      "date": "Jan 17, 2019",
      "title": "Excellent course",
      "comment_content": "Study tips for finals:<br /><br />- make sure you memorize the proof for ε-deficient synopsis (this is the only REAL hard thing in this course, so Raymond likes to put it in the final exam)<br /><br />- go through the algorithms a few times with pen and paper (especially the FT-tree algorithm). They are not hard, but is super tedious and easy to make careless mistakes.<br /><br />- also, the final exam is not hard because of its content, but because of its short time. So yea, make sure you&#039;re familiar with the algorithms.",
      "comment_teaching": "Raymond is super nice, has VERY clear notes, and is super responsive to students&#039; questions. One of the best CS professors I&#039;ve had at UST.",
      "comment_grading": "Fairly good.<br /><br />Be very careful with the homework, as most people get full marks (i.e. losing a little marks in your homework can have a big impact on your final grade).",
      "comment_workload": "- 3 HW<br />- No mid term<br />- 1 project (consists of 1 proposal, 1 final report and 1 presentation)<br />- 1 final exam<br /><br />Reasonable workload.<br /><br />Raymond gives out coupons for people who answer his questions, and that coupon can be used to waive one question in a homework. So try to get coupons as it reduce your workload a fair bit.<br /><br />Also important to have good teammates for your group project.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "H0CgDFWfJVC94wF48TDia8wHHhcxKRka",
      "semester": "2017-18 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "samuelhe",
      "date": "Dec 31, 2017",
      "title": "Good course",
      "comment_content": "Contents include Association Rule Mining, Clustering, Classification, Data Stream, Data Warehousing, Web Database, Multi-criteria Decision Making. <br /><br />Compared to the UG data mining course, this course is naturally more difficult. It covers the proof of the important concepts/equations as well as some math (e.g. Information Theory), which is necessary. <br /><br />This course also clearly distinguishes itself from Machine Learning course (e.g. only cover Neural Networks and SVM very briefly), which is good.",
      "comment_teaching": "Raymond&#039;s teaching is very good. He comes to classes well prepared every time. His teaching materials and homework assignments cover computations, writing proof and reasoning with some math (e.g. proofing an equation by induction), and applying some engineering tricks to solve new problems. I personally learned a lot from this course.<br /><br />His questions required no rote memorization at all, involved no ambiguous definition, which I think is good.",
      "comment_grading": "30% on Homeworks (three in total)<br />30% on the Project<br />40% on Final Exam<br /><br />The grading is good. I got full marks in all three HWs, 95.5/100 in final (mean 78.xx), project unknown, and received A+.",
      "comment_workload": "The HWs requires some ingenious thinking (applying the&nbsp;&nbsp;algorithms covered in lectures smartly) and is handleable as long as some quality time is put in. <br /><br />The project accounts for the most in-semester workload. But since we had almost entire freedom in the project (do research/implementation/survey on any Database/Data Mining/Machine Learning/Information Retrieval paper), doing the project is not intimidating. According to the professor himself, the workload of the project totally depends on the students themselves, so its quite &#039;elastic&#039;.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "BZr4RM5FoAqvKJr4e1L0DToafbqRPJbB",
      "semester": "2017-18 Fall",
      "instructors": [
        {
          "id": 134,
          "name": "WONG, Raymond Chi Wing",
          "rating": 1
        }
      ],
      "author": "Aye",
      "date": "Dec 19, 2017",
      "title": "",
      "comment_content": "1. Association.<br />2. FP-tree<br />3. Clustering and subspace clustering.<br />4. Outliers <br />5. Classification (including basics about SVM and Neural Networks).<br />6. Data Warehouse. <br />7. QC-tree<br />8. Data Mining over Data Streams. <br />9. Web Databases.<br />10. Multi-criteria Decision Making.",
      "comment_teaching": "Professor&#039;s teaching is very detailed. He is also very friendly and willing to learn from students.",
      "comment_grading": "Assignment 30%<br />Project 30%<br />Final Exam 40%<br /><br />There were 3 assignments, most of the questions were basic and thus it was not hard to get full marks. Besides, Professor distributed coupons to those who answered his questions (not difficult) in class. The coupons could be used to waive at most a question in each assignment.<br /><br />Marks of project is not released.<br />Mean of Final is around 78.<br />Grading is good, got A even with mean in final.",
      "comment_workload": "The most workload lies on the group project. Choose a paper from a top conference as the baseline and conduct a survey (maxmimum 80% project mark achievable) / implementation (maximum 90% project mark achievable) / research (maximum 100% project mark achievable). <br />To perform good in the final exam, it is a good idea to review all exercises and homeworks because most of the final questions were basic as a result of the in-class election.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}