{
  "course": {
    "id": 2300,
    "subject": "LABU",
    "code": "2040G",
    "name": "Business Case Analyses",
    "description": "This course seeks to equip students with persuasive communication skills, both oral and written, through analyzing business cases and presenting solutions to problems identified. It provides students with a solid framework and hands-on practice to communicate persuasively and professionally in business settings. In presenting the case problem, analysis and recommendations, students learn to identify issues, develop and organize key ideas, and eventually to persuade the audience of the validity of the arguments and proposed actions. The course sharpens students' ability to explain and support ideas logically, coherently and cohesively using various techniques, to communicate clearly, concisely and accurately, and in appropriate tone and style. Through a range of learning activities involving reading, discussion, writing and making oral presentations, students also develop critical reading, critical thinking and problem solving skills as well as teamwork and leadership skills. For students who have this course as a program requirement.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310,
      2210,
      2110,
      2010,
      1910,
      1810,
      1730,
      1710
    ],
    "prerequisites": "LANG 1403 OR <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1404\" href=\"/review/LANG1404\" target=\"_blank\">LANG 1404</a> OR LANG 1003 (prior to 2022-23)",
    "corequisites": "",
    "exclusions": "<a class=\"course-link\" data-subject=\"LABU\" data-code=\"2051\" href=\"/review/LABU2051\" target=\"_blank\">LABU 2051</a>, <a class=\"course-link\" data-subject=\"LABU\" data-code=\"2052\" href=\"/review/LABU2052\" target=\"_blank\">LABU 2052</a>",
    "rating_content": 4,
    "rating_teaching": 3.4,
    "rating_grading": 4,
    "rating_workload": 4.6,
    "review_count": 5,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 294,
        "name": "LAM, Levi",
        "count": 3
      },
      {
        "id": 415,
        "name": "YUNG, Hoi Hei",
        "count": 1
      },
      {
        "id": 1231,
        "name": "SAMPSON, Nicholas",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "ozC88KJS4cDkXO88j65EzpmQGDz6HL0n",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 294,
          "name": "LAM, Levi",
          "rating": 0
        }
      ],
      "author": "timeflies",
      "date": "Jan 26, 2024",
      "title": "",
      "comment_content": "2 mini cases not graded, 2 graded cases, 1 recommendation report, 2 quizzes, learning portfolio<br /><br />The same 2 cases originated from the 1960s or smth. Nobody really reads them because of chatgpt and also you can just reuse your seniors&#039; slides and ideas. Very useless content especially with Levi as your instructor.",
      "comment_teaching": "Godify Levi and listen to what he says because that will be the &quot;correct&quot; solution to your cases. I don&#039;t think he taught us how to analyze cases but how to deal with interpersonal relationships, his arrogance, his mood swings, his ego, his stories, and just him. <br /><br />He&#039;s so narrow-minded that he cannot accept any ideas you can come up with but only what he wants. So you give him what he wants and don&#039;t try to challenge him. He probably forgets what he thinks because sometimes he dislikes your idea when he clearly liked it in the last class. <br /><br />He lets you record his comments/feedback when he gives very bs and generic comments depending on what was in his mind at that moment.<br /><br />He&#039;s also that teacher who thinks his jokes are funny so you better laugh at his jokes haha.",
      "comment_grading": "If he likes you, you will be fine. If he&#039;s in a good mood, you will also be fine during that class. <br /><br />He loves giving people competent so pretty much everyone gets lots of competents and only some very goods/excellents. <br /><br />But I won&#039;t blame him since this is probably his 10th time teaching this course. So it is very hard to impress him since he already has a modeled answer in mind. He should be sick of this course as much as we do tbh.",
      "comment_workload": "Low workload but it takes up a lot of your classmates and your time to rant and complain about him.",
      "rating_content": 3,
      "rating_teaching": 1,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "lbnppQIXVRKeuFFnZu5aCZOX1MJ9f6Ef",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 294,
          "name": "LAM, Levi",
          "rating": 0
        }
      ],
      "author": "mfmf",
      "date": "Dec 08, 2023",
      "title": "",
      "comment_content": "2 Mini-cases<br />Case I - West Indies Yacht Club Resort <br />Recommendation report - WIYCR<br />Case II - Kitchen Best <br />Learning Portfolio<br />2 Quizzes (free grades)<br /><br />All these resources have not been changed in years",
      "comment_teaching": "In short, Levi is not a good teacher. <br /><br />In all the cases, he rejects all the ideas he deems not good enough, and the whole class ends up using pretty much the exact same ideas. It&#039;s like playing russian roulette walking into his class: when he&#039;s in a good mood, the class will be alright, but when he&#039;s not, he says no to everything, even to ideas that he had previously said yes to. He also provides zero guidance on how to do better in class. When I ask him a question, I don&#039;t even expect a straight answer anymore because all he knows how to say is &quot;Do you think it&#039;s ok?&quot; or &quot;what do you think?&quot; <br /><br />I also think that he doesn&#039;t actually grade your tasks properly. On multiple occasions, he commented on things I can improve on that are clearly already done. He also doesn&#039;t provide any substantial feedback that you can use to improve on the subsequent tasks and comments really general things like &quot;be more specific&quot;. <br /><br />Overall, I don&#039;t think he is fit to teach this class and doesn&#039;t want to see his students succeed.",
      "comment_grading": "All tasks are graded on a scale from unsatisfactory --&gt; marginal --&gt; satisfactory --&gt; competent --&gt; very good --&gt; excellent<br /><br />Levi usually gives grades from satisfactory onwards. I think competent/very good is what he gives out the most, and there are minimal excellents in his classes. Again, he doesn&#039;t really provide any feedback on how to improve the grades.",
      "comment_workload": "The workload isn&#039;t too much honestly. If you work incrementally for each task, you&#039;ll be fine.",
      "rating_content": 3,
      "rating_teaching": 1,
      "rating_grading": 2,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 5,
      "vote_count": 5,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "wkJy7NOWkVEaexpPXsPcoGI1DoEcYEKH",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 294,
          "name": "LAM, Levi",
          "rating": 1
        }
      ],
      "author": "blue :)",
      "date": "Jan 27, 2022",
      "title": "",
      "comment_content": "During the add-drop period:<br />Mini case: California Wood Harvesting Co.<br />- Presentation (F2F)<br />(Not graded)<br /><br />During the semester:<br />Case 1: WIYCR<br />- Presentation (Video recording)<br />- Recommendation Report <br />Case 2: Kitchen Best<br />- Presentation (F2F)<br />- Learning Portfolio<br /><br />Group presentation formed by 4 ppl.",
      "comment_teaching": "Levi is a nice professor and the lessons are interactive. He is very helpful and guided us step by step when we wrote the recommendation report. He also offered us lots of advice during group discussions. Overall a very good professor.",
      "comment_grading": "No Mid-terms or Finals.<br />Only 3 presentations in total throughout the semester. (The first one won&#039;t be graded, just a practice presentation)<br /><br />The grading is good. Presentations are graded by: Excellent, Very good, Competent, ...). Around 80% of mine is very good and 20% is competent. But out of my expectation, the final grade is A.<br /><br />A small reminder: Make sure you follow everything he says (PPT Slide, presentation structure, the recommendation report, and the learning portfolio) and you would get an A-range grade.",
      "comment_workload": "The workload is low.<br /><br />You only need to read the case before lessons. (And there&#039;s only 3 in total). Cases are around 15-20 pages long. <br /><br />No homework/ take-home assignments in general, only one recommendation report. Levi would give you time in class to work on that. If you want to polish the essay but don&#039;t have enough time in class, you might need to spend some extra time working on it. <br /><br />There are presentations, and you have time to prepare the ppt slides together with your groupmates in class (Levi would offer you suggestions in the meantime). You can also prepare scripts in class so no extra work is needed outside the classroom. However, if your group wants to do rehearsal beforehand (which is recommended), there would not be enough time in class.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "u3R5lUDa4wGwQpHHvHkxYbDk5ywtfNPd",
      "semester": "2021-22 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "kkklo",
      "date": "Jan 24, 2022",
      "title": "",
      "comment_content": "Assessment overview in chronological order:<br />1. Oral presentation 1: 12 mins, groups of 3 or 4 (20%)<br />2. Peer evaluation for oral presentation 1 (2%)<br />3. Writing task: individual, 1000 words max (28%)<br />4. Oral presentation 2: 12 mins + 4 mins Q&amp;A, groups of 3 or 4 (28%)<br />5. Peer evaluation for oral presentation 2 (2%)<br />6. Online assignments: online quizzes based on case readings ​(4%)<br />7. Discussion skills: peer evaluation for oral presentations 1 and 2 (8% - 4% x 2)<br />8. Learning portfolio (8%)<br /><br />Attendance is required.",
      "comment_teaching": "Nick&#039;s a great teacher. He&#039;s approachable and his teaching is understandable. From his powerpoints, you will be able to gauge what he is hoping to see in your presentations. He&#039;s flexible in terms of class logistics (e.g. order of presentation), and he always offers consultation sessions for each group before each final presentation. And on the fun side, he sends out weekly emails recommending music he enjoys listening to!",
      "comment_grading": "Nick&#039;s a fair grader. He makes sure you know what he is looking for and it&#039;s very easy to clarify in class. For the writing task, he shows written examples of what is good and bad; for the presentations, he shows past videos of groups so the standard is clear.",
      "comment_workload": "The workload is totally tolerable. If you&#039;re a comfortable and confident speaker, you might find this a fun class, especially with Nick. You will have to find time outside to go through your presentations with groupmates and record your performance though (for the first presentation).",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": false,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "c3WcpZcmKlanT7yj2AQbWnAHD3fo3GuD",
      "semester": "2020-21 Fall",
      "instructors": [
        {
          "id": 415,
          "name": "YUNG, Hoi Hei",
          "rating": 1
        }
      ],
      "author": "Yannes Kwok",
      "date": "Feb 05, 2021",
      "title": "Reg Ivan Yung!!",
      "comment_content": "There are two cases for the course. For the first one, we are required to do a group presentation and for the second one there are both a group presentation and an individual report.",
      "comment_teaching": "He teaches well while being chill at the same time. He is very willing to help after office hours, you can always email him and he will try his best to offer help.",
      "comment_grading": "The grading is very nice, just follow his instructions and hand in work on time --&gt; you will be able to get an A-range grade.",
      "comment_workload": "The workload is alright. There may be things to prepare before each lesson (e.g. case readings, sharing on case analysis), but the amount is acceptable.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}