{
  "course": {
    "id": 3872,
    "subject": "BIEN",
    "code": "6930D",
    "name": "Synthetic Biology",
    "description": "Synthetic biology is the science of applying the principles of computation and engineering to biological systems. It is based on the understanding that cells, genetic networks, signaling pathways and other biological phenomena interconnect in ways that allow adaptation to new circumstances. This adaptability can be exploited to solve real-world problems in industry, agriculture, and medicine. Synthetic biology brings together biology, biotechnology, computer science, electrical engineering, and mathematics to create useful genetic tools and platforms. It is also a strategy to help us understand basic biological regulatory mechanisms and complex genetic networks: by designing and building artificial ones, we learn how they work in nature (understanding by building). In this course, you will study the theoretical underpinnings of cutting-edge research in synthetic biology and learn how the development of disruptive technologies, combined with engineering principles, led to the emergence of this new scientific field. You will also learn how basic theory and knowledge of biology can guide the rational design of artificial biological circuits in living cells to accomplish well-defined goals. The goal of the course is to help you acquire essential techniques in synthetic biology, such as designing and constructing genetic parts, devices, modules, and systems, and develop new perspectives and skills that may help you in the future meet the demands of the biotech industry and academia.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2230
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 4,
    "rating_grading": 5,
    "rating_workload": 4,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1692,
        "name": "LAI, Yong",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "AGCCMpEvQgBn41jSn7SRffMcbcjifyeS",
      "semester": "2022-23 Spring",
      "instructors": [
        {
          "id": 1692,
          "name": "LAI, Yong",
          "rating": 1
        }
      ],
      "author": "hwli",
      "date": "Jan 30, 2024",
      "title": "Great Introduction Course for the emerging field of Synthetic biology",
      "comment_content": "The course introduces the exciting realms of synthetic biology. As synthetic biology is a recent field that brings molecular biology, biotechnology and computational logic and science together, some of the contents requires inter-disciplinary thinking, which I really enjoy learning. Imagine that biological metabolic pathways can be visualized as boolean logic gates and engineered as sensors and therapeutics. That&#039;s really cool.<br /><br />The course is separated into several sections. For the first few weeks, the professor introduce basics of molecular biology and key principles in biology. Then, topics such as &#039;reading&#039; and &#039;writing&#039; DNA with cricuit logic are introduced. At last, some special unique circuits and systems are introduced in the last few weeks.&nbsp;&nbsp;Morevoer, there is a hands on tutorial section to use Benchling.",
      "comment_teaching": "You can really feel his passion toward synthetic biology in his slides. Each lecture is filled with different, almost non-overlap contents and he is very patience to explain any questions, in particular some of the circuit designs and logics behind several synthetic biological systems. However, his slides are sometimes too crowded (Not my preference) and sometimes make it harder to focus during the 3 hour lecture every week.",
      "comment_grading": "As this is a PG course, the grade is pretty lenient (compared to other UG course here). The project score was not disclosed, but the score of the quizzes are shown to us. For me, I got:<br /><br />Quiz 1: 34.5/40<br />Quiz 2: 29.5/40 (got sick so did not do any revision)<br />Project: Unk<br />Overall Grade: A-",
      "comment_workload": "There is a literature review,&nbsp;&nbsp;2 quizzes, 1 project presentation to propose an idea using synthetic biology principles. As I previously joined iGEM before, the project presentation is quite straight forward but designing the circuit requires some time. The literature review requires 1500-2000 words to summarize papers (≥5 research papers) which were published in the latest 5-10 years from one synthetic biology research group, which requires some time to write about, but overall quite straight forward to finish.",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": false,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": [
        {
          "key": "eTuTymcU579OJKGIqTwgu15kMw4Rf4rH",
          "name": "BIEN6930D-Syllabus (1)",
          "format": "pdf"
        }
      ]
    }
  ]
}