{
  "course": {
    "id": 3919,
    "subject": "CORE",
    "code": "1660",
    "name": "Exploration of Drawing",
    "description": "Drawing is a foundational form of communication extending from prehistoric times to the work of modern-day artists and designers. The creative use of lines, shapes, and textures is both a form of expression and a tool to sharpen one’s thinking and message. In this course, students will explore various types of techniques, mediums, styles, and materials, and learn concepts and history relevant to the fine arts and related industry.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2230
    ],
    "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 2,
    "rating_teaching": 1,
    "rating_grading": 3.5,
    "rating_workload": 5,
    "review_count": 2,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1733,
        "name": "CHU, Shun",
        "count": 2
      }
    ]
  },
  "reviews": [
    {
      "hash": "TFs1tB6A5owWDHFYk1m6tEpj0qggF5rS",
      "semester": "2023-24 Spring",
      "instructors": [
        {
          "id": 1733,
          "name": "CHU, Shun",
          "rating": 0
        }
      ],
      "author": "EKKO",
      "date": "Mar 11, 2024",
      "title": "",
      "comment_content": "Mainly includes drawings and watercolors. Sketch before midterm, watercolor after that. Also go outside to sketch<br />主要包括素描和水彩。期中前教素描，之后是水彩。也会出去户外写生",
      "comment_teaching": "!!! Before choosing this course, please be sure to read this review before making a decision!!!<br /><br />My opinion is just like the previous assessment, this prof does not teach you how to draw in class, but shows youtube videos, plus some examples of master works. I don&#039;t think this is helpful for beginners in painting. These videos will not cover the basic principles of painting, understanding the way of painting and other basic skills, only some simple techniques to introduce. Ironically, he claimed in class that traditional basic painting skills were a waste of time (I immediately felt something wrong with this professor when I heard his speech, but it was a pity that adp had passed at that time, so I could not drop).<br />It was then that I began to wonder if the professor could really draw. Then I began to examine the matter step by step.<br />According to the official website of HKUST, the professor&#039;s portfolio is only a collection of photographs, and his classification as an artist is also &quot;photographer&quot;. I can&#039;t find his drawings or watercolors anywhere else on the Internet.<br />When I tried to ask him if he could look at his paintings for study, he was very impatient and refused me outright.<br />Later, when I asked the TA (who was very gentle and could communicate well) if the professor had any sketches and if he could tell me where I could see his works, he also said he didn&#039;t know.<br />In fact, these points are very strange, but it is not only strange.<br />Next, I will list some abnormal behaviors of this professor in the teaching process.<br />1. During the mid-term sketch show, a student taped sketch paper to the drawing board and finished the painting. This is actually a must do when you usually learn to sketch, which will lead to a blank circle around the drawing paper after the tape is torn off, very neat. The professor praised the final product and said that the student&#039;s work was very interesting and innovative. But if he had actually sketched, he would have known the reason for this effect.<br />2. He attaches great importance to the way of drawing lines and has very strict requirements. He put a lot of emphasis on crosshatching, which is the overlapping of two sets of lines in different directions to deepen the gray scale. But from the painting principle, the ultimate purpose of the line is to create gray scale, to maintain the overall picture of the light and dark relationship is unified, as long as you can achieve this purpose, any line is desirable, including the line with the way of rubbing mixed to pursue the gray surface is also a large number of and widely used skills. But he was only concerned about the wiring method, and said nothing about the nature of the period.<br />3, he did not give a single demonstration until midterm (which is when I wrote this review).<br />4. He highly praises the painting method of making the environment completely empty or even not painting, leaving large amounts of white space and highlighting the main object. It is true that this painting is very effective and beautiful, but he only recognizes this style. If you add a gray scale to the background, making a significant difference in the virtual-real relationship between the main object and the secondary object can also give the main object a significant emphasis effect (in fact, the painting method he advocated was to emphasize this virtual-real relationship to the extreme, which is a somewhat lazy way of dealing with it. In the case of insufficient ability, we can take this way to cover up their basic skills and quickly produce results). As soon as you add a gray scale to the background, he will think that the main object is not prominent enough and criticize it. (He criticized a lot of people for this during the midterm presentation.)<br />5. He has been emphasizing the presence of people in the picture, which he thinks is the main way to make the picture interesting, and he does not accept other opinions. In fact, the point of view of the picture is mainly generated by contrast, and the right objects can indeed make the contrast more interesting, but not every painting needs people in it. (Perhaps this can be seen in his photography. Most of his photography is the recording of people in a scene)<br />6. When he introduced the concept of grey scale, he stressed that the picture must have at least five grey scales, but he did not explain the principle of grey scale. The example of the five grey scales he then shows is a painting of a building, which he says has five different shades of grey in it, so it has five grey scales. But in fact, the different colors of this painting are caused by the inherent colors of the objects, and the author has hardly made detailed light and shadow depiction. He said that the five gray scales are usually we often say that the highlight, bright surface, light and dark boundary, dark surface, reflection. In fact, this concept is essentially the understanding of light and shadow effects, and inherent color is not the same thing)<br />7, he began to ask us to do outdoor sketching after three classes. But for beginners, three lessons are unlikely to give people the ability to sketch, let alone outdoors. Compared with indoor painting, in the outdoors because the sky light is a diffuse light source, all outdoor objects are difficult to have a clear light, but also let the beginners rely on to distinguish different gray scale skills difficult to use. This kind of sketching has very high requirements for basic skills, and the average art teacher can never let students draw this kind of thing at this stage. But it would be understandable if his requirements for visual effects were not high, just exploration level (which is the title of this lesson). But he also asked for the picture at a high level (the level mentioned above that he likes), which is incredible.<br />8. The watercolor pigment I bought is the solid watercolor of Van Gogh brand, which is different from the cherry blossom brand he recommended. When he saw my watercolor paint he asked me what it was (I was shocked). In addition, the quality of Sakura watercolor pigments is very average, but it is very expensive to sell, which is very famous among art learners, usually art teachers will not recommend buying.<br />9, he stressed that the brand of tools and paper is not important. In fact, for watercolor, different brands, different types of paper performance is very different, some types of paper is not suitable for beginners to paint. He also did not mention the difference between wood pulp, paper, cotton pulp and paper. For sketching, the impact of the difference in tools will be smaller, but the tools he requires also lack the very important soft erasers, sketch erasers, paper erasers and so on.&nbsp;&nbsp;<br />10, a beginner said in the mid-term demonstration that she had been painting this picture for three days, unfortunately, due to the lack of irresistible ability (which is not her problem), her picture performance was not satisfactory. At the same time, the last student who exhibited her works had obviously learned painting and had accumulated certain skills. It only took a few hours to finish a work, and the picture effect was very good. When the professor learned that the beginner had been painting for three days, he immediately began to ridicule, and I clearly remember his exact words: &quot;You see? She spent 3 days!&nbsp;&nbsp;But you look at that student, she only spent xx hours!&nbsp;&nbsp;And you can compare their works. Think about it, why could this happen?”&nbsp;&nbsp;I immediately shouted at him: the drawing is very good before the study (in fact, I personally communicate with the drawing is very good student, she really has a foundation), your comparison is unfair. Then he was very shocked to say: Ah, she studied? To be honest, you can&#039;t even see it, and his level of expertise is really revealing<br />There are many similar examples, and as the example just said, he has a very single aesthetic and at the same time is not open to other opinions. All sorts of unusual behavior led me to conclude that he couldn&#039;t paint. He graduated from the Art Management Department of Baptist University. I don&#039;t know whether this department teaches painting or not, but his behavior is really typical of seeing some works but not practicing them.<br />11, he stressed that we have to draw our own style, stressed many, many times. But style is something that can only be formed after a lot of practice in a basic situation, which anyone who has studied painting must know. For a beginner, he may be able to draw something interesting, but he will not be able to reproduce this effect steadily in later paintings. The so-called style of beginners is essentially a kind of accident, good luck hit, even the painting itself can not say the principle of this effect. However, in his mid-term presentation, he referred to some common treatments in many beginner pictures as styles, but he did not mention the exquisite techniques in many other works. When you encounter a good painting, you can only praise it in general, and do not explain the subtlety of this painting. After listening to his evaluation, you will have a feeling: he is not lazy to talk, he is really unable to tell.<br />Another review has made that very clear about his character. Arrogant and opinionated, he knew little about the principles of painting and refused to engage with his students. I won&#039;t go into details here.<br />I have privately asked several classmates who have also studied painting, and their opinions are almost the same as mine.<br />Oh, and he likes to talk to female students in class。<br /><br />！！！在选择这门课前，请一定要看完这篇评价再做决定！！！<br />我的意见就像前面的那篇测评一样，这位prof在课堂上不会教你如何去绘画，而是播放youtube上的视频，外加一些大师的作品展示。我认为这对于绘画初学者而言毫无帮助。这些视频不会包含绘画的基本原理，理解绘画的方式之类的基本功，只有一些简单的技法介绍。讽刺的是，他在课堂上声称传统的绘画基本功练习是非常浪费时间的（在我听到他这个发言的时候立刻感觉到了这个教授的不对劲，但可惜当时已经过了adp导致无法drop了）。<br />也就是在那个时候，我开始考虑这个教授是否真的会画画。随后我开始逐步求证这件事。<br />在HKUST的官网上查到的，这位教授的作品集仅有摄影作品集，同时他作为艺术家的分类也是“摄影师”。我无法在网上任何其他地方找到他的素描或是水彩作品。<br />当我尝试询问他是否可以欣赏一下他的绘画作品以供学习时，他表现地非常不耐烦并且直接拒绝了我。<br />之后我去问TA（TA很温和，是可以很好地沟通的类型）教授是否有素描作品，能否告诉我在哪里可以看他的作品时，TA也表示不知道。<br />其实这几点已经非常奇怪了，但是奇怪的还不止这点。<br />接下来我会列举一些这个教授在教学过程中的一些反常行为。<br />1，期中素描展示的时候，一位学生用胶带将素描纸粘在画板上完成了画作。这样做其实是平时学素描的时候的必做事项，它会导致画纸的四周在胶带撕掉以后留下一圈空白，非常整齐。这个教授对最后的成品大加赞赏并表示这位学生的处理非常有趣，很有新意。但是如果他真的画过素描必然会知道这个效果出现的原因。<br />2，他非常看重素描时排线的方式并且有很严苛的要求。他非常强调crosshatching,也就是用两组不同方向的排线重叠在一起来加深灰阶。但是从绘画原理来讲，排线的最终目的是制造灰阶，保持画面整体明暗关系统一，只要能达到这个目的，任何的排线方式都是可取的，包括将排好的线用揉擦的方式混匀以追求灰面的均匀柔和也是大量且广泛使用的技巧。但是他仅仅只在意排线方式问题，对于期本质只字未提。<br />3，他直到期中为之没有进行过一次示范（也就是我写这篇评论的时间）。<br />4，他很推崇将环境完全虚化甚至不画，大片留白并突出主物体的画法。诚然这个画法是很出效果并且很好看的，但是他只认这一种风格。如果你为背景添加灰阶，在主物体和次要物体之间的虚实关系上做出明显差异也能让主物体产生明显的强调效果（实际上他所推崇的画法就是把这种虚实关系强调到极致的结果，是一种有些偷懒的处理方式。在能力不足的情况下，我们采取这种方式能够掩盖自己基本功,快速出效果）。一旦你为背景添加灰阶，他就会认为主物体不够突出然后提出批评。（期中展示的时候很多人都因为这个被他批评了）<br />5，他一直在强调画面中要出现人，他觉得这是让画面变得有看点的主要方式，并且不接受别的意见。实际上画面的看点主要由对比产生，合适的物件确实能让对比变得更有趣，但是并不是每幅画都需要人在里面的。（或许这点可以从他的摄影作品里看出端倪。他的摄影作品大多都是对人物处在某个场景中的记录）<br />6，他在介绍灰阶概念时，强调画面必须有至少五个灰阶，但是他并没有解释灰阶的原理。他随即展示的五个灰阶的例子是一幅建筑的绘画，他说这幅画里有五种不同深度的灰色，因此它有五个灰阶。但其实这幅画的不同颜色是由物体的固有色导致的，作者几乎没有做细致的光影刻画。（他说的五个灰阶就是平时我们常说的亮面、灰面、明暗交界线、反光、投影。 其实这个概念本质上是对光影效果的理解，与固有色是两码事）<br />7，他在上了三节课之后就开始要求我们进行户外写生。但是对于初学者而言三节课的时间不可能让人拥有写生的能力，更别说户外了。相较于室内写生，在户外由于天光是漫光源，所有户外物体都很难有明确的打光，也就让初学者所依赖的以明暗区分不同灰阶的技巧难以使用。这种写生对于基本功的要求相当高，一般的美术老师在这个阶段绝不可能让学生去画这种东西。但是如果他对于画面效果的要求不高，仅仅是exploration的水平（也就是这节课的标题），那也能理解。但偏偏他还以高水平去要求画面（就是前面提到的他喜欢的那种水平），就让人匪夷所思。<br />8，我购买的水彩颜料是梵高牌的固体水彩，与他推荐的樱花牌长得不太一样。当他看到我的水彩颜料的时候居然问我这是什么（我震惊了）。另外，樱花牌的水彩颜料质量非常一般，但又卖的很贵，这一点在美术学习者之间是很出名的，通常美术老师不会推荐购买。<br />9，他强调工具和纸张的品牌不重要。实际上对于水彩而言，不同品牌，不同种类的纸张性能差异很大，部分种类纸张不适合新手作画。他也没有提及木浆纸棉浆纸的区别。对于素描，工具差异的影响会小一些，但是他要求的工具里面也缺了素描工具里非常重要的软橡皮，素描橡皮，纸擦笔之类。（在最近的一节课里，他又改口说千万不要购买中国内地产的温莎牛顿水彩，因为质量很差。我没用过牛顿的，不了解，但是上中国内地的网络论坛搜的时候很多人都有推荐牛顿牌水彩）<br />10，一位初学者在期中展示的时候说自己这幅画画了三天，很遗憾由于不可抗的能力不足（这并不是她的问题），她的画面表现不尽如人意。同时在她上一位展示作品的学生是很明显学过画画的，本身有一定的技术积累，画完一幅作品仅用了几个小时，同时画面效果非常好。教授在得知那位初学者画了三天的时候直接开始嘲讽，我清楚地记得他的原话：“You see? She spent 3 days! But you look at that student, she only spent xx hours! And you can compare their works. Think about it, why could this happen?” 我当即对他吼道：那位画得很好的之前学过（事实上我私下里和那位画的很好的同学交流过，她的确实有基础的），你这样对比是不公平的。然后他很震惊地来了句：啊她学过？说实话这种程度都看不出来，他的专业程度真的暴露的一览无遗<br />还有很多类似的例子，也正如刚刚的例子所言，他的审美非常单一，同时又不接受其他意见。各种反常的举动让我断定他不会画画。他毕业于浸会大学的艺术管理系，我不知道这个系到底教不教绘画，但是他的举动确实是典型的看过一些作品但是没有上手实践过的样子。<br />11，他强调我们要画出自己的style，强调了很多很多次。但是风格这种东西是要在有基础的情况下经过大量练习才能形成的，这点但凡学过绘画肯定是知道的。对于初学者而言，他可能能够画出一些有意思的东西，但是他是不可能在之后的绘画中稳定地复现这种效果的。初学者所谓的风格本质上是一种偶然，运气好撞上了，就连画画的自己也说不上这种效果好看的原理。但是他在期中展示中，把许多初学者画面中一些常见的处理称为风格，却对很多其他作品中精妙的技法只字不提。遇到画的好的就只能笼统地夸赞一番，完全不解释这幅画地精妙之处。你在听了他的评价之后就会有一种感觉：他不是懒得讲，他是真的讲不出来。<br />关于他的为人，另一篇评论已经讲的很清楚了。他非常的傲慢并固执己见，对于绘画的原理几乎一无所知并且也拒绝和学生深入交流。我在这里就不多赘述了。<br />我私下里问过几位同样学过绘画的同学，他们的看法与我几乎一样。<br />哦对了，他还特别喜欢在课上找女学生聊天。<br /><br />补充一下，在他的facebook上找到了一些画作，不确定是不是他本人画的。如果是的话，那他画的是真的有够丑的。这是他的facebook链接：https://www.facebook.com/BirdyChuPhotography/",
      "comment_grading": "We haven&#039;t finished class yet. I don&#039;t know<br />还没结课，不太清楚",
      "comment_workload": "Not too much homework, just a few drawings, depending on how good you are at drawing<br />没多少作业，就是几幅画，耗时主要取决于你会不会画",
      "rating_content": 1,
      "rating_teaching": 1,
      "rating_grading": 3,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 3,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "FlcXHmskubces2aVrljv9LBxvRGsu5Q6",
      "semester": "2022-23 Spring",
      "instructors": [
        {
          "id": 1733,
          "name": "CHU, Shun",
          "rating": 0
        }
      ],
      "author": "isdn好玩",
      "date": "Jun 10, 2023",
      "title": "Not sure if it is a beginner-friendly course",
      "comment_content": "In the lecture(2hr per week), the instructor has some ppt to show some basic techniques and the history of drawing. Sometimes he showed some masterpieces of art. <br /><br />In the tutorials(1hr per week), you will need to bring painting props to get ready to paint. In the first few weeks, we were all sketching, and after the midterm exam, we started to paint watercolors.<br /><br />There were chances to go out of the campus to sketch/paint. e.g. We went to Chinese University to sketch, we also visited a museum to appreciate artworks.",
      "comment_teaching": "To be honest, my impression of this teacher is very poor. He often speaks ambiguously, and I don&#039;t know what he wants to express. I feel that students need to learn mind-reading skills to understand what he is thinking.<br /><br />Although this teacher claims to welcome students to ask him questions, he behaves impatiently and disrespectfully when students actually ask him questions. For example, after listening to his description of the course, I didn&#039;t understand some parts, so I asked him. But he was very impatient and asked if I hadn&#039;t been listening to him.<br /><br />He also likes to randomly call on students to answer questions in class. One problem is that he thinks he knows the students well, but he often calls out the wrong names, which is embarrassing. <br /><br />When classmates go out to present their artwork, he often asks us to evaluate each other in public, which is awkward and time-consuming. He also likes to call on students he knows to answer questions, so I often see a few students answering questions many times, and I feel sorry for them.<br /><br />The most embarrassing thing is that this teacher makes jokes that are not appropriate for certain students. He seems to have no idea what respect is.<br /><br />This teacher often switches between Chinese and English when speaking, and there are many non-locals in this course who may not understand, which causes them a lot of trouble.<br /><br />Furthermore, I&#039;m not sure if this teacher can actually draw. He has only shown his artwork once, and I don&#039;t know if he was serious, but his artwork doesn&#039;t look very professional, so I started to question his teaching ability.<br /><br />He doesn&#039;t actually “teach” in class, and the PPT doesn&#039;t have much content. He also talks a lot of nonsense. And you know what? He actually plays drawing tutorials from YouTube as if he&#039;s teaching us. I think to myself, why don&#039;t I just watch the tutorial videos on YouTube myself? Why do I have to come back every Wednesday to watch him play YouTube videos?<br /><br />Sometimes this teacher can give students appropriate advice. <br /><br />But once, a student used blue as the main color in their artwork and painted a temple (as I remember). This teacher criticized the student because he thought that when painting a temple, you should respect its original color scheme, so he thought that the student shouldn&#039;t use blue in the painting. <br />In my opinion, this is very ridiculous. Artistic creation should be free, and if every artist has to paint according to what he says, then there will be no innovative creations in this world. Moreover, from my ten years of experience in painting, that student painted very well, and he combined blue with the temple environment harmoniously. I feel really sorry for that student, and I hope he won&#039;t be limited by this teacher&#039;s perception of his talent.<br /><br />To that student, if you are reading this text right now, I want to tell you that you draw very well, don&#039;t be influenced by that tutor!<br /><br />Although you may be a little disappointed by now, I would like to add a comment on the TA.&nbsp;&nbsp;The TA is very good! There is no harm without comparison!!! When the instructor makes a mistake, the TA can always come out immediately to remind him, and her attitude is also very good. She can be regarded as the supervisor of this tutor XD<br /><br />Since I felt that this teacher had problems from the beginning, I tried to keep a low profile in class. I didn&#039;t actively ask him questions and tried not to be remembered by him. Maybe this is the skill to survive in this course.<br /><br />Actually, maybe this teacher has no bad intent (I hope), he may just want to care for us in his own way, but I don&#039;t really like his way. He may just not know how to get along with students. I believe that some students can get along with him, but not me. Anyway, maybe my evaluation of him is very subjective, and you still need to actually get along with him to know what kind of person he is.",
      "comment_grading": "Attendance Course participation (10%)<br />Mid-term assignment (30%)<br />Final Presentation (40%)<br />Learning portfolio (20%)<br /><br />I want to clarify that I think my grade is not a reliable reference because I have been learning to draw since Primary school, and I have accumulated a lot of experience in drawing, which makes my artwork look good. That&#039;s why I received an A grade in this course. However, I am not sure about the grades of other students.",
      "comment_workload": "Actually, I think it depends on your drawing experience. If you are a beginner, you may need to spend more time and effort to get a better grade. Personally, I don&#039;t think the workload of this course is heavy, considering that the suggested number of pages for the learning portfolio is just two A4 pages per week. The mid-term and final presentations also only require a total of two A3-sized drawings (one sketch and one watercolor).<br /><br />If you have sufficient drawing experience, you can come here to relax.",
      "rating_content": 3,
      "rating_teaching": 1,
      "rating_grading": 4,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 3,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    }
  ]
}