{
  "course": {
    "id": 3923,
    "subject": "CORE",
    "code": "1667",
    "name": "Video Art",
    "description": "Video Art is an art form combined varies medium, moving images, sound, and multimedia elements. This special art form involves experimentation, concept implementation and editing. In the course, we will explore varies camera skills, and explore styles and concept. Through explorations and practices to achieve certain features and concepts of video art.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2240,
      2230
    ],
    "prerequisites": "a passing letter grade in <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1401\" href=\"/review/CORE1401\" target=\"_blank\">CORE 1401</a> OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1402\" href=\"/review/CORE1402\" target=\"_blank\">CORE 1402</a> OR CORE 1403 OR <a class=\"course-link\" data-subject=\"CORE\" data-code=\"1404\" href=\"/review/CORE1404\" target=\"_blank\">CORE 1404</a> OR LANG 1002 (prior to 2022-23)",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 3,
    "rating_teaching": 4,
    "rating_grading": 5,
    "rating_workload": 1,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1733,
        "name": "CHU, Shun",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "SvT8Phc8BM68E3nwBMW2GKfjNqSviUYM",
      "semester": "2022-23 Spring",
      "instructors": [
        {
          "id": 1733,
          "name": "CHU, Shun",
          "rating": 1
        }
      ],
      "author": "Siu Ming",
      "date": "Sep 08, 2023",
      "title": "Core 1667 Video Art, HUMA 1155 Video Art",
      "comment_content": "The course taught about the definition of &#039;Video Arts&#039; and videos are played and appreciated in the lessons. For instance, how the music and video hit the beat gives different vibes to a video, and how the angles are shot to suit the character&#039;s personality. The course would go through drawing storyboards, filming practice with your own cameras, editing theories, video screening, and appreciation and light demos. The lecture and tutorial are connected for 3 hours so it is quite challenging if the class is from 6 pm to 9 pm. It is fun to learn more of the side of phrases and terms in the video making. However, the course would not really help you a lot with your own filming skills. Self-taught and self-experience are required for the real filming part and editing part. Therefore, do not expect to learn how to film or edit from this course, but to learn the theory behind filming videos.",
      "comment_teaching": "The professor is nice in person. He is willing to chat with classmates ,and gives ideas on your videos. However, the comments would mostly be things that he would not like to see in a video rather than something he would like to see. He may always ask questions in class to keep you awake. Also, if sometimes things cannot be explained in English, he would switch to Chinese unconditionally, so be prepared if you are a non-local, you better sit with classmates that can translate the words to you.<br />If you judge the videos that he put in the PowerPoint in a very special way, he would see you as seeing the video in a wrong way, so please be careful when giving out your opinions. <br />In general, he is a quite nice professor. If you find him after class, he is willing to take time to answer your questions and even accept your suggestions.",
      "comment_grading": "I got an A- overall. However, how the professor graded me is still a mystery, and actually no one knows how the grading system works. He did not really give any specific guidelines on defining the video is good or not. The only tip I can share is that to have a clear PowerPoint explaining the message of the video, and the video is enjoyable to watch, to the level just like the videos, and vlogs you have watched on YouTube. By understanding the background of the professor as a video advertiser, it is better for you to aim to advertise when you produce the video.<br />I have asked some of my classmates, and overall, the lowest grade is B-, so I guess people can give this course a try.<br />_<br />For video project,<br />Excellent (&gt;=85/100): Highly creative and well-composed content with accurate editing skills, showing a very good level of understanding of the overall video medium.<br />Good (&gt;=75/100): Creative and well-planned content with a certain level of production and editing skill<br />Satisfactory (&gt;=60/100): Demonstrates a basic sense of video production and editing skills; but creative concepts are used<br />Pass (&gt;=50/100): Creativity can barely be found in the concept of the work. Lacked of video elements, weak in presentations<br />Fail (&lt;49/100): the video does not show any basic video skills, lack of creativity and other visual elements, weak in presentations.<br />_<br />For Learning Journal,<br />Excellent (&gt;=85/100): Evidence of regular research works and solid findings of learning practices and progress (It is better to mark the dates you have recorded, photos and drawings should be included with some words explaining or reflection)<br />Good (&gt;=75/100): Traces of observations and research skills are found<br />Satisfactory (&gt;=60/100): Evidence of elementary research in related topics, some traces of ideas, and notes are found<br />Pass (&gt;=50/100): Inadequate learning progresses are found<br />Fail (&lt;49/100): Very poor or no research support and lack of contents in the journal.",
      "comment_workload": "-Attendance &amp; participation 10%<br />(Students arriving 10 minutes after the beginning of each session will be counted as late. Being late or leaving early for more than 10 minutes twice will be counted as one absence)<br />-Individual Midterm Project 30%<br />(Produce a video artwork in mp4 format to present yourself in 1 minute, subtitles is needed if there is any dialogues, open and ending credits should be included+ Mind mapping chart in A3 size paper+ Storyboard in A3 size paper + 5 minute presentation with a PowerPoint)<br />-Final Group Project 40%<br />(Create a piece of 3-5 minutes video in mp4 format to show the best side of Hong Kong + Written Statement around 1000 words to explain the concept, style, inspirations and impact that you want the audience to sense+ Research Work+ Storyboard in A3 size paper+ 5 minumtes presentation+ Peer evaluation)<br />-Learning Profile 20% (2 pages per week)<br />(A4 size notebook to keep records of your observations, inspirations, and ideas on the assignment during the semester,<br />including visits, trips, class content, drawings, sketches, news, photo records, etc.)<br />_<br />For the extra time I spent filming and editing my video, I used at least 1 day for my mid-term video, and 7 days for the final project for your reference.",
      "rating_content": 3,
      "rating_teaching": 4,
      "rating_grading": 5,
      "rating_workload": 1,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}