{
  "course": {
    "id": 4197,
    "subject": "LANG",
    "code": "1422",
    "name": "Chinese for Workplace Applications",
    "description": "This course is for students who have a background in Chinese. It aims to enhance their Chinese communication skills in workplace contexts. It also helps students to understand how language plays a crucial role in various workplace situations including self-branding, internal and external communication. Students will explore how to choose and use communicative strategies appropriate to the professional purposes, audiences, and contexts. The course will highlight the differences between the use of English and Chinese in workplace contexts, different Chinese language styles in various working regions and the culture behind the language. Students will acquire communication skills through interactive tasks, case analyses, simulated practices.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2330,
      2310
    ],
    "prerequisites": "",
    "corequisites": "",
    "exclusions": "<a class=\"course-link\" data-subject=\"LANG\" data-code=\"1411\" href=\"/review/LANG1411\" target=\"_blank\">LANG 1411</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1412\" href=\"/review/LANG1412\" target=\"_blank\">LANG 1412</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1413\" href=\"/review/LANG1413\" target=\"_blank\">LANG 1413</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1414\" href=\"/review/LANG1414\" target=\"_blank\">LANG 1414</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1415\" href=\"/review/LANG1415\" target=\"_blank\">LANG 1415</a>, <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1120\" href=\"/review/LANG1120\" target=\"_blank\">LANG 1120</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1121\" href=\"/review/LANG1121\" target=\"_blank\">LANG 1121</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1122\" href=\"/review/LANG1122\" target=\"_blank\">LANG 1122</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1123\" href=\"/review/LANG1123\" target=\"_blank\">LANG 1123</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1124\" href=\"/review/LANG1124\" target=\"_blank\">LANG 1124</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1125\" href=\"/review/LANG1125\" target=\"_blank\">LANG 1125</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1126\" href=\"/review/LANG1126\" target=\"_blank\">LANG 1126</a> (prior to 2022-23), <a class=\"course-link\" data-subject=\"LANG\" data-code=\"1127\" href=\"/review/LANG1127\" target=\"_blank\">LANG 1127</a> (prior to 2022-23)",
    "rating_content": 2.5,
    "rating_teaching": 4,
    "rating_grading": 3.5,
    "rating_workload": 3,
    "review_count": 2,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1728,
        "name": "ZHONG, Yin",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "HOS06V01ntzZGE0Q5GUonKatgbIPiDee",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1728,
          "name": "ZHONG, Yin",
          "rating": 1
        }
      ],
      "author": "kkkkkkkkkkk",
      "date": "Jan 04, 2024",
      "title": "Nice and passionate teacher who is willing to provide you detailed comments on assignments",
      "comment_content": "This course aims to enhance students’ Chinese language skills through targeted practice in specific workplace applications. It guides students in developing their knowledge of principles and varieties of practical Chinese writing and communication skills. <br /><br />After reviewing the new 4 Chinese Common core content, I think this course content is the most useful among all that you will learn about CV, suggestion letter and funding proposal.",
      "comment_teaching": "Her teaching is good that her powerpoint are very clear and concise, allowing you to refer to it quickly when you have to prepare for your assignments. She will also tailor-make the class activities base on the classmates&#039; personality, as our classmates are mainly Introvert, so she seldom force people to answer questions directly but do more group discussions which makes me feel a lot more comfortable. <br /><br />Besides, she is passionate in teaching that she welcomes students to ask her questions or send her emails to ask for comments before submitting the assignments. She is willing to give detailed and constructive suggestions to let you clearly know what she is expecting. Although she may be a bit strict in evaluating your assignments but I would say if you put enough hard work on it, she will really see it and appreciate it. This means your hard work will pay off. This is much better than some lecturer that I met before who smiles all the time and only say our work is good and give no insightful comments to us and eventually give us bad results. I rather hope the lecturer really tells me how I actually performed and what I should improve on instead of just giving me some lies which doesnt help us to improve at all. Hence, I think Ms. Zhong is very good lecturer if you really want to improve your chinese and ensure your hard work is fairly evaluated in lang course.",
      "comment_grading": "Video resume- 2-3 mins (10%)<br />Proposal on team culture building activities- 1500 words (30%)<br />Group Fund application proposal- 4500 words (25%)<br />Oral presentation of the proposal- 5 mins/person (5%)<br />Self-reflection (10%)<br />Peer evaluation+ online learning (10%)<br /><br />Normal grading which suits my expectation.",
      "comment_workload": "The workload is quite high especially starting from late Oct when you need to submit your 1500 words team culture building proposal and work on the group fund application proposal ideas at the same time. There is only less than 1 month for you to come up with the fund application idea, write whole proposal, draft your ppt and recite your script. Therefore, the workload is quite heavy in the end of semster so it is important for your group to start earlier and most importantly find a good teammate to work with.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "iI4dxSwpzGSLQVPxDceGCRfDAPQhwVLN",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "NOHKUST",
      "date": "Jan 02, 2024",
      "title": "meaningless content",
      "comment_content": "overall is meaningless<br />LANG1422 is a Chinese communication common core course which is offered in Fall and<br />Spring semesters. This course aims to enhance students’ Chinese language skills through<br />targeted practice in specific workplace applications. It guides students in developing their<br />knowledge of principles and varieties of practical Chinese writing and communication skills.<br />Additionally, this course enables students to properly handle common workplace internal<br />operations and external communication tasks and refines their use of Chinese to achieve<br />professional communication goals. Systematic and focused training on applying appropriate<br />modes and genres of communication in Chinese according to professional needs will be<br />provided to enable students to become more confident and competent in written and oral<br />Chinese communication, preparing them to address future career challenges. In this course,<br />students will analyse common aspects of Chinese language use in internal and external<br />workplace communications, understand the differences between English and Chinese in<br />workplace application, and apply appropriate Chinese writing and presentation skills<br />according to professional needs and relevant genres of workplace communications",
      "comment_teaching": "depend on your instructor. my instructor is good and she want to teach something and help you yo get the good grade",
      "comment_grading": "depend on your groupmate. my advice is to find the BBA student with good presenation skill to be your groudmate.<br /><br />but my score overall is above average a litte bit and get B-",
      "comment_workload": "overall is hard if you want to get good grade.<br /><br />Assignment<br />評估三：《項目資金申請書》寫作與口頭報告<br /><br />評估四：學期學習反思<br /><br />評估二：《團隊文化建設活動建議書》寫作<br /><br />網上自學：會議文件<br /><br />評估一：視頻履歷",
      "rating_content": 1,
      "rating_teaching": 3,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    }
  ]
}