{
  "course": {
    "id": 4186,
    "subject": "LANG",
    "code": "1404",
    "name": "Advanced Academic English for University Studies",
    "description": "This course puts a strong emphasis on developing university-level academic literacy and communication competence in writing, speaking, and multimodal contexts. The course introduces students to research skills using university library resources for finding and evaluating sources for academic writing and speaking tasks. It expects students to be critical readers and writers, synthesizing ideas when developing a coherent argument. The course also aims to develop students’ competence in communicating effectively in an academic community, developing the ability to collaborate both as a member of a group and assuming responsibility as a discussion facilitator in the context of student-led seminars. Throughout the course, students are expected to transfer and adapt their knowledge, attitudes and habits for autonomous lifelong learning.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2330,
      2310
    ],
    "prerequisites": "Level 5* or above in HKDSE English Language OR Overall bandscore of 7.0 or above in IELTS OR equivalence of the above",
    "corequisites": "",
    "exclusions": "LANG 1002, LANG 1003",
    "rating_content": 3.11,
    "rating_teaching": 4.03,
    "rating_grading": 3.59,
    "rating_workload": 2.78,
    "review_count": 37,
    "single_review": false,
    "enrollment_status": 0,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 444,
        "name": "HOPKINS, Mark",
        "count": 5
      },
      {
        "id": 1231,
        "name": "SAMPSON, Nicholas",
        "count": 5
      },
      {
        "id": 635,
        "name": "LI, Edward Siu Leung",
        "count": 4
      },
      {
        "id": 1716,
        "name": "KOYLU, Yilmaz",
        "count": 4
      },
      {
        "id": 332,
        "name": "LEE, Pui",
        "count": 3
      },
      {
        "id": 1323,
        "name": "LIAO, May",
        "count": 3
      },
      {
        "id": 1722,
        "name": "STAMPER, Suzan",
        "count": 2
      },
      {
        "id": 411,
        "name": "MEGAN, Melissa Jane",
        "count": 1
      },
      {
        "id": 466,
        "name": "ENGLAND, Graham James Fisher",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "tSm7c0to7J4Q6S8v5BV0g19Uqf7a60Hv",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "Elif",
      "date": "Feb 19, 2024",
      "title": "",
      "comment_content": "The content about citations was interesting, but the rest was things most of us had already done in high school, so it felt a bit pointless.<br /><br />Basically, it is about multimodality and research presentation, which is not very necessary for engineering. Plus, all assignments are about the same content but remade in a different form, which doesn&#039;t contribute to learning about research or essay writing at all.",
      "comment_teaching": "The teaching was the best part of this course. Professor Yolanda was understanding and informative. She had detailed slides and good examples.<br /><br />Consultations helped a lot with the seminar and the e-magazine since she gave tips about what we should do and how we can achieve a better grade. Overall, she was helpful and dilgient.",
      "comment_grading": "I believe the course has absolute grading, which is always welcome in LANG courses since having a curve is stupid in a course with students who already transferred an English credit (for Fall semester)<br /><br />The grading system is by assignments:<br />Annotated bibliography 15%<br />Synthesis paper 10%<br />Seminar presentation 20%<br />E-magazine 30%<br />Self-reflection 10% (2 of them)<br />Self-directed tasks 15%<br /><br />The criteria goes as Exceptional, Advanced, and Competent and I haven&#039;t seen anyone below this.<br />After the instructor gives the grades they are scaled based on the grade components.<br /><br />The grading is fair but depends heavily on the teacher. I got Advanced or Exceptional from all my assignments and ended up with an A. Most of my friends also got better than they expected, so I would say it&#039;s quite good.",
      "comment_workload": "The workload starts slowly at the beginning and gets heavy towards the end. There is so much time for an annotated bibliography at the beginning and it is a short task, but e-magazine is due right towards the finals so it takes too much time that could be used studying.<br /><br />All the important tasks are done in groups, and if you don&#039;t have a nice group at the beginning of the semester, you&#039;ll struggle towards the end. However, the groups are formed very early on in the semester when we don&#039;t know anyone, so it is still luck.",
      "rating_content": 3,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "cB792TdOrUrdJh5v16ihBWYhwp0iJvyr",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1722,
          "name": "STAMPER, Suzan",
          "rating": 0
        }
      ],
      "author": "ArrogantColonel",
      "date": "Feb 07, 2024",
      "title": "",
      "comment_content": "The only practical content taught is the APA stuff from the library session. All other knowledge taught is only applicable to the assignments set by the CLE. The lectures offer discussions so you can make friends, but the discussion topics are mostly extremely simple and often trivial.<br /><br />According to the instructor, this course should focus on teaching and not on proficiency. That&#039;s completely opposite with my experience. Nothing technical or practical was taught, everything is about practising english proficiency in countless assignments.",
      "comment_teaching": "Friendly. Doesn&#039;t teach anything non-trivial. <br /><br />Feedback for the 1st entry was given the night before the final deadline. No changes can be made in time as the work is already finished.",
      "comment_grading": "Throughout the course, my effort in assignments has a negative correlation to the grades I get. At the beginning I put so much effort refining my work, but I only got &#039;competent&#039; grades. I then decided to save my time for more important work, so I just finish everything for completion, but she gave me &#039;advanced/exceptional&#039; grades. <br /><br />Following her instructions will only get you the &#039;competent&#039; grading. She will never show you how an &#039;exceptional&#039; work looks like. You have to figure out how to make her appreciate your work to get the &#039;exceptional&#039; grading, but it is unpredictable for me.<br /><br />Assignment feedback did not include the reasons to why I only got some &#039;competent&#039; grades.",
      "comment_workload": "Comparable to a 5 credit honor course I took in the same semester.<br />Two times of my other 3 credit courses in the same semester.<br /><br />It puts a lot of pressure on your midterms and finals. The primary focus of the instructor is whether students can meet the course deadlines. They are expected to devote time into group assignemts even if it affects their exam preparation.",
      "rating_content": 1,
      "rating_teaching": 1,
      "rating_grading": 1,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "jdtaEDLFFiu8qxCUWKKDEkJ0tRdtNsru",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 332,
          "name": "LEE, Pui",
          "rating": 0
        }
      ],
      "author": "Isaac910",
      "date": "Feb 01, 2024",
      "title": "It is what it is",
      "comment_content": "It&#039;s quite easy, didn&#039;t learn much but good practice.",
      "comment_teaching": "Nice guy but homie doesn&#039;t teach no nth, I tried to ask him questions but honestly he&#039;s really not helpful.",
      "comment_grading": "he gives grades off from his impression so like good luck, he told me I&#039;m a high-level student but covered too many concepts to prove my point (which is what your supposed to do so bru idk).",
      "comment_workload": "Honestly its really easy as long as you allocate some time to it, the synthesis follows through to the presentation and then the poster so its honestly ok. Just start off well and you&#039;ll be ok.",
      "rating_content": 4,
      "rating_teaching": 2,
      "rating_grading": 2,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "Ihc9SQuIfr1egmSPrumpaYovGK8YgvIB",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 444,
          "name": "HOPKINS, Mark",
          "rating": 1
        }
      ],
      "author": "WikiTheKiwibird",
      "date": "Jan 31, 2024",
      "title": "It&#039; s a mandatory course for pre-enrollment, what is there to really say?",
      "comment_content": "Just like the majority of language courses:<br /><br />1. LANG1404 is unlikely to significantly improve your language skills. It&#039;s not that I expect to reach native-like fluency in English after a semester, but it&#039;s clear that the benefits of this course do not match the effort you put in.<br /><br />2. The material covered in the course doesn&#039;t contribute much to your assignments. To be fair, it&#039;s not that the course content is entirely irrelevant to the writing tasks, but the correspondence isn&#039;t as strict as it is in STEM courses. Most of the time, it feels like you&#039;re just participating in discussions during the course, and then you&#039;re left to figure out the writing on your own, despite the fact that attendance also factors into your grade.<br /><br />To give credit where it&#039;s due, I believe my biggest takeaway was related to citation and referencing formats which could be somewhat helpful in the future as I&#039;m in the humanities and social sciences and will need to write other essays. Overall, the content is just not totally bad.",
      "comment_teaching": "Mark is an excellent instructor, passionate about teaching and dutifully responsible towards his students. His English accent and intonation are particularly pleasing to the ear, and he possesses a quintessentially British sense of humor that emerges at just the right moments. Unfortunately, despite his efforts, the course did not become significantly more useful, which, as previously mentioned, is an issue with the course content itself.",
      "comment_grading": "I got a B-, I&#039;m not certain about the specific grading distribution or criteria, but it seems there&#039;s a common discourse (or rather, a harsh critique) that LANG courses are grade killers. Therefore, securing a B makes me feel &quot;not so bad&quot; about the outcome.",
      "comment_workload": "For a first-year student in their first semester, this course had the heaviest workload of my term, bar none. The effort you put into essays and presentations could be endless because you never really know how good is good enough. Fortunately, the topic I chose for my assignments was not assigned but suggested by myself. I&#039;ve always had my own research and views on this topic, which made the writing process less tedious and agonizing. Considering those who were forced to pick topics like &quot;health&quot; or &quot;environment,&quot; I feel quite fortunate. In conclusion, the most critical point remains the one previously mentioned—the return on my investment of time and effort did not feel commensurate.",
      "rating_content": 2,
      "rating_teaching": 2,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "Rx3TWb0KM1JQYBieYq1Zzt9U7NHoY229",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 444,
          "name": "HOPKINS, Mark",
          "rating": 1
        }
      ],
      "author": "jjj12",
      "date": "Jan 29, 2024",
      "title": "",
      "comment_content": "The content was useless and extremely boring. It was unclear how the content we learned linked to what our assessments were on, and the content itself is completely inapplicable anywhere else in our lives, so I&#039;m not sure why we are learning it. Even at the end of the course I am still unsure what an Annotated Bibliography is.",
      "comment_teaching": "Mark was alright. He tried to be funny and teach in an engaging and enthusiastic manner, which undoubtedly made the class more interesting, but his teaching style was unfortunately overshadowed by how boring and useless the content was. Also, I found his canvas difficult to navigate because things were in places they shouldn&#039;t be, or sometimes misnamed. He also would often neglect to tell us about deadlines until right before them, or forget to tell us important things and have to send a follow up email, and sometimes didn&#039;t explain the task well at first. Nevertheless, he is willing to help and I think he is a nice teacher.",
      "comment_grading": "Attendance isn&#039;t graded but LANG has subjective grading so you should show up to make the instructor like you. I don&#039;t think the instructor liked me much, but overall grading is fair. Choose good group mates at the start because you are stuck with them for the rest of the course.",
      "comment_workload": "I was lulled into a false sense of security at the beginning because there wasn&#039;t much homework, but then the assessments took hours each. Especially since there is a draft Annotated Bibliography and a real Annotated Bibliography, but the draft Annotated Bibliography does not count in the real one, so it was a waste of time. Also, coordinating with group mates was difficult, so you are increasing your workload massively by choosing bad group mates.",
      "rating_content": 2,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "lzSOZb9TZp6ibcyas37XHqRAFaZ9SpLM",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1716,
          "name": "KOYLU, Yilmaz",
          "rating": 1
        }
      ],
      "author": "hinscheung",
      "date": "Jan 29, 2024",
      "title": "",
      "comment_content": "Annotated Bibliography 15%<br />Synthesis Paper 10%<br />Seminar Presentation 20% (if possible, try to find all good teammates because all of you need to work together really hard to produce a cohesive piece of work)<br />E-magazine 30%<br />Self-reflection 10% (5% each, make sure to do it because it just gives you free full grade basically )<br />Few Self-directed Tasks (15% in total, also remember to do them to get free grade)",
      "comment_teaching": "His name is Yılmaz!!!! (remember there&#039;s no dot above the i)<br />I personally think he&#039;s quite chill and nice, and he explains things quite clearly so we don&#039;t miss out on any important deadlines and such. The class atmosphere is quite interactive, which makes it enjoyable and engaging. I guess if you engage in the discussions more or respond to his questions frequently, it gives you some impression points.",
      "comment_grading": "To be honest, I have no idea how the grading works in LANG courses. Perhaps different teachers might have slightly different grading standards as well. In my case, I got mostly &quot;Exceptional/Advanced&quot; and &quot;Exceptional&quot; grades for most assignments, resulting in a final grade of A. <br />(I&#039;m really curious if someone can get an A+ in this course haha)",
      "comment_workload": "I assume that all LANG courses have a heavy workload, so it is not surprising. As long as you have good time management skills and try not to leave everything until the last minute (or else he&#039;s gonna judge your quality of work), I think it should be fine. It can quite tough if the deadlines for these assignments crash with your tests or midterms, though.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "ideXVWAYuBYH6nY4KfjP1xxp4KMjwKKL",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "!@_@!",
      "date": "Jan 28, 2024",
      "title": "",
      "comment_content": "Assignment List:<br />1. Annotated Bibliography<br />2. synthesis paper<br />3. Seminar Presentation<br />4. E-magazine<br />5. SDL assignment<br />6. Self Reflection<br /><br />as a non-native english user, it&#039;s really tough for me to survive.",
      "comment_teaching": "Disucssions, sharing. Repeat and repeat the process throughout the whole semester. <br /><br />Little teaching, some readings.<br /><br />you will learn how to find those peer-reviewed and university-level articles.",
      "comment_grading": "Professor Sampson was not so generous at giving high marks (like full marks). Compared to other professors, he was quite harsh I think.<br /><br />Ironically we have group projects and i got same results as them in some assignments. Some of my groupmates ultimately got a straight A, and i got B. Saddd.",
      "comment_workload": "Quite heavy for me cuz i&#039;m not a native english user, like AB required to read 3 articles. Although there are word limits, it was very time-consuming to finish each assignment. The workload was the highest compared to my other courses. Particularly for the e-magazine, it was a group project. It was not only about writing a summary but also about graphics and overall layout.<br /><br />Don&#039;t be a deadline fighter",
      "rating_content": 3,
      "rating_teaching": 3,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "UAmwMj9INtaYSiUcoR1FDKRTTpejJQ80",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "FlyingPiglet",
      "date": "Jan 28, 2024",
      "title": "Avoid at all costs",
      "comment_content": "The content of the course does not benefit me in any way, shape or form. After a semester, I still don&#039;t know what the purpose of this course is!",
      "comment_teaching": "The instructor is nice and his lessons are interactive. However, this does not save the course from being poorly designed.",
      "comment_grading": "Grades are terrible. If you are taking this course, your probably are fluent in English. However, the grades does not reflect the fact that you are much more proficient in English then your peers. Additionally the grading system is unclear and I genuinely do not know how the grading works in this course (which is a first in my first semester)",
      "comment_workload": "The workload of this course is not bad on paper, but this ignores a simple fact -- I did not sign up for this! The workload of this course was the straw that broke the camel&#039;s back, and I am so grateful that I no longer have to deal with this course!",
      "rating_content": 1,
      "rating_teaching": 4,
      "rating_grading": 1,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "cHfG4wsxngWTaoqOMruAZYoN0Coj1sOa",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1323,
          "name": "LIAO, May",
          "rating": 1
        }
      ],
      "author": "KYChung",
      "date": "Jan 26, 2024",
      "title": "Stress1404",
      "comment_content": "Refer to others comments<br /><br />Assignment List:<br />1. AB<br />2. synthesis paper<br />3. Seminar Presentation<br />4. E-magazine<br />5. SDL assignment<br />6. Self Reflection",
      "comment_teaching": "May is a nice teacher, she would love to answer your question about the assignment. She also did provide some sample of past assignment for our reference. However, if you do not get any help from her when doing the assignment, you are going to end up with a mess.",
      "comment_grading": "I would say the grading depends on the instructor&#039;s taste, because you need to meet her expectation, so better consult her more to gain a better understanding of what you are going to do.",
      "comment_workload": "The workload is light right before the first assigment (AB), but after you start working on your first assignment, things getting stress and tension. Remember to choose a good topic for your research or you may regret starting when you are doing the AB.",
      "rating_content": 1,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "taC7HZZpc2iI2A5Kf66RhwQiyMpSiJCf",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 444,
          "name": "HOPKINS, Mark",
          "rating": 1
        }
      ],
      "author": "SpiritualTramp",
      "date": "Jan 23, 2024",
      "title": "Not that lame as you think perhaps",
      "comment_content": "So freaking dull. Learned almost nothing. Probably courses about citations are a little bit helpful, but they&#039;re the only useful things you might learn in this class. I just don&#039;t understand why we have to study this course if we all&#039;ve got a IELTS mark higher than 6.5 or sth. I don&#039;t think if you are pre enrolled in 1404 you would still need to learn so-called English for university studies. Comon we all are capable of communicate with others and understand lectures in uni. We don&#039;t need this.",
      "comment_teaching": "Mark is a great professor. He is kind and humorous, most of the times he&#039;s being supportive. The lectures are bored sometimes, but I don&#039;t think he is the one to blame.",
      "comment_grading": "Do think Mark gives fair grading. Got mostly ADVANCED, several EXCEPETIONALs for my work, eventually got A. Just do your work as suggested on CANVAS and do as your professor said, make changes according to his advice.",
      "comment_workload": "Don&#039;t have much to do normally, but when an assignment comes you really have to take hours working on it if you want a good score, and that&#039;s tiring. <br />Choose your teammate wisely!!!!!<br />If your teammates don&#039;t seem to understand much about the assignment requirements, you have to clean up their mess and make changes if you want to score high in your e-magazine as a group. Suffered several mental break downs during group work because my teammates sometimes don&#039;t appear in group meetings for discussing work, and they don&#039;t response to whatsapp messages quite actively.",
      "rating_content": 3,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "xEQGtK7ot94dSTIFkN0Jxlg00LLnwFTA",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "dumpling",
      "date": "Jan 23, 2024",
      "title": "Gwenchana…gwenchana…",
      "comment_content": "Look, I didn’t wanna be here. I was forced into this because I got a 5** in DSE, and did that help me in this fucking shitty course? NO! <br /><br />The content is (mostly) boring. It really doesn’t actually help your research, but some of the stuff on source checking does, so that’s the only goddamn upside of it. “University level”, but it’s actually out of touch as shit. <br /><br />You’re required to choose a topic of your choice with a theme (chosen with your classmates) for all the work bearing a score. My advice? Choose an interesting one. Don’t be like me and be forced into doing something like health. Go down kicking and screaming refusing, because otherwise your research is gonna be HELL. You’re essentially compiling your researched items into your own words 4 times, just in a different font.",
      "comment_teaching": "Depending on your teacher, it can be relatively interesting to dull as fuck. It’s not really the teacher’s fault the curriculum is boring though, and my teach was alright.",
      "comment_grading": "Yikes. let’s just say the workload put in and the grade at the end… not worth it. You’re putting in a ton of time just to end up with work that’s not that great and get like a B at most. The teach will grade to their own liking and you won’t even know what you did badly 💀",
      "comment_workload": "Oh boy. It should be illegal to spend so much time on a goddamn language course. A shit ton of work to do. Essays to write, not to mention the time it takes to compile research, bullshit something, fit the word limit etc. repeat at least 4 times. Don’t do stuff at last minute, kids. Don’t be like me. <br />Still, workload heavy for a language course. Very time consuming, but luckily had no exams.",
      "rating_content": 3,
      "rating_teaching": 3,
      "rating_grading": 3,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": false,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "KaDFOvl0ns40yhZJPPF1oLVGUWEzTjv8",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 635,
          "name": "LI, Edward Siu Leung",
          "rating": 1
        }
      ],
      "author": "S@@^",
      "date": "Jan 22, 2024",
      "title": "Ok if you did ib or english at that level",
      "comment_content": "The content is kinda weird cuz there&#039;s not really a syllabus or textbook, but as long as you stick to the rubric and follow it you should be fine. Did the IB and found the course quite easy. Wasn&#039;t too great at IB English (SL lang-lit), but the experience of writing the EE, IA&#039;s and hundreds of essays was very helpful.",
      "comment_teaching": "Edward is great. Gives good feedback (make sure to do everything he says/hints). Can ask him questions during class or at the end and he&#039;ll explain well. Just do whatever he says and he&#039;ll give you a good grade.",
      "comment_grading": "Heard it can be strict from other classes, but personally found it OK. Just make sure to follow whatever feedback you get, and try to ask as much during or at the end of class.",
      "comment_workload": "Workload is maybe a bit too much. Personally, l left most of the assignments till the day before, but could manage since I skipped classes on that day and finished them. Wouldn&#039;t recommend this tho lol.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "guuSQUSECUUT4icVsy4sOgRK5LYDkIls",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 411,
          "name": "MEGAN, Melissa Jane",
          "rating": 1
        }
      ],
      "author": "Thomas1242",
      "date": "Jan 22, 2024",
      "title": "Nice chill class",
      "comment_content": "Focus on APA style writing and how to conduct research. Not too difficult, but make sure to implement what you learn. Lots of group activities to train your communication skills. You can use chatgpt on assignments as long as you disclose it.",
      "comment_teaching": "Great teacher who is friendly and forgiving. Gives precise feedback on each assignment and time for us classmates to get to know each other.",
      "comment_grading": "Fair grading, I don&#039;t see anyone failing or getting bad grades as long as they finish everything on time.",
      "comment_workload": "Very doable, a breeze as long as you choose the right groupmates.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "gGx9MJrmBrvEr4Z20IGreCa9mzgmEUlc",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1716,
          "name": "KOYLU, Yilmaz",
          "rating": 1
        }
      ],
      "author": "TheThinker",
      "date": "Jan 22, 2024",
      "title": "Patient and friendly instructor (but you need to talk...a lot) Overall, a super enjoyable experience.",
      "comment_content": "Some might find the content too easy or even boring but they&#039;re necessary for university life, e.g. referencing, citations...knowing your audience, intentional eye contact...etc. It&#039;s useful stuff, not too difficult. If you were already REALLY good at English before going in (e.g. IELTS 8 or above) you&#039;re gonna find it easy.",
      "comment_teaching": "He is very engaging and interactive. Given that the classroom size is relatively small, you&#039;re gonna have to talk quite a bit. However, it never feels awkward or difficult to speak, even for an introverted person like me. Sometimes you gotta gather the courage and speak up. Everyone had to present, sometimes he asked students to read short passages aloud...if your spoken English is REALLY good, you&#039;re gonna enjoy the classes. Gotta pay close attention though.<br /><br />Also, ask for his advice whenever possible. If you can actually make good use of it, it shows that you&#039;re listening and (I think) it adds some &quot;impression points&quot;. &lt;- literally just my opinion",
      "comment_grading": "He is VERY objective when it comes to grading. If you do well, your grade will reflect that. He has reasonably high standards and if you want a good grade for your seminar, you basically need to deliver an absolutely immaculate performance, almost flawless. Practice with your group many, many times beforehand. Preferably, without looking at the flashcards too much. Thankfully, in my case, I think my group managed to do exactly that (it was a herculean effort) and everyone got a good grade. <br />-&gt; You need REALLY good teammates for this, everyone has to be very competent individually AND as a team. <br /><br />Annotated bibliography: 14.5/15<br />Synthesis paper: 10/10<br />Seminar presentation: Exceptional/Advanced - Exceptional - Exceptional<br />E-Magazine: (refer to attachment, the score was good)<br />(Close to best-case scenario lol)<br /><br />Final grade: A (I genuinely think A+ is a myth)",
      "comment_workload": "The workload is pretty light for a 3-credit course. Of course, the seminar presentation and E-magazine require substantial time investment but there aren&#039;t too many assignments. AB, synthesis, seminar and E-magazine, that&#039;s it. You actually do need to invest a ton of time into the seminar and e-magazine though, but trust me, it&#039;s worth every second of your time.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": [
        {
          "key": "wi4nHdqxw1h0VpRqUEJcmgxpBVo7s62n",
          "name": "e-mag",
          "format": "jpg"
        },
        {
          "key": "1NkvOPrCTa1VWnIRD68VzLocmpNfvuzy",
          "name": "seminar",
          "format": "jpg"
        }
      ]
    },
    {
      "hash": "ET5LLz515s8PBfpId7pmDUWjSW8F1bUa",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1716,
          "name": "KOYLU, Yilmaz",
          "rating": 1
        }
      ],
      "author": "CCla04",
      "date": "Jan 21, 2024",
      "title": "7/10 overall: -10/10 for the course itself + 17/10 for lecturer",
      "comment_content": "The content officially offered is not good, but the content that Yılmaz decided to give us is really good.<br />One of the main things I learnt in the course is prompt engineering on poe.com. Hail modern tech.",
      "comment_teaching": "This course itself is boring and annoying but Yılmaz, note that it <br />is not an i in the surname, makes lessons enjoyable.",
      "comment_grading": "I would say Yılmaz has quite a high standard but he states his requirements clearly. As long as you do what he told you to, you should be getting a decent grade. It is just that it takes too much effort to get a decent grade compared to other courses. I got an A, but it definitely took too much of my time which could have improved my other courses&#039; grades.",
      "comment_workload": "Too much work if you want to get a good grade but I guess it is a similar case for most lang courses.<br />When you are choosing a topic at the start of the semester, remember to choose a topic that you are actually interested in. It is painful enough even to work on a topic I like. Also, keep in mind that do not choose topics that are too new or too specific. You might not be able to find enough academic-level articles that match your need.",
      "rating_content": 3,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "n0aYiKmDXVvRrvuUh5uVVdfdhXbLZY4X",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "cklog",
      "date": "Jan 17, 2024",
      "title": "fun course though the workload is a bit high",
      "comment_content": "useful content, but some is kind of common sense. There were many in-class group activities.",
      "comment_teaching": "great teacher. friendly, fun, communicative and willing to help.",
      "comment_grading": "I got a B something, but in my opinion it is quite reasonable, there are some aspects where I could&#039;ve done more work in.",
      "comment_workload": "There were quizzes (not that many) but some were graded by submission. There is one final project which is a seminar presentation and e-magazine that you had to do with your groupmates (some classes get to pick their group themselves, some were picked by the teacher). There are other assignments other than the two main projects, but most of the assignments are preparation for the two main final projects.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "KQusmwBAa8AN4ljikUaWQImA5piExiBj",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 332,
          "name": "LEE, Pui",
          "rating": 0
        }
      ],
      "author": "K. Ng",
      "date": "Jan 15, 2024",
      "title": "IDK...",
      "comment_content": "Fundamental skills of academic writing - nothing challenging to strong students from local schools (same as other sections) - APA citation rules (very heavy emphasis on this), rhetorical planning wheel, synthesis matrix, etc.<br />Samples of assignments become available and are briefly discussed in class as the semester goes.",
      "comment_teaching": "L.P. seems disinterested in following the course leaders&#039; requirements and teaching this course in general. &#039;B&#039; is given instead of &#039;C&#039; because he does not disturb me in multi-tasking T_T<br />He should be avoided if you are serious about learning Academic English properly and rigorously.",
      "comment_grading": "15% Self-directed learning<br />15% Annotated bibliography<br />10% Synthesis Paper<br />20% Seminar Presentation<br />30% E-magazine<br />10% Self-reflections (2, 5%@)<br />Attendance is taken, yet it has no effect on the grade.<br /><br />In my view, L.P. hands out reasonable grades and the final letter grade is quite good. Yet, he takes too long to issue the feedback.<br />SDL 15/15<br />AB 13/15<br />S.P. 8/10<br />Seminar 13.4/20<br />E-magazine 24.7/30<br />Reflections ??/10 (I submitted one late)<br />Final letter grade: A",
      "comment_workload": "Much reading and writing to be done, especially towards the second half of the semester. This also depends on how lazy or hardworking your group mates are - choose group mates wisely.",
      "rating_content": 3,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "FHFI6V0MHu9rpN0LurqUsuB09fJaFLhZ",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 635,
          "name": "LI, Edward Siu Leung",
          "rating": 1
        }
      ],
      "author": "Llllllllll",
      "date": "Jan 10, 2024",
      "title": "",
      "comment_content": "To be honest, it is a course made for the APA citation. No more than that. BUT you can just self-study by searching on the internet or just going to UST library website.<br />So what&#039;s the point of this course (huh)<br /><br />btw you can see more reviews before 23-24 in CORE1404",
      "comment_teaching": "A++++++++++++++++<br />I mean, really, he is the best teacher ever. <br />Even if the course was stressful, he was my fav teacher this term. He is kind, jokes a lot and tries to interact with students a lot. Also, when we had questions and asked him via email, he replied to us precisely and kindly. <br /><br />The arrangement of this course is a bit confusing, but he explains it very clearly at the beginning of the course, so do not worry.",
      "comment_grading": "This course cannot offer you a good grade for everyone, but I think it is not really hard to get a B or more.<br />For all 1404, professors check the attendance, but officially, it is not part of the grading system.<br />However, I recommend you to attend every class since, unlike maths, there is no exact answer to the essays; it is better to be a good student to get good grades :)<br /><br />Edward has high expectations for all his students, so you may see some of your friends with other instructors getting higher grades for the assignments, even if the quality is much lower than yours.",
      "comment_workload": "ESCAPE TO LANG1403 as fast as you can in add and drop period<br />if I hadn&#039;t taken this course, my first semester would have been better.... enjoying uni life <br />For every assignment, from 2 days before the submission, you&#039;ll see people doing their assignments in other lectures, and you&#039;ll hear people suffering in the library :)<br /><br />AND GROUP WORK... you have to do many assignments as a team until the end of the semester",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "ceG9TeANs3lKpLQ2zcFPI15drAVVKuQi",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "Yunximeng",
      "date": "Jan 07, 2024",
      "title": "",
      "comment_content": "Fine. <br /><br />&quot;This course puts a strong emphasis on developing university-level academic literacy and communication competence in writing, speaking, and multimodal contexts.&quot; <br /><br />Do not expect it to be of any use (if it is designed as such), however. This is what I said in my presentation and apparently my Prof. agreed for he gave me full marks (he told me after I had finished my presentation).",
      "comment_teaching": "80% of the time it&#039;s just self-study and group work. Little teachings, some readings, and most of the time, chitchatting. <br /><br />Very chill, A.",
      "comment_grading": "I got an A overall. <br /><br />Four components constitute your final grade, whereof three are essential: the Annotated Bibliography (AB), the presentation of your chosen topic, and the e-magazine group project.<br /><br />AB: many of us received a fair grade-between competent and advanced. Just imitate an example and it&#039;ll be fine.<br /><br />Presentation: I think this makes a real difference. Most of my classmates are native speakers and so if you are diffident about speaking and presenting, this part would be a bit of a worry. <br /><br />E-magazine: Literally just copy everything from your presentation and make a magazine with your team. Nothing (well, precisely, little) is new, but it is a bit of a tribulation if you want to create it for aesthetic purposes. <br /><br />The reason I do not give an A is simply because Prof. Nicholas does not release grades (except for AB), so throughout the course you barely know if you have messed up. Still, the marking is fine. <br /><br />I would say that if you have an ok English ability and confidence, then you can expect an easy B or above.",
      "comment_workload": "Fair.<br /><br />About a thousand and few hundreds words for AB. 10 ish slides for PPT, and a magazine of 5 ish pages per person.&nbsp;&nbsp;<br /><br />It does take you some time, so B.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "2GNATXJTW1BigsqFEMvfNmtNrTj0bSFZ",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "lay flat",
      "date": "Jan 06, 2024",
      "title": "Fierce competition",
      "comment_content": "The professor stressed that the course was about academic literacy but not English proficiency. I learnt about multimodality, lateral reading skills and APA citation. I first learned how to find university-level articles and peer-reviewed journals.",
      "comment_teaching": "The professor was very nice. He was willing to answer students&#039; questions. In addition, he often ended the lesson early (usually lasting for 1 hour only). He gave us lots of time for discussion. The learning atmosphere is relaxing. Even though he seldom explained the ideas in detail, he always read the ppt directly which was easy to follow.<br /><br />He would send some photos of his cat and music sharing on Friday. Overall his teaching was so-so but he was a benign person. I hope he can be more generous at giving comments with substance but not very vague words (e.g. you need to evaluate the sources--&gt; so how?).",
      "comment_grading": "Annotated Bibliography (AB) (9.5%/15%)<br />Synthesis paper (?%/ 10%)<br />Seminar presentation (17%/ 20%)<br />E-magazine (?%/ 30%)<br />Self-reflection (?%/ 10%)<br />Self-directed learning (15%/ 15%)<br /><br />My friends from other sections (other professors) got very high marks (almost full marks) in each assignment. Everyone in this course is presumed to be a native speaker. The competition was very fierce.<br /><br />Professor Sampson was not so generous at giving high marks (like full marks). Compared to other professors, he was quite harsh I think. If you are enrolled in this course under this professor, remember EVALUATION is critical in the first assignment AB. My mark was almost the lowest because I did not evaluate the authority of the source. Overall I still got a B finally but not a C-range. It was acceptable. I hope the grading can be more transparent as other sections had a platform to check marks but mine did not.",
      "comment_workload": "Very busy. AB required me to read 3 articles (20 pages to 100+ pages). Although there are word limits, it was time-consuming to finish each assignment. The workload was the highest compared to my other courses. Particularly for the e-magazine, it was a group project. It was not only about writing a summary but also about graphics and overall layout. <br /><br />Don&#039;t be a deadline fighter. Despite the emergence of AI, you have to paraphrase each sentence because he would use some AI detectors. Don&#039;t rely on ChatGPT too heavily.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "724HKDsdvAATB7UdAEOuMRxDhhKvv6t0",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 466,
          "name": "ENGLAND, Graham James Fisher",
          "rating": 1
        }
      ],
      "author": "wsxrfvyhnikp",
      "date": "Jan 05, 2024",
      "title": "nasty course, nice instructor",
      "comment_content": "This course puts a strong emphasis on developing university-level academic literacy and communication competence in writing, speaking, and multimodal contexts. The course introduces students to research skills using university library resources for finding and evaluating sources for academic writing and speaking tasks. It expects students to be critical readers and writers, synthesizing ideas when developing a coherent argument. The course also aims to develop students’ competence in communicating effectively in an academic community, developing the ability to collaborate both as a member of a group and assuming responsibility as a discussion facilitator.",
      "comment_teaching": "Graham is very nice and willing to answer your questions regarding your research. His classes are interactive and quite chill.",
      "comment_grading": "For Graham’s classes, I think getting mostly competent/advanced yields a B. If he gives you several exceptionals and exceptional/advanced, you will get A-range.",
      "comment_workload": "Workload is large compared to other courses. Try to start at least three days before the deadline.<br /><br />CLE: “At HKUST, a 3-credit course usually has 3 instructional hours per week with an additional 2 hours per week of self-study activities for each instructional hour. For LANG 1404, which has 3 credits, you should then expect to spend 3 hours in class and another 6 hours of self-study. This self-study will include preparation for lessons, library research, online self-directed learning, writing, revising, seminars, and group e-magazine. Plan ahead as much as possible to balance your workload over the semester.”",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "VOtnl6KhkQgmo5pTh7v5ITMUwYwgG0tS",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1722,
          "name": "STAMPER, Suzan",
          "rating": 1
        }
      ],
      "author": "justkidding",
      "date": "Jan 05, 2024",
      "title": "a mess but i survived",
      "comment_content": "To be honest there wasn&#039;t much to learn in this course, you can see the syllabus I attached to know more.<br />The main things I learned were:<br />- how to use chatgpt <br />- how to use canva ai to generate art for the magazine<br />- some apa stuff<br />- and that&#039;s about it",
      "comment_teaching": "Suzan was nice but I didn&#039;t learn much from the lessons, only that she has preferences and opinions on the assignments so you should really listen and implement what she wants in your work.<br />Such as including word count, writing your name in each of the documents you submit, taking her advice on the direction of your topic and run with it I guess.",
      "comment_grading": "So as a dse student with no background in academic writing (unlike those IB gods in my class), I somehow managed to get an A and I&#039;ll tell you what I did. <br /><br />It&#039;s unclear how she marks or grades, coz the marking criteria is kinda vague, but she does give comments on your assignments, so make sure you take her advice and implement it in your work. <br /><br />I think making a good impression is also important, although I am introverted and often quiet in class, I tried to say relevant stuff during discussions (especially when she was around to hear us discuss). <br /><br />You basically pick a topic and stick with it for the whole course, the topic I chose was a bit boring tbh, but I tried hard to gaslight everyone to make seem interesting, like rather than talking about the technical stuff, I focused more on the social side of stuff so more debates can be made when discussing (this is an English class after all). Also during your seminar, make sure to be interactive with the audience, you can really stand out when you&#039;re not just trying to speedrun and read the whole powerpoint.<br /><br />REMEMBER to cite everything in APA and do it right, coz I got some of the formatting wrong with the italics and that prolly docked some marks off.<br /><br />I can&#039;t find my grades coz it got archived, but from what I can recall, I got most at &#039;advanced&#039;, 1 or 2 &#039;competent&#039;, a few &#039;competent/advanced&#039; and a few more at &#039;advanced/exceptional&#039;. Just try ur best to survive this and move on with ur life after it&#039;s done.",
      "comment_workload": "Workload is ok, I pretty much did everything kind of last minute so don&#039;t be like me. Make sure you give at least 2 days to do each assignment.<br /><br />I was lucky to have good groupmates who were all chill and friendly. Having good people in your group is important since I&#039;m not that talkative and seldom raise questions in class, having someone in your group to do that is great. <br /><br />Also, you will learn the importance of chatgpt. I used it a lot doing the synthesis, you can give it a research article and ask it to give you the main takeaways from it. I used canva to make my e-magazine, a tip here is to use canva ai to generate pictures for u, u can make really specific pics that fits the scenario ur talking about.",
      "rating_content": 3,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": [
        {
          "key": "jSDzBpuR7AFgGmXLpBfuJrdQnLNpCWqR",
          "name": "Overview of course and assessments",
          "format": "pdf"
        }
      ]
    },
    {
      "hash": "oDIqLZyVnfHhEeFKIZPEnOItqSmyWHhD",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 635,
          "name": "LI, Edward Siu Leung",
          "rating": 1
        }
      ],
      "author": "hihahiha",
      "date": "Jan 05, 2024",
      "title": "Difficult to get a good grade but managable. High workload!",
      "comment_content": "The content of the course is fairly easy but very time-consuming. Through out the course, you need to work on multiple individual tasks, and subtly as a group during the first half. However, for the final project that is an e-magazine, you need to work cohesively as a group. <br /><br />The coursework involves:<br />Annotated Bibliography (15%) - individual<br />Synthesis Paper (10%) - individual<br />Seminar Presentation(20%) - group<br />e-magazine (30%) - group<br />Self-reflection milestones (10%) - individual<br />Self-directed learning (15%) - individual",
      "comment_teaching": "The teaching experience was really good for me. Prof Edward is an amazing teacher who makes the classes very interactive and engaging. He is ready to give constructive feedback and patiently discusses and evaluates your ideas and opinions.",
      "comment_grading": "My grading :<br />Annotated Bibliography - 14.5%<br />Synthesis Paper (10%) - 9%<br />Seminar Presentation(20%) - 13.5%<br />e-magazine (30%) - wasn&#039;t notified<br />Self-reflection milestones (10%) - given on submission and not based on quality, but fair share for relativity and connectivity<br />Self-directed learning (15%) - given on submission and not based on quality, but fair share for relativity and connectivity<br /><br />Overall letter grade - A<br />Grading is absolute",
      "comment_workload": "High.<br />Even though the projects to complete are less, the workload is high because the quality of writing is deeply assessed. So, correcting every single grammatical error and every single detail is important to consider in order to get a high grade.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "HnBJsBpLZXeoyhP7garvtGyYuxIUzEBv",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1323,
          "name": "LIAO, May",
          "rating": 1
        }
      ],
      "author": "Publicity",
      "date": "Jan 04, 2024",
      "title": "How To Get Full Marks in LANG1404",
      "comment_content": "Before I begin, I would like to say that I got full marks and hence A+ for this course. However, I don&#039;t think the course is carefully constructed for the students.<br /><br />The first lessons are crucial. As plain as the &quot;rhetoric planning wheel&quot; may sound, it formulates the basic dimensions that your essay plan should cover. Once you grasp the structure, then researching for information should be your next step. Read a lot and take notes (with a notepad next to you), dropping down important insights that can be used in your &quot;essay&quot;. This is unfortunately taught too late in the course.",
      "comment_teaching": "The teacher doesn&#039;t actually do much teaching. In fact, I don&#039;t think that what is covered in the lecture is sufficient to prepare the students for the assignments. Make sure you come to class with a basic knowledge of how to write. You can practice this by constructing &quot;arguments&quot;, something you can do in your free time (for example during this winter break).<br /><br />Since language classes are small, you have the opportunity to ask the professor for help. This is the best advantage you have against the subjective and harsh grading of language courses. “Ask and it will be given to you; seek and you will find; knock and the door will be opened to you.&quot;",
      "comment_grading": "Language courses have the most subjective grading out of all other courses. Mathematic equations all have an objective answer but that is not the case for language courses. However, one principle prevails: a strong root for a blossoming tree. Make sure your structure is good before you start writing. This makes planning of utmost import.<br /><br />Do your work. The course gives out free points if you join a library session that you can put on mute.<br /><br />The annotated bibliography (15%) is not harshly graded as it is the student&#039;s first assignment. However, it is very important.<br /><br />Learn to present. The content you present isn&#039;t the main point, you only need to deliver an &quot;idea&quot; or a &quot;vision&quot; to the audience, without getting into details that are immediately obvious. Be original and be uniquely insightful, it will score you a high grade in those parts in the seminar presentation (20%) and e-magazine (30%)",
      "comment_workload": "Most students will take this course during their first year, in the fall or spring semester. This usually implies that the students&#039; overall workload is relatively light compared to other years. As such, it is recommended to put some time into this subject to practice iterative writing. <br /><br />Iterative writing is simply &quot;rewriting&quot; and &quot;synthesising&quot; your writing through drafts and reorganisation. Your first draft will likely be unsatisfactory. If you are ambitious and want something close to an A, I would recommend going through your draft, breaking up the sentences, then sorting them into &quot;points&quot; that can be &quot;rearranged&quot; for a coherent structure. Then combine redundant points to pick out the chaff. <br /><br />How then should the student apply this knowledge to his assignments? By the nature of the strategy, the synthesis paper becomes trivial. However, I believe the annotated bibliography is hardest assignment for someone without any research background. This is because the &quot;first draft&quot; becomes the &quot;initial research&quot;, a process that the student has to learn by himself. This is especially dangerous for the students who want an A+ as it is the first assignment and is weighted 15%. It is also the cornerstone of all the other assignments.<br /><br />Simply reiterate this process to complete the other assignments.",
      "rating_content": 5,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 5,
      "vote_count": 5,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "sjc7j2FgZbeNRyQvUpcQjCuaBbd4y1Yw",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "InX",
      "date": "Jan 04, 2024",
      "title": "Work hard and good luck!",
      "comment_content": "Really learnt a lot in this course. I have to admit that the things taught are useful in academic English. There are also lots of opportunities for you to speak up and it really helped me improve my spoken English.",
      "comment_teaching": "I don’t know whether it’s due to the instructor or my own reasons but the atmosphere in class is very intensive. Every class is stressful as you have to be highly concentrated and prepared to answer questions anytime.",
      "comment_grading": "From my perspective the grading is highly related to how much time you have invested in. It also depends on your classmates and your impression on the instructor.<br />Picking a topic that your instructor like is helpful. <br />I got an A as final grade:<br />Annotated Bibliography(15%): 12.5/15<br />Synthesis paper(10%): 9/10<br />Seminar presentation(20%): 13.5/15<br />E-magazine(20%+10%): 12.5/15+8.5/10<br />Other completion tasks are 100% completed.",
      "comment_workload": "Huge workload. The tasks are not so easy to complete. Be careful on the first assignment: annotated bibliography. Choose good articles that have provoking views and are related to each other as you have to synthesize them in your synthesis paper and develop your own vision on the topic.",
      "rating_content": 4,
      "rating_teaching": 3,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "9u6JJbzVE0poA6cAr5qAG1YZIhkCABCq",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1231,
          "name": "SAMPSON, Nicholas",
          "rating": 1
        }
      ],
      "author": "DwayneJohnson",
      "date": "Jan 03, 2024",
      "title": "",
      "comment_content": "Don&#039;t worry about it, it&#039;s not important.",
      "comment_teaching": "In the few lessons that I went, Nicholas seemed to teach quite well. Also, in weekends he email us and share about his discs collections and musics recommendation, and sometimes photos of his cat. So he is quite warm, and sometimes I feel a little bit bad for skipping so many classes.",
      "comment_grading": "The grading is alright. I continuously 0尊 him by skipping so many lessons and somehow still got B+. Not sure about the cutoff though. He also didn&#039;t write comments on most of my assignments so even after the course ended I still don&#039;t know wtf I did. Overall, the grading is quite mysterious.",
      "comment_workload": "There are 3 major assignments to do in this course: Annotated Bibiliography (AB), Powerpoint presentation, and e magazine. <br /><br />For the AB, it was quite kick for me initially because I didn&#039;t know the format well in the beginning. However the format is really not as complicated as I thought it would be; Choosing 3 good reference and keep milking it for the projects to come will save a lot of effort down the road. This project is quite bullshit because I really have to find my own source--I heard gpt will make stuff up.<br /><br />For the powerpoint presentation, starting early will make the workload a little bit more bearable. Overall, the powerpoint is just rephrasing what you did in AB to your peers. Ofcourse, making it look aesthatically pleasing is another major workload.<br /><br />Now this e-magazine is really bullshit. It is submitted right after the powerpoint presentation. And you gotta worry about making it actually looking like a magazine, like the design and stuff. This one is really torture.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "WXkvdfATFhZi2THrRqM9S0y8n9tp5LPh",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1716,
          "name": "KOYLU, Yilmaz",
          "rating": 1
        }
      ],
      "author": "Cyan Feather",
      "date": "Jan 03, 2024",
      "title": "神仙打架",
      "comment_content": "As a non-native speaker, I learned new things in every class. However, I think there&#039;s little chance for me to use it in the future. Actually, I often find the content our instructor added more useful.<br /><br />All the graded content is listed in the grading part.",
      "comment_teaching": "I LOVE Yılmaz!!!!!!!<br /><br />I think Yılmaz is the best instructor (or at least one of the best ones) in this course! He is humorous and chill, and he always explains things very clearly to make sure we all understand them. He is enthusiastic and makes the atmosphere of the class quite great. Advice from him is also very helpful. Moreover, he tries his best to make the class a community. He often shares his stories with us and he is more like a friend instead of a teacher. I really think he has turned this course from hell to paradise.",
      "comment_grading": "Not good. Although Yılmaz is not strict at grading and the grading within my class is fair, the A range of the whole course is very small, especially when you are competing with native speakers. I often feel that the grade is not proportional to the effort in this course and it&#039;s not worthwhile to spend so much time on it.<br /><br /># grading policy #<br />Annotated bibliography 15%<br />Synthesis paper 10%<br />Seminar presentation 20%<br />E-magazine 30%<br />Self-reflection 10% (5% x 2)<br />Self-directed tasks 15% in total<br /><br /># my grade for your reference #<br />Annotated bibliography 15%<br />-Exceptional/Advanced<br />-Exceptional<br />-Exceptional/Advanced<br />Synthesis paper 10%<br />-Advanced<br />-Advanced<br />Seminar presentation 20%<br />-Exceptional/Advanced<br />-Exceptional/Advanced<br />-Advanced<br />E-magazine 30%<br />-Advanced<br />-Advanced<br />-Exceptional/Advanced<br />-Advanced<br />-Advanced<br />Self-reflection: full<br />Self-directed tasks: full<br /><br />Letter grade: A-<br /><br />Grading can be very different if instructor is different. I think Yılmaz gives good grades and I got this grade because I’m lucky.",
      "comment_workload": "Really heavy workload. I would describe it as &quot;deadlines follow deadlines&quot;. It can be extremely disastrous when a deadline crashes with midterms and the homework of other courses. I usually spend a lot of time on assignments. The time I spent on this course is almost the same as the sum of time I spent on the other 4 courses I took this semester. Maybe a main reason is that I&#039;m not good at English.",
      "rating_content": 4,
      "rating_teaching": 5,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "pZpA18i0QQ8vvMdxoIAZNnqxJiQ4uSfn",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 444,
          "name": "HOPKINS, Mark",
          "rating": 1
        }
      ],
      "author": "Fantastickazakh",
      "date": "Jan 02, 2024",
      "title": "CONVINCE your prof that your topic is the most interesting thing in the whole world.",
      "comment_content": "1. Annotated Bibliography (Individual) (Hard one)<br />2. Student-led Seminar (Individual) (Average)<br />3. Project - Multi-modal Electronic Magazine (Individual and group) (Below Average)<br />4. Reflection (Individual)(Easy points)",
      "comment_teaching": "Professor Mark is a knowledgeable and kind person with an interesting personality and curiosity towards every student. His grading system is average compared to other profs, but I believe it&#039;s based on his impression of you(don&#039;t be late and don&#039;t skip lessons without notice, try to have good attendance).",
      "comment_grading": "Grades:<br />Annotated Bibliography 9.5%/15%<br />Seminar 23/30%<br />E-Magazine 26/30%<br />Self Directed Experience 15%/15%<br />Self-Reflection 10%/10%<br /><br />Final letter grade A- <br /><br />Ig that my grade is good since grading is between 21 students, but I believe that grading is harsh",
      "comment_workload": "If you find an easy and good topic then the workload will be easy just find credible 3-6 sources and work on it till the end of the semester. You will have to write, analyze, summarise, critique, discuss, and reflect on it a lot. But the most important is to CONVINCE your prof that your topic is the most interesting thing in the whole world.",
      "rating_content": 2,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": true,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "ZnYzzKOqPy9rIiRDECdXZlaenUY9InHc",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 332,
          "name": "LEE, Pui",
          "rating": 0
        }
      ],
      "author": "_ahin_",
      "date": "Jan 02, 2024",
      "title": "This is a required course (Unfortunately)",
      "comment_content": "This course puts a strong emphasis on developing university-level academic literacy and communication competence in writing, speaking, and multimodal contexts.<br />Classes are interactive. Students are expected to be active and engaged learners and participants.",
      "comment_teaching": "Lecturers support your learning process through feedback. This can be feedback on your learning process to check understanding in class, feedback in 1-1 and small group consultations, feedback on your practice, and feedback on your assessments. You are expected to ask questions, seek advice, both in class and in consultations, and act on feedback. <br />However, I feel like my Prof. was not very interested in teaching this course, and since your grade is heavily dependent on a kind instructor, stay away from him lol. He is not at all generous with marking :/ and gives feedback too late !",
      "comment_grading": "Let&#039;s be clear: IT IS HEAVILY INFLUENCED BY THE TYPE OF PROF YOU GET (and how much your prof likes you)<br /><br />I got 8.0 in IELTS, and I am pretty much a native speaker. I imagine it will be hard for students who are not fluent/ not confident in their English speaking ability. In the end, I got an A grade. (Don&#039;t know a single person who got A+).<br />They take attendance in each class (whether it impacts your grade was not specified, i missed a class and still got A so...)<br /><br />There are no exams, you will have assignments that you have to submit, almost weekly. These are written works, using APA formatting. Quite time consuming (Spent more time on these than some of my Engineering courses). There are also two group presentations (Seminar and E-magazine), you have to prepare well and speak fluently, (No pronunciation errors, understandable accent, etc.)<br /><br />Heavy workload, DO NOT procrastinate on assignments and get your friends to proofread for a good grade.",
      "comment_workload": "This course has 3 credits, you should then expect to spend 3 hours in class and another 6 hours of self-study. This self-study will include preparation for lessons, library research, online self-directed learning, writing, revising, seminars, and group e-magazine. Plan ahead as much as possible to balance your workload over the semester.",
      "rating_content": 4,
      "rating_teaching": 4,
      "rating_grading": 4,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 3,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "a8FihyWNBkPzI4rnXlbPk5UnEpT0QP9v",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 635,
          "name": "LI, Edward Siu Leung",
          "rating": 1
        }
      ],
      "author": "Momore",
      "date": "Jan 02, 2024",
      "title": "wcsndm我阐述你的梦",
      "comment_content": "In the first few weeks, you need to choose a topic and join a group, and then you finish the tasks based on your sub-topics.<br />The assignments teach you the steps of doing basic research and writing academic papers. I don&#039;t think they are as useless as others might think, but the course may be very challenging for students who simply get good marks in IELTS and do not have academic writing experience. <br />To be honest, the classes are kind of useless...You still don&#039;t know how to finish the assignments after class and have to figure them out on your own...",
      "comment_teaching": "I LIKE EDWARD!!!<br />Edward is a kind and helpful teacher. He gives very detailed feedback on your performance, and he&#039;s always ready to answer your questions. I can tell that he really likes his students and enjoys teaching.<br />More importantly, Edward gives very good grades (compared to... you know)! So you won&#039;t need to worry that much about your grade if you are enrolled in his class :)",
      "comment_grading": "BAD<br />Most students taking this class are hard-working and are already proficient in English, I think most of them deserve an A&#039;s. However, the results are far below this level. Also, your grades depend heavily on your instructor. Some instructors give really good marks, while some give very low marks. So stay away from some notorious teachers like Suzan or Megan!!! Besides, I think the instructor&#039;s impression matters a lot since sometimes native speakers even get lower marks. Anyway, remember to be active in classes!",
      "comment_workload": "E stands for EXCEPTIONAL!<br />It should be a 5-cre course. But concerning you&#039;re likely to get low grades, I think 3-cre is acceptable as well.<br />I don&#039;t know which genius designed this course. Dear Sir or Madam, I am studying in the School of Engineering, not the Department of English. HOW DARE YOU force me to spend much more time on this ** course than other engineering courses???<br />CLE, wcsndm 我阐述你的梦😀",
      "rating_content": 3,
      "rating_teaching": 5,
      "rating_grading": 3,
      "rating_workload": 2,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "u74Sb9iC79Qrx5DGehoT1iBAEo5jHhOR",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "saygex",
      "date": "Jan 02, 2024",
      "title": "DO NOT TAKE THIS! Try to change it to 1403 during the Add drop period",
      "comment_content": "This is a typical university-level English course, it&#039;s all about honing the fine art of source-hunting and squeezing your thoughts into the APA format (because apparently, everyone else is still stuck on MLA). Now, the content? Superficial, to say the least. We&#039;re just breezing through checkboxes each week as the syllabus does its quick-change act, leaving no room for genuine critical thinking or digesting the material.<br /><br />Rhetorical devices? They&#039;re kind of crucial, but they get a mere nod. It&#039;s like, really? We&#039;re barely scratching the surface when these things are the backbone of effective communication. Let&#039;s move past the surface-level charade and actually dive into the good stuff, okay? I signed up for an English class, not a weekly checklist marathon.",
      "comment_teaching": "The instruction was a complete mess. They attempted to incorporate this half-baked &quot;multimodality&quot; concept, making it challenging to grasp the content with the modes shifting every week. The class dynamics were cringe-worthy, with awkward group interactions adding to the chaos. The class composition itself was a disaster; some folks resorted to using Google Translate to bridge the language gap(ILETS), and the IB fukbois literally had already written a 4000-word academic paper and also had a mini-seminar in their high school. The whole group discussion things were just awkward moments of not being able to communicate properly.",
      "comment_grading": "Your grade is kind of tied to the luck of the draw with your instructor. If you end up with Gary, it&#039;s crucial to make a good first impression, it can seriously impact how he grades you down the line (trust me, you don&#039;t want to be in his bad books).",
      "comment_workload": "The workload was not that bad, as people complained. Just use ChatGPT. LOL",
      "rating_content": 2,
      "rating_teaching": 2,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": true,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "qrUCrYfr4ZBNUGrDxBJyaDxADqAVu6kA",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 444,
          "name": "HOPKINS, Mark",
          "rating": 1
        }
      ],
      "author": "Sponge",
      "date": "Dec 16, 2023",
      "title": "",
      "comment_content": "Absolutely useless content. You&#039;re taught multimodality, which isn&#039;t useful until the last assignment (Emagazine) and you can&#039;t realisitcally apply it. They don&#039;t really explain what &#039;synthesis&#039; really means when it&#039;s one of the most important grading criteria and I think the whole focus of the course. Also has other useless content that I have already forgotten, and you should too if you took this course, and forget them if you will take this course.",
      "comment_teaching": "Mark is a lovely and warm guy. His lessons could get dull sometimes but he&#039;s just very nice in general. He&#039;s also willing to put in some additional ideas for your topic of choice on the seminar (which will also be your emagazine if you do it properly).",
      "comment_grading": "Annotated Bibliography - 15%<br />Synthesis Paper - 10%<br />Seminar Presentation - 20%<br />Emagazine - 30%<br />2 self reflections - 5% each<br />Other miscellaneous tasks - 15%<br /><br />Attendance is not graded, but they will keep a record of it in Canvas. The course is basically just impression-based marking, so I would encourage you to attend all the lessons.",
      "comment_workload": "Could vary depending on your topic and your Annotated Bibliography (AB). If you found your papers properly, you should just need to spend a lot of time on your first piece of assignment (AB) for reading and synthesizing the sources you found. Do jot notes for your different sources so you can quickly find where stuff are to refer back when doing your seminar. You should also plan what you&#039;re going to talk about in your seminar when you do your AB to minimize your workload. You could just copy most of the stuff from your seminar to your emagazine, they don&#039;t really care.",
      "rating_content": 1,
      "rating_teaching": 5,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 0,
      "vote_count": 1,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "PINFvbBCoR1lbRmqS1ryWeXghjCWFJzc",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "Kortenka",
      "date": "Dec 16, 2023",
      "title": "Just do all assignments and you will get B range",
      "comment_content": "In my opinion, there is nothing except assignments. There is some content about different things, but honestly nothing really important.<br />During the semester you will have to choose 1 topic for the WHOLE semester and complete assignments about this topic. <br />I recommend you to find 5-6 good sources at the begining of the semester and base all your assignments on these sources (just do the research on time so that you don&#039;t end up having no idea what to write about the topic the night before the deadline)<br />Even though you will work in groups there is no actual group work for your assignments except a little for seminar and e-magazine.",
      "comment_teaching": "Most professors are nice and approachable.",
      "comment_grading": "You will have 4 important assignments.<br />1) Annotated bibliography (15%)<br />2) Synthesis paper (10%)<br />3) Seminar presentation (20%)<br />4) e-Magazine (30%)<br />You will also have two self-reflections (5% each) and self-directed learning tasks (15% in total), but those are pass or fail, so just don&#039;t skip them and you will get free marks<br />Only e-Magazine has group grades<br />Honestly every grade you receive is just how much professor liked your work.<br />Regarding the letter grade nobody knows (even professors). It seems only 1-2 people in the class can get A range (out of ~20) people.<br />For the rest, just do the work as good as you can and you will probably get B+",
      "comment_workload": "If you make valid research about your topic in the begining of the semester it will be pretty light. Otherwise, tryhard all your assignments.",
      "rating_content": 2,
      "rating_teaching": 4,
      "rating_grading": 3,
      "rating_workload": 4,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": false,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 2,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "gL8NveTu3qgEM1my8DycbDnSRVd8NAU2",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 1323,
          "name": "LIAO, May",
          "rating": 1
        }
      ],
      "author": "KoreanNumber1",
      "date": "Dec 14, 2023",
      "title": "",
      "comment_content": "- (Supposedly) teaches English skills needed for university<br />- There is nothing substantial you can actually gain from this course<br />- Does not check attendance",
      "comment_teaching": "- LIAO, May is an engaging instructor<br />- Uses PowerPoint slides along with pdf notes<br />- No textbook<br />- Lecture videos are not provided<br />- There is no active &#039;teaching&#039; going on, as this is a skill-based course",
      "comment_grading": "Annotated bibliography (15%), Synthesis paper (10%), Seminar presentation (20%), e-Magazine (30%), two self-reflections (5% each), Self-directed learning tasks (15%)<br />- The grade for each assignment is based on 5-point grading system<br />- Self-reflections and self-directed learning tasks are basically P/F<br />- Only e-Magazine has group grades",
      "comment_workload": "- You choose a theme along with a group at the start of the course and stick with it for the rest of the course<br />- You use that theme for all assignments, so be wise when choosing it<br />- Since there is no exam, workload is heavy",
      "rating_content": 1,
      "rating_teaching": 3,
      "rating_grading": 5,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 2,
      "vote_count": 3,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "O0oQ25rWfnaCsfrn3Q6MtGOdBpJgBVQ4",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "ben dover",
      "date": "Dec 01, 2023",
      "title": "пиздец",
      "comment_content": "Нифига не контента и дохуя пиздежа",
      "comment_teaching": "Фидбэк дают слишком поздно",
      "comment_grading": "Хз С охвачу",
      "comment_workload": "Дохуя работы из-за который приходилось сидеть до 5",
      "rating_content": 3,
      "rating_teaching": 3,
      "rating_grading": 3,
      "rating_workload": 3,
      "has_midterm": false,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 1,
      "vote_count": 9,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "aLmr3jjlCk4oSXX3s85XtJhzNQLVeIGL",
      "semester": "2022-23 Fall",
      "instructors": [],
      "author": "vo-42",
      "date": "Nov 22, 2023",
      "title": "",
      "comment_content": "I recently had the unfortunate experience of enrolling in the Lang 1404 course, and I must say that it was nothing short of a horrendous disaster. This course, if you can even call it that, left me questioning my life choices and the value of education itself.<br /><br />Let&#039;s start with the content, or lack thereof. Lang 1404 promised to provide a comprehensive understanding of linguistics, but it failed miserably in delivering on that promise. The course material was poorly organized, fragmented, and lacked any coherent structure. It felt like a disorienting maze with no clear path to follow.<br /><br />The instructors, or should I say, the so-called instructors, seemed to have no clue about the subject matter they were supposed to teach. Their explanations were convoluted, filled with jargon, and often left me more confused than before. It felt like they were reading from a script without any real understanding of what they were saying.<br /><br />Furthermore, the assignments and assessments were a complete joke. They were vague, poorly designed, and did not align with the course material. It seemed like the instructors themselves didn&#039;t know what they were looking for in terms of student performance. It was as if they were making up the grading criteria on the spot, leading to inconsistent and unfair evaluations.<br /><br />To make matters worse, the course lacked any interactive elements or engaging activities. It was a monotonous stream of dry lectures and outdated readings. There were no opportunities for meaningful discussions or practical application of the concepts learned. It felt like a one-sided conversation where the instructors simply dumped information on us without any consideration for student engagement.<br /><br />The course materials, including the textbooks and supplementary readings, were outdated and poorly curated. It was evident that no effort was made to incorporate the latest research or advancements in the field of linguistics. As a result, the content felt stale and disconnected from the real-world applications of linguistics.<br /><br />Finally, the overall organization and administration of the course were abysmal. Important announcements were often overlooked or buried in a sea of irrelevant information. The course website was poorly designed and difficult to navigate, adding unnecessary frustration to an already disappointing learning experience.<br /><br />In conclusion, Lang 1404 was a complete disaster from start to finish. The course content was poorly structured, the instructors lacked competence, the assignments were nonsensical, and the overall organization was a mess. I would strongly advise anyone considering this course to look elsewhere for a more fulfilling and enriching linguistic education.",
      "comment_teaching": "Lang 1404, oh where do I begin? This course deserves a special place in the annals of teaching incompetence. If you&#039;re looking for a prime example of how not to teach, look no further than the instructors of Lang 1404.<br /><br />First and foremost, it was abundantly clear that the instructors had no passion for teaching. Their monotonous voices and lifeless delivery made attending lectures feel like a punishment rather than an opportunity for learning. It seemed as though they were simply going through the motions, ticking off the boxes of a syllabus without any genuine interest in engaging with students.<br /><br />The instructors&#039; lack of subject knowledge was staggering. It was evident that they had not kept up with the latest research or developments in the field of linguistics. Their explanations were shallow, superficial, and often incorrect. It was as if they had picked up a textbook from the 1980s and decided to regurgitate its contents without any critical analysis or understanding.",
      "comment_grading": "this review is written by CHAT GPT",
      "comment_workload": "",
      "rating_content": 1,
      "rating_teaching": 1,
      "rating_grading": 1,
      "rating_workload": 1,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": true,
      "has_project": false,
      "has_attendance": false,
      "has_reading": true,
      "has_presentation": false,
      "upvote_count": 2,
      "vote_count": 6,
      "comment_count": 0,
      "attachments": []
    },
    {
      "hash": "wGXgyFGlg5PyNbHdFCJVORVBee3tJYFT",
      "semester": "2023-24 Fall",
      "instructors": [],
      "author": "Senior Pomidor",
      "date": "Nov 21, 2023",
      "title": "Обязательный курс хули",
      "comment_content": "Я честно в душе не ебу что мы делаем на курсе. Вроде бы цель курса познакомить с тем как правильно академически писать текст и тд и тп. Но вместо этого ты просто получаешь четыре больших задания и примеры правильных выполнений этих заданий. Я посещал каждый урок и записывал то что говорит проф, суммарно где-то пунктов 10 вышло которые относятся напрямую к заданиям. Остальные 1000000 часов уроков ты будешь просто сидеть и пиздеть о неинтересной хуйне в группах.<br /><br />Какие задания? <br /><br />1) Annotated Bibliography.<br /><br />2) Synthesis paper. <br /><br />3) Презентация <br /><br />4) E-magazine",
      "comment_teaching": "Ну блять слово teaching тут неуместно. Каждый урок был для меня моральной пыткой, ты сидишь в компании хуй пойми кого и пиздишь о хуй пойми чём, если у тебя нет ноутбука/планшета и тд то ты часто будешь сидеть за стулом и не понимать. Абсолютно после каждого урока LANG1404 я хотел пойти и убить себя. Вот честно я записывал почти все полезные вещи которые были, весь этот материал можно было выдать за один-два урока. Всё остальное время пиздим, а я пиздеть не горазд так что просто сидишь и слушаешь че там вокруг говорят. Тут можно сказать что я долбаеб ебанный который сам проебал возможности курса, и вот то что курс про то что нужно пиздеть. А мне блять просто физически это сложно, но даже так я пытался и любая моя попытка что-то сказать сливалась в унитаз. <br /><br />Но это всё моё нытье, так что можете забить хуй, профы вроде бы норм челы.",
      "comment_grading": "На три из четырёх заданий обратной связи по драфтам не дадут, так что хуй пойми зачем вообще нужна обязательная система драфтов. Тебя закидывает к ебаным бизнес студентам, которые на английском пиздят пол жизни и заставляют хуяриться с ними ради оценки, не понимаю кто подумал что относительный грейдинг внутри класса это охуенная идея(в классе 18-20 человек(?)). <br /><br />Самое смешное что курс невозможно дропнуть, я три раза пытался это сделать и выполнял все требования которые мне говорили, но в итоге на ласт запрос мне блять сказали &quot;Нет нельзя дропнуть, поменяй свое решение&quot;. А я искренне хотел заняться английским языком и потом позже взять этот ебанный курс. Но унику в целом похуй на тебя, твою жалкую жизнь, твои цели и так далее. Тебе даже ебанного выбора не дадут брать тебе 1404 или 1402, им похуй на то какие у тебя сабскоры были по аелтсу, если ты набил &gt;=7.0 то лети в ебанный 1404<br /><br />Скорее всего мне ебанут C+ или C, что до конца уника будет руинить мой средний балл.",
      "comment_workload": "Хуйня по идее, в теории всю работу которая есть на курсе можно выполнить за ~неделю. Самая большая проблема в источниках информации, но если выбрать хорошую тему и подтему то всё будет норм. Честно вот как только приедете в Гонконг в августе просто возьмите и заспидраньте выбор темы, написание AB и SP, если че попросите материал у кого-нибудь.<br /><br />Короче говоря курс 12/10, щас меня все обосрут и скажут что я даун так что вот вам заранее ответ. Чувствую себя ебанным жалким неудачником.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": true,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": true,
      "upvote_count": 24,
      "vote_count": 29,
      "comment_count": 0,
      "attachments": []
    }
  ]
}