{
  "course": {
    "id": 4343,
    "subject": "MATH",
    "code": "4824C",
    "name": "Causal Inference",
    "description": "This course is concerned with the statistical theory and methodology of casual inference with applications in precision medicine. Tentative topics include: potential outcomes, average treatment effects, randomized experiments, covariate adjustment, regression discontinuity designs, observational studies, confounders, sensitivity analysis, propensity scores, matching, doubly robust estimators, difference-in-difference, instrumental variables, heterogeneous treatment effects and optimal treatment regimes. Students without course prerequisite need to seek approval from the course instructor to take this course.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2330
    ],
    "prerequisites": "<a class=\"course-link\" data-subject=\"MATH\" data-code=\"3423\" href=\"/review/MATH3423\" target=\"_blank\">MATH 3423</a> AND <a class=\"course-link\" data-subject=\"MATH\" data-code=\"3424\" href=\"/review/MATH3424\" target=\"_blank\">MATH 3424</a>",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 5,
    "rating_grading": 4,
    "rating_workload": 4,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 1614,
        "name": "GUO, Xinzhou",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "AEhEk9Z2vf5mTUIlQWNw9l15f3noGCrY",
      "semester": "2023-24 Spring",
      "instructors": [
        {
          "id": 1614,
          "name": "GUO, Xinzhou",
          "rating": 1
        }
      ],
      "author": "happyhappyCGA4",
      "date": "Mar 08, 2024",
      "title": "Extremely useful course if you want to do empirical research in social science",
      "comment_content": "Course descriptions: This course is concerned with the statistical theory and methodology of casual inference with applications in precision medicine. Tentative topics include:<br />potential outcomes, average treatment effects, randomized experiments, covariate adjustment, regression discontinuity designs, observational studies, confounders, sensitivity analysis, propensity scores, matching, doubly robust estimators, difference-in-difference, instrumental variables, heterogeneous treatment effects and optimal treatment regimes.<br /><br />You can see all of the contents are important in causal inference. Since causal inference is a subject one must learn if he or she wants to conduct empirical research in social science (economics, business, public policy…), I suggest that if you want to pursue a PhD in social science or want to do some research, take this course if you have a chance.",
      "comment_teaching": "I think he can explain things clearly, but a little bit too fast. You need to have some background knowledge.",
      "comment_grading": "Assessment:<br />Assignments: 20%.<br />Mid-term: 20% or 0%.<br />Final: 60% or 80% whichever is higher<br /><br />I will update this part after the grade releases.",
      "comment_workload": "Assignment bi-week. Not a heavy workload,",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 4,
      "rating_workload": 4,
      "has_midterm": true,
      "has_final": true,
      "has_quiz": false,
      "has_assignment": true,
      "has_essay": false,
      "has_project": false,
      "has_attendance": false,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}