{
  "course": {
    "id": 3554,
    "subject": "OCES",
    "code": "4201",
    "name": "Environmental Microbiology",
    "description": "The course aims to introduce the students to (i) the fundamental features of microorganisms that live in the natural environment, (ii) the roles of the microorganisms in natural processes that drive our ecosystem, such as biogeochemical cycling, interactions with plants and animals, (iii) the use of the microorganisms in environmental technology. Key concepts are illustrated with real-life examples and case studies.",
    "categories": [],
    "website": null,
    "credits": 3,
    "semesters": [
      2310,
      2210,
      2110
    ],
    "prerequisites": "<a class=\"course-link\" data-subject=\"LIFS\" data-code=\"1030\" href=\"/review/LIFS1030\" target=\"_blank\">LIFS 1030</a> (prior to 2021-22) OR <a class=\"course-link\" data-subject=\"LIFS\" data-code=\"2060\" href=\"/review/LIFS2060\" target=\"_blank\">LIFS 2060</a>",
    "corequisites": "",
    "exclusions": "",
    "rating_content": 5,
    "rating_teaching": 5,
    "rating_grading": 5,
    "rating_workload": 5,
    "review_count": 1,
    "single_review": false,
    "enrollment_status": 3,
    "is_favourited": false,
    "is_subscribed": false,
    "user_review_hash": "",
    "contributor_has_more": false,
    "instructors": [
      {
        "id": 235,
        "name": "LAU, Stanley Chun Kwan",
        "count": 1
      }
    ]
  },
  "reviews": [
    {
      "hash": "nsDA9s5ENnyWXTSR66pSFPsTmCIljZEa",
      "semester": "2023-24 Fall",
      "instructors": [
        {
          "id": 235,
          "name": "LAU, Stanley Chun Kwan",
          "rating": 1
        }
      ],
      "author": "soysauce",
      "date": "Jan 28, 2024",
      "title": "no midterm or final! open book assessments!!! overcome your social anxiety!",
      "comment_content": "A LIFS-oriented OCES course. The content builds on LIFS concepts. There is a lecture on redox which may favour chemistry students, but if you read the notes carefully you should know what to do even without chemistry background.<br /><br />Topics<br />- Introduction to Environmental Microbiology&nbsp;&nbsp;<br />- Evolution of life <br />- Classification of prokaryotes&nbsp;&nbsp;<br />- Biogeography of microbes<br />- Functions of prokaryotic cell structure in relation to survival in the environment<br />- Bacterial growth and physiology&nbsp;&nbsp;<br />- Bacterial metabolism and biogeochemical cycling&nbsp;&nbsp;<br />- Socioeconomic importance of biogeochemical cycles",
      "comment_teaching": "Lectures mostly involve Prof Lau going through and explaining lecture slides. Important concepts/diagrams for quizzes are sometimes highlighted verbally in lectures. Prof Lau&#039;s lectures are not difficult to follow and he tries to keep students engaged. He also takes breaks from talking by playing videos on the topic (2-3 for each lecture) and he doesn&#039;t really interrupt the videos so we can learn/rest while they are playing.<br /><br />He has a sense of humour and uses jokes/analogies to explain concepts, but sometimes he scares us by explaining quiz questions differently from our answers which makes us think we did badly, and then when we get our grades it turns out any reasonable answer supported by a good explanation is accepted so we actually performed ok. He also highlights common misconceptions and strange answers generated by chatGPT.<br /><br />Willing to answer questions and listens to feedback. Individual quiz answer checking available on request. Responds to emails quickly.",
      "comment_grading": "The first quiz had a wide range of scores, but afterwards the range shifted upwards and most students passed. I&#039;m not sure about the grade distribution but it seems that it is not difficult to at least pass after getting a grasp of expected answers.<br /><br />Active participation in iPRS is needed to get all the participation marks-- they are practically free marks because you get them whether your answer is right or wrong. There are also bonus questions that are limited to the first few iPRS responders, and then these students have to say their answers out loud. Again, you will get marks whether you answer correctly or not, as long as you answer. The schedule of iPRS is irregular, so take the marks whenever you can.",
      "comment_workload": "very light workload for me<br /><br />Quiz 20% x 4<br />Class participation (iPRS) 20% (any answer will get you points)<br /><br />All open book, internet and chatGPT allowed<br />Concise answers encouraged<br />Sometimes chatGPT helps but I suggest using your own knowledge + lecture slide keyword search first, the course content needed for answers tends to be specialized.",
      "rating_content": 5,
      "rating_teaching": 5,
      "rating_grading": 5,
      "rating_workload": 5,
      "has_midterm": false,
      "has_final": false,
      "has_quiz": true,
      "has_assignment": false,
      "has_essay": false,
      "has_project": false,
      "has_attendance": true,
      "has_reading": false,
      "has_presentation": false,
      "upvote_count": 0,
      "vote_count": 0,
      "comment_count": 0,
      "attachments": []
    }
  ]
}